{"content":"Bulletins can include text, pictures, streaming videos, links to create new records and reports.Note: The Apricot Customer Care team periodically creates \"global bulletins\" that appear on the landing page for the Administrator tab. These bulletins alert all Apricot Administrators to Apricot news and updates. These will not interfere with bulletins you create for your users.To create a new bulletin, select the Administrator tab at the top of the page.In the left hand menu, select Bulletins under the Workflow Station category.On the right hand side, select \"Create new Category.\" Much like reports, bulletins can be organized in categories.Name your category.Select \"Create.\"\nSelect \"Create New Bulletin.\"Expand the black arrow to select a category.Name your new bulletin.Select \"Create.\"\n\nNote: Users must be granted access to the bulletin via their Permission Set.  +HTML Bulletins\nNow you can create a new bulletin.1. Type: Choose between HTML or Report. An HTML Bulletin should be used for text, pictures or video. A report bulletin will load a copy of a report that has been created in the report center.2. Dates: Enter the dates you would like your bulletin to appear to your users. \nNote: If no end date is selected Apricot will automatically set the end date a year out. i.e. 03/15/2019-03/15/2020.Bulletins expire at midnight.3. Only bulletins that have \"Active\" selected will appear to your users. \"Start Collapsed\" means that the bulletin will not automatically expand to show the message when the page loads and users will have to expand it to view it. If your bulletin needs to be seen by everyone, do not select \"Start Collapsed.\"4. Bulletin header colors default to your Apricot theme settings, however unchecking this will allow you to pick a header color.5. This is where you can select a custom header color if you don't want the default.6. Styles, Font, and Size of your text can be adjusted.7. When you are finished, don't forget to click \"Save Bulletin\". What an HTML Bulletin looks like\nTo view your bulletin, click the My Apricot tab.You should be able to see all active bulletins. As an Administrator you will see all bulletins.To create a report bulletin, select \"Report.\" The text box will be replaced with a report drop down menu.Enter start and end dates.Select the report you would like to display.Number of Columns: If your report has more than one section or it contains a graph as well as rows of data, these can appear in one column or in side-by-side columns.Save bulletin.\n\nNotes- For a Standard User to see a \"Report\" bulletin they must have access via their Permission Set the following items:Access to the bulletinAccess to the reportAccess to all forms/records within the report- Reports displayed in the Bulletins won't be able to sort the column's data.- Report Bulletins are not able to display Filters or Global Values.Many times, you may want to use an image in a Bulletin that is currently not hosted online. You can use the Shared Files to get around this limitation by uploading the image as a Shared File in your site. Additionally, you can use this method if you are afraid the URL to an image that you are using elsewhere might change (or the hosting service may change the image). This method applies to HTML Fields as well.First, make sure the image you want to use is saved onto your computer. In our scenario we will use the Desktop.Optional: you may already have a Shared File Category that you want to use, if you do you may skip this step.Head to the Administrator tab.Click on Shared Files.Click on Create New Category.Give the Category a name.Click on Create.Next, we will choose Upload.Select a Category.Click on 'Choose File' and locate the image.Choose Upload.Next, we will need to copy the Image URL.\n\nClick on My Apricot.Choose My Shared Files.Expand the Category which the image was placed in.Hover over Actions.Right Click on Download.Select \"Copy link address\" Note: Depending on your operating system and/or browser the wording may be slightly different.Next, we will head to the Bulletin that you are creating/editing and add the image.\n\nClick on the picture icon.Paste in the URL that was copied into the \"URL\" box. It should start out with \"https://apricot.socialsolutions.com/upload/download/\". If it does not, it did not copy properly.You may adjust the Width and Height to re-size the image.Click the refresh Icon to see a refreshed preview of the new size. Note: The text below it will not show up on the form.Click OK.\nAs always, remember to save the Bulletin when done.\n What a Report Bulletin Looks Like\nThe ability to see certain bulletins is a permission set that can be managed through User Profiles. You can assign a specific bulletin - like one showing due dates or displaying a report of caseload names - to specific users or a specific group of users. In Role Based Permissions, assigning permissions to Bulletins is the same as assigning permissions to a report or form. If you have already assigned access to bulletins in a certain category, you can add new bulletins to that category and adjusting the permissions will not be necessary. But if you create new categories to organize new bulletins, you will have to update user access to make sure the correct users can see them.To access the User Profiles, open the Administrator tab.Select Users under the Access Control category.Select a user.Scroll down to the section for Assigned Permission Sets.Click the text of the permission set you would like to adjust.Or click Add to create a new permission set.\nWhen the permission set opens, scroll down to the section for Assigned Users. Here you can add users if necessary.Under the section for Permissions, select the Bulletins tab.Select \"View\" for the bulletins you want your user to see. Granting access to an entire Category grants access to all bulletins within that category.If you have many programs and/or permissions sets, if may be useful to name a bulletin category after each group. Then you can assign access to make sure each group can see the specific bulletins that pertain to those users.4. Save record. You have now granted access for a user to view a bulletin. Bulletins can be created, edited, or deleted at any time.Deleted bulletins cannot be restored. A best practice is to save all of your bulletins and uncheck the \"Active\" box for bulletins you no longer need.Inactive bulletins will still be listed in the bulletin permissions.Bulletins cannot be pulled into reports.In order to adjust filters for report bulletins, the change will have to be made on the edit side of the report and publishedBulletins can be printed from your browser.The starting step to a workflow should not be utilized in a bulletin. This causes the workflow to be unable to function properly. Workflows should always be started from the My Workflows link under the My Apricot Tools dropdown.If a bulletin is not viewable or missing, check the permissions of the user to access the bulletin, and if applicable, the report/forms/records associated with the bulletin. If no one is able to access the bulletin, go to the edit side to be sure it has not expired. ","title":"Bulletins","url":"https://apricot-articles.socialsolutions.com/en/articles/1817553-bulletins"}