{"content":"If you need to create many records that are similar to each other, it may save time to create one record and then copy it to create more records that contain nearly the same information.Before you can copy a record you must ensure the function is enabled. This setting is applied on a form by form basis. In the Administrator tab you will want to go to Standard forms and Edit the form for which you wish to enable record copy. To enable:Click on the Form Settings GearMake sure \"Allow Copies\" is checkedClick ApplyClick Publish FormTo copy a Tier 1 record, select \"Copy Record.\" If \"Copy Record\" is not available in this menu on the right hand side, then copying has not been enabled on the Administrator side within the design of the form.Once the record is copied, you can choose to \"Reload Original Record\" or \"Go to Copy\".Copying a Tier 2 record works in much the same way as copying a Tier 1 record, but the copies will always be created to live under the same Tier 1 record if you do it from the record itself. If you would like to copy a Tier 2 record from one Document Folder to another Document Folder please see the Document Folder article.If you need to create several similar records for different people, or to live under different Tier 1 records, you may find Apricot's batch record creation feature to be useful. For more information, click here: Batch Records Tool Some fields can be designated as \"Clear on Copy,\" which means that their values will be cleared out when a record is copied. To change what fields are included in \"Clear on Copy,\" please see the Help Center section on Editing Forms.Important: It is possible to create records via copy that have no data in them at all. For example, if you have \"Clear On Copy\" set for every single field on a form (which is possible) and then a user uses the copy record function, that record will have no data in it at all. If the user then chooses \"Continue\" instead of \"Go To Copy\" they will never know it did that. We highly advise that you instruct all users who will use the Copy Record function to always click on \"Go to Copy\" to look over the record to ensure it has the proper data in it.There isn't a way to undo a record copy. The accidental record will need to be Archived. You may not have the permission to do so and if not please contact your Administrator.Clear on Copy will even clear \"required\" fields. If you go to the copied record and try to update the record you will need to fill out that now missing, required field.Duplicate Check fields will always be Clear on Copy, there is no way to turn off Clear on Copy for these types of fields.Duplicate Check cannot be selected on fields of Tier 2 Forms that Allow Copies.If you have an email trigger on the form that is set to send an email on \"creation\" it will not send on record creation via copy.If you have an email trigger on the form that is set to send an email on \"update\" it will send after the record is copied if you click Save Record.Check your linking fields! Links are also copied! Important to check all linked forms (the \"base\" and \"target\" link).Copying records is NOT the same as copying a form. If you need the structure of a form copied to become a new tier 1 or tier 2 form, please reach out to support.","title":"Copying Records","url":"https://apricot-articles.socialsolutions.com/en/articles/1817261-copying-records"}