{"content":"IMPORTANT: Please keep in mind that you cannot pull these fields into reports with standard functionality (Ongoing Support will be unable to assist in any non-standard features including Custom Expressions). Additionally there is not a mass export option for these fields. If at any time you would need to get these files from Apricot you will need to go into each individual record and download each document/image from their respective field to your computer.Open the form you want to edit in Form Designer.In the Field Choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your form.This field allows the user to attach a document or file to the record they are creating by clicking a browse link to search for the stored document on their computer. Once saved, a link to the file will show up on the record for anyone with access to open or save. File size is limited to 25 MB.Microsoft Office (.doc, .docx, .xls, .xlsx, .pptx),Comma Delimited (.csv),Open Office Spreadsheet (.ods)Adobe Acrobat (.pdf),Image files (.gif, .jpeg, .png),Text files (.txt, .pdf, .csv,).Text/HTML files (.html, .htm).Open Document (.odf),Zip files (.zip, .zipx),Microsoft Office (.docm, ,xlsm, .pptm).Image files (.bmp, .tiff),High Efficiency Image Files (.heif, .heic)Audio Files (.m4a, .mp3, .wav)This field can be made Required or used in Quick View.The image field will allow users to upload .jpg and .png image files from their computer to be displayed in the record. If you make the image field Quick View, it will appear on the search page and in the document folder. NOTE:  Image fields will not be able to be downloaded, so if you will want to retrieve the image for use an Attach Doc field would be better. You can right click on the image once uploaded to save the image to your computer, however, there is a significant impact to the size and quality of the image.You can set the pixel height and width for uploaded Images. The minimum size for any uploaded image is 100x100 pixels. Maximum size (in pixels) depends on a user's monitor size. Images larger than 100x100 pixels may cause fields next to the image field to be less visible and less accessible for data entry. If you are setting the width and height for an uploaded image to be larger than 100x100 pixels, we recommend placing the image field in its own section on the form.This field can be made Required, Locked or Hidden as well as Quick View.Attached Image fields will display the image on the record once the record has been saved.Attached Images might be rotated (for example, to the side or even upside down) depending on how your camera operates/saves the metadata. If this happens please refer to your camera's manual on how to adjust this information as it cannot be rotated or adjusted in Apricot.Attached Doc fields cannot be pulled into a report and cannot be retrieved from the database en masse.The Preview File function is only available for .pdf, .png, and .jpg file types. ","title":"Upload Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/1817540-upload-fields"}