{"content":"Select the \"Administrator\" tab.In the left-hand menu, click Workflow Station.Select \"Apricot Settings.\"If you make any changes, select \"Save Settings\" before leaving the page.The \"User Licenses\" section details the number of Standard and Administrator seats you have purchased for your Apricot database. It also shows how many of these seats you are currently using.Note: Administrator seats take up one Administrator seat and one Standard seat.If you have the \"Guest User Access\" feature, you will see an area showing \"guest seats\" and the number of guest forms you have available.If you need to add or change which forms are made available to Guest Users, you can add them here under \"Guest Forms\" by expanding the black arrow and selecting a form.The \"Security\" section allows an Administrator to set or adjust minimum standards for user passwords. An Administrator can set:Minimum Character Length: The minimum number of characters contained in a valid password.Password Complexity Requirements: The minimum different kinds of characters used in a valid password.Days Before Passwords Expire: Set the number of days before a valid password will need to be reset. This setting will take effect immediately. For example, if you change this setting to 30 days, any users who have not updated their password within the last 30 days will be prompted to do so upon their next login.Previous Passwords Ineligible for Use: The number of previous password that will not be accepted as a password change/update.NOTE: Apricot password requirements have changed as of Sept. 28, 2023. To enhance Apricot security, users are required to use passwords that adhere to the following security standards:Password length: 12 characters minimumAt least 1 uppercase letterAt least 1 lowercase letterAt least 1 symbolAt least 1 numberThe last 24 passwords cannot be reusedPasswords must be reset at least every 365 daysIn cases where your Apricot instance has password security settings below our minimum requirements, they will be automatically overridden. To read more about this password update, please visit the following help article.5. System Inactivity Timeout: The amount of time before the system will automatically log out an inactive user and require login to resume an Apricot session.6. User Inactivity Timeout: Allows Admins to restrict users from logging in to Apricot if they have not logged in X amount of days.\n7. System Use Notification: Allows the Admin to set up a message that will appear upon logging into Apricot. The default message is displayed below but it can be personalized by your organization.\n8. Multifactor Authentication: Multifactor Authentication (MFA) is an added security feature available to Apricot Core and Apricot 360 Users in the United States.  More information about MFA can be found here.A La Carte Features - Standard\nThe \"A La Carte Features\" section contains information on two kinds of features that can be added to your Apricot - \"Standard Features,\" which can be turned on by an Administrator for no additional cost, and \"Premium Features,\" which must be turned on by the Customer Care team, usually for an additional fee.Standard features include:Auto Search: When Auto Search is selected, any record search page in Apricot will allow a user to automatically search through all available records by typing as little as one character. When it is turned off, a user will be required to click the Enter key to begin the search.Record Audits: The Record Audit tool allows Administrators and users to search for and access records in both their current version and in all their previously saved versions. You can use this tool to un-do data entry errors by reverting a record to a previously saved version.Secure Web Forms. This tool allows administrators to create a direct URL, or web address, that bypasses the standard login and allows a user to directly access a Tier 1 form for only data entry.A La Carte Features - Premium\"Premium Features\" can only be turned on by the Customer Care team and usually incur an additional fee. They include:Aggregate Reports: Comes with Apricot 360. Reach out to your Account Manager if you're interested in upgrading to Apricot 360. Apricot Mobile: Coming Soon! Sign up for our Product Newsletter here.Connect: Comes with Apricot Core and above. Allows the ability for external users to create a Tier 1 and one associated Tier 2 record in your Apricot. Read more about Connect here.Document Folder Merge Tool: If you identify duplicated Tier 1 records, this tool can merge the associated Tier 2 records into one folder. This feature is available to all Apricot organizations, please reach out to support if you're interested in having this feature turned on.Form Logic: Conditionally shows and/or requires fields on a form based on other data that has already been entered. You can read more about Form Logic here.Program IP Restriction: Limits access for groups of users based on the IP address or the location where they log in.Guest User Access: This feature allows people from outside an organization to log in to Apricot and access a specific form for data entry. They are not counted as users, but instead are categorized as \"guest users.\" Guest User Access is an a la cart feature, reach out to your Account Manager if you're interested in purchasing it.Import Tool: Permits the import of outside data into your Apricot via Excel spreadsheets in .csv format. Read more about Import Tool here. Integrated Exchange Calendars: Used with the scheduler field; allows for schedule requests and invitations to be created and emailed to Apricot users who have an integrated Exchange account.Integrated Gmail Calendars: Used with the scheduler field; allows for schedule requests and invitations to be created and emailed to Apricot users who have an integrated Gmail account.Referrals: Used to allow standard users in particular programs to refer clients to other programs within the same Apricot instance.Registration Grid: Creates multiple Tier 2 records for multiple selected Tier 1 records from an easily completed grid format. Records created using the registration grid can be viewed in the grid format, or within the Tier 1 document folder.Track Record Views: This is similar to the Record History - Audit tool, but with this tool you can view each time a record has been opened or viewed by a user. This feature costs no additional fee but may not be enabled by default in all Apricot instances. Please reach out to support if needed to enable this feature.Workflows: Allows Apricot Administrators to build workflows, guiding data entry through Apricot for front end users.\"General Configuration\" settings include:Reply-to: When emails triggers are sent from a record, the email address provided here is the default \"sent from\" email address. This will also be the recipient email address that receives replies to email triggers. If left blank, the default Reply-to email address will be apricotsoftwarealerts@gmail.com.  ***Note that this field must contain either a blank value or a valid/complete email address. Any other value will cause email triggers to fail.***Sent From: When emails triggers are sent from a record, the contact name provided here is the default \"sent from\" contact name. This setting will only work if you have a valid email address entered in the Reply-to field discussed above.Time Zone: The time zone established here will be reflected in time stamps on when records are created or modified, when reports are created or run, etc.Field Format: Here you can designate that you would like access to form fields in US, Canada, or UK format.When creating new records via linking, open in: You may select how new records will open via the linking field, \"New Tab\" or \"New Window.\" This will apply to all linking fields across the entire database.Logout URL: Allows a specific URL to be designated as the webpage that all users will be redirected to upon logout. If no Logout URL is specified, users will automatically be redirected to the Apricot login page. The use of a Logout URL is recommended for databases utilizing the Secure Web Form feature, so that the individual creating the record will be redirected to a more familiar environment upon logout.Homepage Title: The primary header on the \"My Apricot\" page can be modified to better reflect the needs of your organization.IP Allowlist (IP Whitelist): Allows the Apricot instance to only be accessed from designated IP address(es) entered here. Attempting to access the Apricot from an IP address not included in this designated list will result in a failure to complete the login process. To add a new IP address to the allowlist/whitelist, type it into the blank text box and click Add. To remove an address, click the x next to the IP address.AccessibilityAccessibility settings include changing the My Apricot and the Administrator tab color scheme to:Blue and Mint. The Blue and Mint color scheme resembles the default color scheme for the Administrator side of Apricot, although it can be applied to the user side or My Apricot side of the database as well. Backgrounds are blue and text is either gray-scale or mint.Black on White. In the Black on White color scheme, backgrounds are either full black or full white. Text is either full black or full white, depending on the background color. Some objects - like icons or photos - will not be affected by the change in color scheme and will retain their original color. If you use HTML label fields or HTML code with colored text, these colors will all appear as black or white. Black on Yellow. In the Black on Yellow color scheme, backgrounds are either full black or full white. Text is either full black or full white, depending on the background color. Any field that is available for entering data is yellow.Text Option: \"Full Black for All Text\" is available. It changes all grayscale text to full black.Actions Menu Options: Many \"Actions\" in Apricot are available in an actions tab where users can create new records, edit existing records, and create new forms. The Actions tab can be changed here to a dropdown menu in the right hand palette of many Apricot pages, which makes it more compatible with screen readers for visually impaired users.Action Dropdown:\nPalette Dropdown:Intercom: This option allows Administrators to turn off the Apricot chat support bubble for Standard users of their Apricot\nExchange IntegrationExchange Service Account Username: When you have the Integrated Exchange Calendars this is where you will place the service account usernameExchange Server Address: This is where you will enter the Exchange Server addressService Account Password: This is where you will enter the password for the service account usernameResource Allocation\"Resource Allocation\" provides details on how much data your Apricot database is using.Upload a LogoYou can upload a picture file to serve as your logo.Select \"Choose File\" under \"Upload a New Logo Below.\"A dialog box will open, allowing you to choose the picture from your computer that you would like to upload.Select \"Open.\"Your logo will appear at the bottom of your Apricot pages and in the \"Current Logo Image\" box on the \"Apricot Settings\" page.Apricot Version\nThis is where you can find out what version of Apricot you are running. Please note, most upgrades occur automatically and there is no opting out. ","title":"Apricot Settings","url":"https://apricot-articles.socialsolutions.com/en/articles/1817601-apricot-settings"}