{"content":"Apricot's report filter is designed to generate customized formulas to fulfill a variety of reporting needs. Filters can be used to narrow or focus your results, personalize your reports, and clarify findings.Filters take a column of data and restrict it or narrow down the results that will appear in your report. Your Apricot still contains all that data, but now your report can be more selective in what it shows.Adding a FilterFilters work by narrowing down the data that has been pulled into a report. Before adding a filter, make sure you have pulled the necessary columns into your report.To add a filter, click on the + sign to the right of the filters area of the report section. The \"Filter Properties\" window will open.Under \"Rule,\" choose the column you would like to filter.Once you have chosen your column to filter, expand the line under it. You will see a variety of filter options depending on what kind of data you have in your column. Numeric data will have different options than text, for example.Under Options, you can further clarify your rule.Inverse: Reverses all the criteria options.Locked: When locked, this filter will not be able to be edited in the run version of the report. This option is selected by default but can be deselected to allow users to change the report's filtering without editing the report.Hidden: You can hide filters, which can be useful if you wish to unclutter the view of the report in run mode.Global: Global filters connect the filter to the \"Global Values\" area at the top of the report.Comparison: Can be used to compare the data in one column of your report to another column (where Column A is greater than Column B, for example).2. Finish your filter configuration by adding a value to the last field under rule. This field defines the values by which you wish to filter the column.3. When you have finished, click \"Apply.\"Adding Multiple FiltersMore than one filter can be added to a report.Each time you want to add a filter, click the + to the right of \"Filters.\"Each of your filters will be listed here. To edit them, click the green text and the filter properties window will open for editing.When you have more than one filter, a Filter Logic section will appear beneath the list of filters.Filter LogicBy default, filter logic is set to run all the filters on all the data - it will only show results that qualify after all the filters have been applied to the data.Clicking into the Filter Logic field allows you to prioritize how the filters run. You can add \"or\" between two filters and the report will show results that have at least one of the answers you are looking for. Enclose \"or\" conditions with parentheses. For example, \"1 and 2 or 3\" will need parentheses added to become \"1 and (2 or 3)\".Once your filters have been set, publish your report.Global Values FiltersA Global Value is a user-defined value that can be cascaded into multiple filters at once. \nWhen to use the Global Value option in a filter: If many report sections in the same report contain the same filter which needs its value changed often, you might find it easier to use a Global Value instead. Global Values also allow users to change filter values without needing edit access to the report.Here we have created a Global Value for the \"Service Date\" and given it a default value of 01/25/2015. If we apply this Global Value for all our report sections, then next year we can change the Global Value for the start of the next reporting period and the change will be updated into all the filters in the report that reference that Global Value.Adding a Global Value FilterAt the top of the report, click \"Add\" in the \"Global Value\" section of the report. The Global Value properties window will open.Name the Global Value.Choose a data type for your value. The Global Value can only be applied to report columns that have the same data type. For example, only Date type Global Values can be used with filters on date columns.Enter a default value.When you are finished, click \"Apply.\"Next you will need to build a Global filter.In your report section, add a filter by clicking the + sign.Under \"Options,\" choose \"Global.\" Now the Global Values you entered at the top of the report page will be available for this filter. Only Global Values with data type that matches the column's data will be available in the filter's properties.Adjust your filter details.Click \"Apply.\"Your new Global Filter will appear like this in your filter list. The Global Value that has been pulled from the top of the page will be shown with brackets around it [ ]. Any changes you make to the Global Value at the top of the page will automatically cascade into filters in any sections of the report that reference it.Filtering on Multi-Select Type Fields (Checkboxes and Multi-Select Dropdowns)Filtering on multi-select type fields will display different end results than most will expect; however, the counts provided will still be correct. Let's look below at our example screenshot. We can see that everyone likes a different genre of music, or combination of genres:In the above screenshot, we can also see that the report displays every type of genre they selected. Now, lets say we just want to see those who chose \"Country\" so we filter for just country:We can see that it still lists the other options they chose, even though we filtered for \"Country\" only. This is expected since Apricot will always display the stored values. But, if we look at our section count in the bottom right (since we have it set to count the unique Tier 1 \"Participant Profile\" counts) the count is still correct even though Apricot is displaying the other stored values. Therefore, you won't be able to get counts as you traditionally would if we were to go into grouping.Tricks & TipsGlobal Values can only hold one value at a time.Global Values are not available to users when viewing the report inside a Report Bulletin in the My Apricot tab. To access the Global Values for such reports, you must click the \"View Full Report\" at the bottom of the bulletin.When copying a section to a different report, any Global Filters will need their Global Values re-created at the top of the report the section is copied into.","title":"Using Filters in Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/1817611-using-filters-in-reports"}