{"content":"User Information\nIn the upper right hand corner of your Apricot screen, you will see information about your database/organization name and your username. This area is referred to as your User Badge.User Preferences\nIndividual users may personalize the color and text contrast levels of Apricot.After logging in, click on the user badge in the upper right hand corner.Select User PreferencesUser Preferences MenuExpand the black arrow on one of the drop-down menus to access the available color options. (Note: Anything marked \"Site Setting\" will have the appearance chosen by the Administrator for the entire Apricot site and cannot be edited.)Only users with access to some of the features on the Administrator tab will see options for changing the appearance under the Administrator tab.Once you have made your selections, click Save User Preferences.Color Scheme - Black on WhiteIn the Black on White color scheme, backgrounds are either full black or full white. Text is either full black or full white, depending on the background color. Some objects - like icons or photos - will not be affected by the change in color scheme and will retain their original color. If you use HTML label fields or HTML code with colored text, these colors will all appear as black or white. Color Scheme - Black on YellowIn the Black on Yellow color scheme, backgrounds are either full black or full white. Text is either full black or full white, depending on the background color. Any field that is available for entering data is yellow.Color Scheme - Blue and MintThe Blue and Mint color scheme resembles the default color scheme for the Administrator side of Apricot, although it can be applied to the user side or My Apricot side of the database as well. Backgrounds are blue and text is either gray-scale or mint.Text Options - Full Black for All TextFull Black for All Text is a subtle change - background colors remain unchanged, but any text that would have appeared as gray will now be changed to full black. If you use HTML label fields or HTML code with colored text, these colors will all appear as either black or white.Actions Menu Drop-downAnother option available under User Preferences is selecting how you would like to access Action Menus throughout Apricot.Actions Drop-down is the traditional tab that allows you to create new records from a document folder.Palette Drop-down moves this function to a palette on the right-hand menu. It is easier to use for low vision users or user who navigate by keyboard or by using the tab key.Using the Palette Drop-down in My ReportsIn My Reports, on the right-hand side will access reports by first selecting a report category from the drop-down.Next, you will select the specific report from within that report category.Last, select the action you want to take with the report.  In this example you can Run, Print, Export, or Edit the report.Using the Actions Drop-down in My ReportsTo use the Actions tab click the report category to expand the list of reports within it.Find the report you want and mouseover the Actions drop-down.Click the action you want to take with the report.  In this example you can Run, Print, Export, or Edit the report.","title":"User Information and User Preferences","url":"https://apricot-articles.socialsolutions.com/en/articles/1817521-user-information-and-user-preferences"}