{"content":"A diverse selection of fields is available in Form Designer, some tailored to correctly collect very specific kinds of data. Here we will go over linking field types. Please keep in mind that no single form should ever exceed 100 linking fields.Adding a Field to a FormOpen the form you want to edit in Form Designer.In the Field Choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your form.What is Linking?Whenever you want your Apricot database to bring data from one record into another record, you are asking it to connect or \"link\" two records that may not otherwise be connected. There is automatically a link between a Tier 1 form and all the Tier 2 forms that live underneath it. But if you need to connect records that exist beyond this Tier 1-Tier 2 relationship, you will need to establish a link between those records.Note: It is not recommended to use a linking field between a Tier 1 form and one of its own Tier 2 forms, as reporting can be made difficult.Imagine that you have a \"Client\" form that is a Tier 1 and that you also have a \"Household\" form that is a Tier 1. You may want to show which Client records belong to the same Household - in this case, you would want to link those two forms and their associated records together. This would enable you to build a report which shows each household and then which clients belong to it (you can use grouping to better display this information as well).LinkThe link field establishes a relationship between records that would not otherwise be associated. It does this by connecting one form to another. When this field is added to a form, it needs to be configured before the form can be published. This field can be made Required, Hidden, and Quick View. When deciding which form to add a link to, in most cases it is a good idea to choose the form for which you expect to create a larger number of records. For example, let's say we have a Tier 2 Program Enrollment form and a Tier 2 Service form. We want to create a relationship between the Program Enrollment form and the Service form since the Service form will relate back to the Program Enrollment form. Using the above guidelines, for this example we would choose to place the link field onto the Service form (this makes it the base link) as we will be creating many Services records and only a few Program Enrollment records by comparison. Remember, this will also place a link onto the Program Enrollment form as well (the target link).Before the form is published this will be a dropdown. Since we are currently on the Services form we will link it to the Program Enrollment form. This also means our \"base\" form is the Services form.This is where you tell Apricot how many records can be linked onto this form/record. For example, this is saying \"Only 1 Program Enrollment Record\" can be linked to this Service record. A service record based on \"best practices\" should not generally relate to multiple programs at the same time.This is where you tell Apricot how many records can be linked to the other form/record. For example, this is saying \"Many Services records can be linked to 1 Program Enrollment record.\" In this example, this enables a program to be linked to many different related services. We know that clients may have more than one service for each program, and we have chosen these options accordingly.Wizard Style linking is an advanced linking feature which enables you to create a new record of a linked form while working within a record to improve workflow. Show Associated Records will show the Quick View information of other linked records of the same form. This will not apply for all linking scenarios (generally, this will be used for Tier 1 to Tier 1 linking. For example, Household to Clients).Show Link Description will allow you to add extra information when creating a link. For example, you might want to use this for a Tier 1 to Tier 1 linking when doing the Household to Clients. This would enable you track who is the \"Parent/Guardian,\" \"Child,\" \"Aunt\" \"etc,\" while establishing the link. Otherwise you couldn't track this information easily.The Tooltip will give data entry users a customized hint of your choice for using this field.Auto PopulateThis field pulls information from another form and automatically populates that value into the auto populate field. To add this field to a form, your form must already have a link field configured (Note: the linking field must be a Base linking field for auto populate to work).This field can be made Required, Hidden, Locked, or Quick View.\n\nFor more additional details on the setup, use-case, and hints/tips on the Auto Populate field please see the Auto Populate article.Dynamic FieldsDynamic Fields are generally a type of linking field which creates a link between two records while saving values of one record onto another. For example, in our screenshot above the \"Caseworker\" dropdown is a Dynamic Dropdown. Let's say in theory that this is pulling from records of a form titled \"Staff Profile\" which also has contact information about the staff members. When they pick a caseworker, that value is saved in the dropdown for that client and because it is linked, you can later build a report displaying the volunteer's contact information. This would be a Tier 1 to Tier 1 link (however, many different types of configurations are possible).Note: Dynamic Fields will generally be set up by the Implementation team or Professional Services team.  If you would like Dynamic Fields added to your database, contact your account manager.QueriesAny Dynamic Field will require a Query to properly run correctly. You will need to contact your Account Manager in order to discuss your options for having a query built into your Apricot site.Dynamic CheckboxThe dynamic checkbox field pulls information from records that have been created of another form. They are displayed as one checkbox menu, much like the regular checkbox field, and users can select more than one option. With a dynamic checkbox field, a link is created between records for each selection made.This field needs to be configured before your form can be published and made available to users. Configuring the field will necessitate that a query has been written in advance of pulling the dynamic field onto the form.This field can be made Required, Duplicate Check, Locked, Quick View, Searchable, and Hidden.Dynamic DropdownA dynamic dropdown field pulls information from records that have been created of another form. They are displayed as one dropdown menu, much like the regular dropdown field, and users can select only one option. With a dynamic dropdown field, a link is created between records when a selection is made.This field needs to be configured before your form can be published and the field can be made available to users. A query needs to be written in advance before it can be used in this field.This field can be made Required, Duplicate Check, Locked, Quick View, Searchable, and Hidden.User CreationUser Creation is a field that allows the individual filling out the record to create a new Apricot user account. The information entered into this field will be added to the list of users who have access to information within the Apricot database.This field will need to be configured before the form can be published and made available to users. To use it, your Apricot needs to have the Guest User Access feature turned on (Apricot for Funders includes this field type as well) and at least one sample guest user already set up in the system. The users created with this field will always copy the access and permissions given to the sample guest user.This field can be made Required or Hidden. It is Required by default.User to copy: this is the Guest user that this field \"copies\". Note: configurations can vary, the user it copies should have the proper Groups and Permissions set up and attached to that user in most scenarios. Please contact Ongoing Support if you need any advice on your specific setup.Show 'User Created' Message on Record: this will show a message after a record is saved to inform the user that their user account was created without errorThis field should only be used on a Tier 1 formYou may want to use a Secure Web Form when implementing a User Creation field (this would allow anyone to go to your site to create a user account. This setup can be beneficial for some scenarios, please contact Ongoing Support if you aren't sure if this option is for you).","title":"Linking Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/1817572-linking-fields"}