{"content":"Your Apricot allows you to create the forms that you need to provide services, and to collect data on the services and activities your organization provides. When you fill out one of these forms, you create a record.\nForm: In the picture below the form is called Client Intake, this is the medium that collects the data.\nRecord: In the picture below the records are the rows of data that we see of the Participant form. For example, \"Alvy M Singers' Client Intake record.\"Creating Tier 1 Records:\"Tier 1\" is the name we give to the main forms available for collecting data.To find the names of your Tier 1 Forms, click \"My Apricot\" at the top of the page.The forms listed on the left-hand menu are your Tier 1 Forms. Clicking a title here will allow you access to the records that have been filled out for a specific Tier 1 Form.We've chosen \"Participant\" and the search screen for all the Participant records open.To create a new record, access the right-hand menu and click \"New Participant\".Creating a New RecordWe are now looking at a new record and are able to fill out client data.Click into the available fields on the form to fill in new data.The \"Record Save Checklist\" on the right-hand side keeps track of which fields are required to be filled out before the record can be saved. Fill in all the required fields.Click \"Save Record.\"Saving a RecordOnce you have clicked \"Save Record\" and the record has been saved successfully...You will get a \"Record Saved\" pop-up window with the following options:Continue: Keeps you on the same page.View Folder: Takes you to the Document Folder for the record you have filled out.Go To Search: Returns you to the search screen for the form you have filled out.Opening and Editing an Existing RecordTo find and edit records that have already been filled out:Click the \"My Apricot\" tab.Choose the form from the left-hand menu.If you need to narrow down the results on t he search screen, expand \"Add Search Field.\"Type into the new search field. The results will respond and narrow down as soon as you enter anything, even if it is just one letter (if you have auto search enabled in Apricot Settings).Choose the row of data you need. Each row on this page represents one record. For example, if you select the left-most column (here, the name of the client), you will be taken to the Tier 1 record associated with this client name.If you choose a column to the right of the \"Name\" column, you will be taken to the Document Folder where you can see all records that have been filled out for this client.When you open an existing record, information that has already been entered will appear on the screen where it can be edited or left as is.When you are finished making adjustments, click \"Save\" in the right-hand menu.Note: If the \"Quick View\" column is orange, it will always take you to edit mode for the record. If the text is not orange, it will take you to the associated Document Folder.Menu Options in a RecordSave Record: Commits changes and saves any new information that has been entered.Print Mode: Generally this gives you a print menu where you can choose where to print it. Some browsers, like Chrome, may allow you to \"Save as PDF\" instead. Please check your browsers documentation for specifics.Archive Record: This moves a record from the Document Folder to the Archived Records location. Archived records cannot be reported on but can be restored by an Administrator. Only Administrators can Archive Tier 1 records and they can allow or not allow the archival of Tier 2 records. Please check with your Administrator if you are uncertain.View History: When \"View History\" is selected, a Record History menu appears, showing when and what changes have been made. Must be turned on by your Administrator in your site.New Client Profile: Opens a new, blank Record to be filled out.View Folder: Takes you to the Document Folder, where you can see all the records that have been filled out for a specific Tier 1 record.Go to Search: Takes you back to the search screen where you can search for and open a different record.Note: If you are missing an option, please check with your Administrator first. They may have it disabled. Creating Tier 2 Records\"Tier 1\" is the name we give to the main forms in your database. They are always accessible on the left-hand menu.\n\"Tier 2\" is the name we give forms that live under, or feed off of, information in the Tier 1 Record.To access Tier 2 Records, open the \"My Apricot\" tab.Choose the Tier 1 Record that houses your Tier 2 information.Select a row of data by clicking on the right side, which will take you to the document folder.This is the Document Folder, where you can see available Tier 2 Forms and Records for this particular client.The \"Quick View Information\" tab at the top can provide you with specific client information from the Tier 1 Record that has already been filled out.Under \"All Documents,\" you can see all the records that have already been filled out. To access them, expand the green plus icon next to the form name.To create a new Tier 2 Record, Click the grey plus icon to the right of the tier 2 form name.  For more details on creating tier 2 records Click Here.You can also create a new tier 2 by clicking the \"Create +\" button near the top and choosing which tier 2 from the list.Filling Out a Tier 2 RecordTo Access the \"Quick View Information,\" expand the gray arrow at the top of the page.Once you have entered the correct data, click \"Save\" in the right-hand menu.After your record has been saved, you have the option to Print, Archive, Adjust Access, View History, Create a New Record, View Folder, or Go to the Search page, just as when you saved a Tier 1 Record.","title":"Creating and Editing Records","url":"https://apricot-articles.socialsolutions.com/en/articles/1817605-creating-and-editing-records"}