{"content":"Accessing Form DesignerSelect the Administrator tab at the top of the page. This will take you to the Administrator side of Apricot.Select Form Designer then \"Standard Forms\" from the left-hand menu. This will show you a list of all forms that currently exist in your Apricot.To create a new form, select \"Tier 1 From Scratch\" or \"Tier 1 From Template\" on the right hand side. \"From scratch\" simply means that you will start out with a blank form and add things to it field by field. In contrast, the Apricot template library has a selection of pre-designed, generic form types that can be edited to suit your particular needs.Tier 1 and Tier 2 FormsTier 1 forms are primary or parent forms. They collect information that can be universally applicable and kept current for all your programs and services. A Tier 1 form might be an intake form or client cover sheet - a place to put data that is not expected to change over time.Tier 2 forms are secondary or child forms that live under a Tier 1 form. They capture data likely to be filled out multiple times for individuals or maintain historical data. A Tier 2 form might be an attendance record or maintenance request - a place to put data that shows a snapshot of a situation that might happen several times or change or need to be updated over time.When you first open Form Designer and see the list of forms, you will see a list of Tier 1 forms by default. To see any available Tier 2 forms, expand the black arrow next to the Tier 1 form name. Creating a Tier 2 FormTo create a Tier 2 Form, you must click the actions arrowhead on the Tier 1 Form. A drop-down menu will appear. You will have the choice to create a new Tier 2 Form from scratch or from an existing template.Creating a New Form from TemplateWhen you select \"Tier 1 From Template\" you will be taken to the Apricot Template Library.You will see a list of available form categories.Select the one you would like to use and expand the black arrow to see a list of available forms in that category.Expanding the gray arrow next to the form name shows a short description of what you will find in the form.Hover your mouse over the Actions tab next to the form you would like to use.Select \"Preview\" to see what the form looks like or select \"Use\" to open a copy of it that you can edit and publish.Previewing a TemplateIf you select \"Preview,\" a window will pop-up showing a blank copy of the form as it will look to your users. Once you have found the template you want to use, close the window and select \"Use\" from the actions tab.Publishing a Form from a TemplateOnce you have met all Form Requirements along the right-hand side of the template, the form will be ready to publish.Once you select publish, this form will be added to your list of available forms in your Apricot database and your users will have access to fill it out and begin collecting data.Creating a New Form from ScratchWhen you select \"Tier 1 From Scratch,\" you will be taken to a new, blank form.At the top is the title of your form.Dark blue bars indicate the different sections of your form.The Field Choices palette on the right hand side shows the different fields that can be added to your form.The Form Actions palette at the bottom shows the actions available when you are finished creating your form.Adding Fields to a Form\nFields must be added to a form before it can be published.To see available fields, look in the Field Choices palette on the right-hand side.Expand the black arrow next to a category to see specific fields. When you find a field you want, drag it into the body of the form.Adjusting and Editing FieldsBefore you can publish a form, it must meet the requirements list on the right-hand side palette. Tier 1 forms must include at least one field that is a \"Duplicate Check,\" one field that is \"Searchable,\" and one field that is both \"Quick View\" and \"Required.\"To edit or adjust the properties associated with a field, click the green gear box.Here you can rename your field.Adjust the Standard Properties to meet publishing requirements.When you are finished, click \"Apply.\"When you have completed the edits to your form, click \"Publish.\" This will make your form available for users to fill out.Form PropertiesAn additional Publish checklist requirement is to choose a record name under the Form Properties for either the Tier 1 or Tier 2 Form. You can find more information regarding the Record Name Field in this article. ","title":"Creating Forms","url":"https://apricot-articles.socialsolutions.com/en/articles/1817593-creating-forms"}