{"content":"The Document Folder is the area within Apricot that will hold the majority of a clients information, for example. Remember that Apricot stores data in a two tier structure (Tier 1 forms and Tier 2 forms). The Document Folder is what brings all of this information together. It allows you to access the Tier 1 record as well as Tier 2 records. The best metaphor for the Document Folder is the manila folder in a paper-tracking system. The manila folder has the paper taped to the top of it which contains the general client demographics (Tier 1 form) and the papers that track historical data that goes inside the manila folder (Tier 2 form). Below is a deep dive into Apricot's Document Folder:\nThis is the name of the document folder. It will always be in the following format: Name Of Form Document FolderThis displays the Record Name, and is configurable. Click here to find out more.The items found in this box are the Quick View Information from the Tier 1 form. These will be customized by the Administrator of your Apricot site. The items in bold are field names, for example \"Name text field\" is the field name found on the Tier 1 form. To the right of that we see \"Asher Billingslea\" which is the stored value of that field. We can see in bold another field titled \"Link\" which is a linking field. Linking fields can be Quick View items but they only display how many links they have, this example has 1 as seen by \"1 links\" in green. Since it is green we can click on it to open a pop up which will show us additional details and even let us navigate to the linked record.In the \"Additional Documents\" section is where we can see our list of Tier 2 forms. For example, \"Individualized Service\" is one of the Tier 2 forms. We can see in parenthesis it tells us how many records of this form are present within this client's document folder. To see some Quick View information from this 2 record click on the triangular icon next to the form name.Each row under the form name represents 1 record. In this example, this client only has 8 \"Individualized Service\" records. We can see that \"10/04/2018\" is a Quick View item stored in the \"Service Date\" field. If we click on any of the green text it will take us directly to the Tier 2 individualized service record.The Actions menu, when you hover over it, will allow you to create a new record for the selected form.If your client has many tier 2 records the Document Folder will only display 20 at a time, by default. This can be updated by changing the \"20\" in the dropdown menu to any of the other options available. You will also have a \"Previous\" or \"Next\" button in this area depending on what page you are on.The Folder Actions palette has multiple options to choose from: Edit Client Example: this is the button to Edit the current Tier 1 record. This button will always have the following naming convention: Edit Form Name.  Return to Search: this will return you to the Record Search for the associated Tier 1 form.  Print Records: this will allow you to print one or more records from one or more forms found within the current document folder. More information about Print Records from Document Folder can be found here.  Record History: if Record History - Audit is enabled in your Apricot you will be able to use the Record History search feature for the current document folder.Note: Your document folder view will look different from this example. You may have different duplicate check fields, quick view items, and form names. Please contact your Apricot Administrator for any clarification of your specific setup.In order to go directly to the Document folder in the record search, you must click on the row and not on the green letters.Clicking on the grey letters will take you to the Document folderClicking on the green letters will take you directly to the record. The letters turn green when a Search field is added.","title":"Document Folder","url":"https://apricot-articles.socialsolutions.com/en/articles/1817269-document-folder"}