{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.Your AVS database has been set up with login access for a number of users. A site Administrator can manage these users by adding new user accounts when needed or removing access from people who no longer work for your organization or who no longer need access to the database.Your AVS database has also been set up with different levels of access - some users have access to enter data into certain parts of the database while other users may only have access to see information that has already been entered. A site Administrator can also manage the access that has been granted to these groups of users and can move users from one group to another, in Apricot we call these groups \"Programs\".Each person who will access the database should have their own user account.To access information - like the login username - for an existing user, click the Administrator tab at the top of the page.In the left hand menu, select User/Program Profiles.This will take you to the Users Search page where you can see a list of all existing users. Expand the black arrow next to \"Add Search Field\" to add a field to help you search the existing users. It may be helpful to add \"Name\" or \"Username.\"Type identifying information into the search field. As you type, the database will return relevant results.Each row represents one user. Click the green text of their name to open their user account information.Under Username, you will see the email address used to login. It can be changed by selecting the change button.Under Password, you will an encrypted password. No one has access to a user's password. If a user is having trouble logging in, you can reset the password by selecting the change button.Under Name, you will see the user's name as it appears in the database when this account is used to create or modify records.User Type: Standard: A standard user can log in to the database and access parts of it for data entry. The AVS database has several levels of access for standard users. \nAdministrator: An Administrator user can access all parts of the database for data entry and may also access design elements to make changes to users, access levels, form design and report building. An Administrator's access cannot be limited or edited in any way.\nInactive: An inactive user can no longer access any part of the database. Their login and password have been disabled. Their information remains in the system, marked as inactive, so that other users can still view or investigate what records they created or changed, even after their access to the database has been removed.\n   5. Profile Image: You may upload a picture to Profile Image. It will appear in the upper right hand corner of every Apricot page, showing who is logged in.\n\n   6. Check this box if you would like to enforce that the user update their password the next time that they log in to Apricot\n\n   7. When changes have been made, select Save Record. Adding a New UserTo add a new user, click the Administrator tab.In the left hand menu, select User/Program Profiles.In the right hand menu, select New Users.Under Username, enter the email address this user will use to login. The username and password you enter on this page will be sent to this email address to inform the new user that their account has been set up.Under Password, enter a password. The user will use this password the first time they log in; after they have successfully logged in once, they will have the ability to change their password themselves to something else.Enter the user's name. This will appear on records the user creates or modifies.Select a user type. The system will tell you how many standard or administrator seats are available.When you are finished, select Save Record.In addition to an individual user account, an AVS user may also belong to a program. A program is a group of users who have their access to the database limited in some way - perhaps a group of case managers can only enter data into client records, or perhaps the volunteer manager can only access the Supporters form and shouldn't be able to see any of the information collected on any of the clients being served.The AVS database has been set up with standard programs with different levels of access:Basic: Users in the Basic program have access to most of the pre-built forms. They can see information that has been entered, they can search for and edit existing records, create new records. They do not have access to build or view reports, bulletins, or shared files.View Hotline Only: Users in the View Hotline Only program have access to only the Intake, Client Profile and Program Enrollment forms. They can see information that has been entered into these forms, they can search for and edit existing records of these forms, and create new records of these forms. They do not have access to build or view reports, bulletins, or shared files.View Only: Users in the View Only program have access to most of the forms in the database. They can see information that has been entered, they can search for records. But they cannot edit any records or create new records or change any of the data that has been entered. They do not have access to build or view reports, bulletins, or shared files.View Volunteer Only: Users in the View Volunteer Only program have access to only the Supporter, Training Log, and Activity forms. They can see information that has already been entered and they can search for records, but they cannot change any of the data that has been entered. They do not have access to build or view reports, bulletins, or shared files.Wizard: users in the Wizard program can access most of the forms in the database. They can see information that has been entered, search for records, create new records, edit existing records, and archive records. They do not have access to build or view reports, bulletins, or shared files.Note: The access granted to each of these programs can be adjusted. A site Administrator can change the access granted to an entire program or to a particular user. For more information, please see the Knowledge Base section on Limiting or Granting User Access To find which users have been assigned to each program, click the Administrator tab at the top of the page.In the left hand menu, select User/Program Profiles.In the right hand menu, select Program Profiles.Select one of the programs by clicking a row of data.Expand the gray arrow next to Permission Sets.Select the green text.Under the Assigned Users section, you will see a list of the usernames associated with the users who have been added to this program.To add a new user to this program, click Add. You will have the ability to search through all the active standard users and add more of them to this program.Scroll down on the same page from the list of usernames to the section on Permissions.Here you can expand or remove access for this program to different parts of the database.For more information on how to manage what a program can access, please see the Help Center section on Limiting or Granting User Access To find out which programs a user has been added to, click the Administrator tab at the top of the page.In the left hand menu, select User/Program Profiles.Select a user.Select Edit Users.Under the section Assigned Permission Sets, you will see a list of all the permission sets and therefore all the programs this user has been added to.If you would like to see what access is given to people in this program, select the green text for the permission set. It will take you to view the permission set and you will have the option to adjust the access to the entire program.If you would like to add these users to additional programs, select the Add button. You will have the option to select an additional permission set for this user. Users can belong to more than one program/permission set.","title":"Managing Users and Access in AVS","url":"https://apricot-articles.socialsolutions.com/en/articles/1817524-managing-users-and-access-in-avs"}