{"content":"When a new form is created, it is saved in an unpublished state. Unpublished forms are not available for users to access or fill out.This allows an Administrator to finish creating or editing a form before it can be accessed by users.The form above is unpublished. You can tell because the requirements under the Requirements palette have not been completed yet. A form cannot be published until these requirements have been met.When it has been edited and is ready to be published, select \"Publish Form\" in the Form Actions palette near the bottom right-hand corner of the Apricot window.Published Tier 1 forms are visible in the My Apricot tab and can be used for data entry, Tier 2 forms can be found from within the Tier 1's document folder.If changes are made to a form that has been previously published, it is labeled \"modified\" until you re-publish it.Any changes will remain unavailable to users until the form has been published.Any time you go into the Form Designer, open a form for editing, and open any of the properties windows that govern the form, the form will be labeled as \"modified,\" even if no changes have been made.\n\nPlease note that it is possible for two users to make unseen modifications to the same form. When this happens, the changes of one user will be overwritten when the other user publishes their updates. If you have made changes to a form and want to revert it back to its previously published version, select \"Previous Version\" from the Form Actions palette.Select \"Confirm.\" Your changes will be deleted and the form will return to what it looked like the last time it was published. Even if changes have been saved, they will be wiped out if they were not published.If you would like to remove access to a form so that it can no longer be used for data entry at all, you can deactivate it. The form and the data that has been collected will not be deleted from your Apricot, but they will no longer be available to users or to be pulled into reports. If you need to pull the records for reports, there is an option in the form properties to 'Hide from navigation menu' or 'Hide from document folder' that can be used instead. Select \"Deactivate Form.\"Select \"Confirm.\"To see what forms you have, no matter what state they are in, go to the Form Designer. You can filter what kinds of forms you can see: All, Published, Modified, Unpublished, Inactive - by selecting from the Form List Filters palette on the right hand side.Published forms are labeled with a green up arrow icon.Modified forms are labeled with a yellow pencil icon.Unpublished forms are labeled with a red down arrow icon.To show inactive forms, select \"Show/Hide Inactive Forms\" in the right hand palette.Inactive forms are labeled with a gray \"zzz\" icon.","title":"Form States","url":"https://apricot-articles.socialsolutions.com/en/articles/1817527-form-states"}