{"content":"Without using a Lookup List, these types of fields require that an Administrator type up each list of options as needed for each individual field. If the options \"yes,\" \"no,\" \"maybe\" were needed in ten individual radio button fields, the Administrator would have to type out the same list ten separate times.However, with Lookup Lists, these option lists can be typed out once and saved in a central location. They can be applied into fields as many times as needed without retyping.Lookup List can save you time whenYou have a list that will be used on multiple fieldsYou have a list that will be used on multiple formsYou have a list that needs to be the same in multiple locations but it may also need to be changed at some point (all at the same time)To access Lookup Lists, click on the Administrator tab.In the left hand menu, select Lookup Lists.Expand the black arrow next to the category name to see the names of lists that have already been created.Select Create New Lookup.Select Simple or Masked. A simple lookup list will allow you to create one display value for each option in the list. A masked lookup list will allow you to create one display value and one masked (hidden numeric only) value for each option in the list.Select a category.Name your list.Create.Type in the display values you would like to have available for your option fields.You can move from line to line by hitting the tab or enter keys after you finish entering each option. There will always be one empty row at the bottom; empty rows will not be displayed when this list is added to a form.If you would like to add more than one empty row to your list, to facilitate entering more options, select Add Rows at the top of the section.You can choose to add the rows to the bottom or the top of your existing list.Type in the number of rows you would like to add.Select Add Rows.Empty rows will not be displayed when this list is added to a form.To open a text box where you can paste in bulk options, click Enable Bulk Entry.Paste any amount of text into this text box to create options in bulk. In a simple (not masked) lookup list, each line of text will be its own option.Drag this corner to increase the size of the text box, if necessary, to see more text at once.Select Save Lookup List and anything entered into the text box will replace the options in the rows listed below the green Display Value bar.To re-order a list, click the gray arrows. Options will be put into alphabetical order or (click the gray arrows twice) reverse alphabetical order.To manually change the order of options, click on the gray box to the right of the option you wish to move and drag it into the desired location.When you are finished making adjustments to a list, select Save Lookup List.To edit an existing look up list, select the Administrator tab.In the left hand menu, select Lookup Lists.To the right of the list you would like to edit, hover your mouse over the Actions tab.Select Edit.A list can be edited by:Adding rows by clicking the Add Rows button and entering additional options.Click the Enable Bulk Entry button and paste in new options.Clicking on the gray box to the right of an option and moving it to a new location within the list.Selecting the text of an option and deleting or editing the text.When you are finished making edits, select Save Lookup List.Note: If you are making changes to a lookup list that has already been added to a field in a form, the options available in that field will be immediately updated to reflect your edits. However, records that were created with the old options will retain the old options as they were saved in that record, but new records and new edits to old records will only have the current lookup list options available.You can also create a lookup list with masked values (suitable for use with masked radio button and masked dropdown fields, for example). This will allow you to create a list that has both displayed and hidden (numeric) values for each option. Select Create New Lookup.Select Masked.Select Category.Name your list.Select Create.As when you create a simple (not masked) lookup list, you can type your values into the rows provided.But in addition, you are required to provide a hidden or back-end value for each option. (These back-end values must be numeric and unique in each list. You cannot create a lookup list, or any masked option field, that has duplicate back-end numerical values)Clicking Add Rows allows you to add additional rows to the top or bottom of the list.Clicking Enable Bulk Entry allows you to paste in values in bulk.When entering masked values in bulk, you will need to separate the display value from the backend value with a \"pipe.\" A pipe is a character on your keyboard, usually between the Backspace key and the Enter Key. When you type it, it looks like this: |When you select Save Lookup List, the options entered in the text box will replace any rows below the green \"Display Value\" bar.To add a lookup list to an option field in a form, open a form for editing and add a new option field.Open the field gear box to access properties.To use a lookup list you already created, select \"Use Lookup List.\"After you have selected Use Lookup List, a dropdown menu will appear. Expand the black arrow.Select the lookup list you would like to add to your field.Select Apply.After you select apply, the lookup list options will appear in the field.If you open the green gear box again,You have the option to Edit Lookup List. Click this button will open a new tab and take you to the Lookup List page where you can edit the list and save changes.Note: Changes made to a lookup list will go into effect immediately and will be reflected in any field that uses the edited lookup list.In the above example, we see a traditional radio button with a list of options that was typed in manually before the lookup list feature was available.To change this list to a lookup list, select Use Lookup List and you will be able to use a lookup list that has already been created and saved.To convert these options into a new lookup list, select Bulk Entry. Select the options, copy them, create a new lookup list via the Lookup Lists tab in the left hand Administrator menu and paste in the options.","title":"Lookup List","url":"https://apricot-articles.socialsolutions.com/en/articles/1817529-lookup-list"}