{"content":"Fields govern how data is collected and reported on in Apricot. A diverse selection of fields is available in Form Designer, some tailored to correctly collect very specific kinds of data. Here we will go over text fields such as text, append only, and multi-line.Open the form you want to edit in Form Designer.In the Field Choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your form. This field can be used for any short amount of text. If your organization has its own way of calculating client IDs that have a combination of letters and numbers, a text field can be a good way to collect that information. The maximum number of characters (letters, numbers, or punctuation) allowed in this field is 200. This field may also be used for a signature line because the box provided is large enough to sign on a printed record.Special properties are allowed for this field, including setting the field width (in pixels) or a smaller character limit than what is automatically allowed. A default value may be set, or you can add a hint. Like a default value, a hint will appear in the text box when users fill out a record, but unlike a default value, it will not save any data unless something is typed in.This field can be made Required, Searchable, Hidden, and Locked. It can be used in Quick View and as Duplicate Check. Like a text field, a multi-line field allows for collection of text. This field displays as a larger textbox on the field and collect more characters and words than a regular text field. Examples for using this field would include comments, notes, descriptions, and summaries. This field may also be used for a signature line because the box provided is large enough to sign on a printed record. The number of characters allowed in this field is over 5,000.Special properties are allowed for this field, including setting the field width (in pixels) or a smaller word or character limit than what is automatically allowed. A hint may be set for this field; it will show the text of your hint in the text box when users fill out a record, but will not save any data unless something is typed in.This field can be made Required, Searchable, Hidden, and Locked. It can be used in Quick View. Much like a text field, the append only field allows for text to be collected on a record, but in this case the notes are saved as-is when the record is saved and cannot be edited. Note: The append only field notes cannot be reverted if a note is added via import or removed by restoring a record to an earlier version. Notes in this field cannot be deleted or changed. Special properties are allowed for this field, including setting the field width (in pixels) or a smaller word or character limit than what is automatically allowed. A hint may be set for this field; it will show the text of your hint in the text box when users fill out a record but will not save any data unless something is typed in.\n\nInformation from this field will not be copied when a record is copied; this field will be blank in a copied record.This field can be made Required, Searchable, Hidden, and Locked. It can be used in Quick View.\nThis is what an append only field looks like for your users.1. This section holds any old notes that have been previously entered. They cannot be edited. The date, time, and user who created each note were recorded when the record was saved.2. This section is where a user can add a new note. This can be edited until the record is saved, at which point anything entered in this area will be saved and will no longer be available for editing.\n","title":"Text Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/1817248-text-fields"}