{"content":"*: A data entry field marked with an asterisk (*) indicates that the field is required and must be filled out before the record can be\nsaved.?: Seeing a \"?\" next to a field name on a record indicates that an Administrator has added a \"tooltip\" to the field to provide extra information about what a user is expected to enter.Add Search Field: On any Apricot record search page, a user can add a search field to narrow down the visible results. Program Access: An Apricot Administrator has the ability to restrict which records can be accessed within the database by different users.\nAdministrator (Tab): The tabs across the top of your Apricot allow you to access different parts of the software, from data entry for users to design\nelements for Administrators.\nAdministrator (User): An Administrator has access to the entire Apricot database - to all of the records and to all of the features on the left hand menu\nunder the Administrator tab. An Administrator's access cannot be changed or limited via programs or permission sets.\nDuplicate Check Icon: The duplicate check icon that appears on a form or record indicates a field that has been marked as \"Duplicate Check.\"Batch Record Tool: The Batch Record Tool in Apricot is designed to allow users to create Tier 2 Records for more than one Tier 1 Record at one\ntime.\n\"Browse All\" on Record Search: When searching for records, users have the options to add a search field or to browse all records in the system. If search fields have been added, clicking \"Browse All\" will remove them.\nBulletins (Definition): Bulletins serve as announcements and can be added to the main Apricot dashboard or the \"My Apricot\" home page.\nCalculation Fields: Calculation fields can be added to any form in order to add, subtract, multiply, or divide numeric values within the same form.\nChat: Users can chat with Apricot Technical Support Mon-Fri 7am-7pm Central Time via the chat bubble icon in the bottom-right corner of any Apricot window.\nCheckbox Field: A field for collecting data that can be added to a form. A checkbox allows an Administrator to set more than one option or choice, and it allows a user to select one or more options each time they fill out a record.\nClear Search History: When searching for records, a user has the option of adding one or several search fields to narrow down the search results. By clicking the \"Clear Search History\" button, these search fields will be reset and hidden, resetting the search results to show all records. \nClear on Copy: \"Clear on Copy\" is a special field property that can be set in Form Designer.\nConnected Form (Reports): \"Connected Form\" is the term used for a form that has been pulled into a Report after the Root Form has been\nestablished.Copy a Record: Any kind of record can be copied in Apricot. When Tier 2 records are copied, the new copies will exist under the same Tier 1\nrecord as the original.\nCreate Record (form access, form permissions): When you give a user the access to \"create records,\" the user will be to see or view previously created records and\ncreate new records of a particular form.\nCSV File: CSV stands for \"comma separated value.\" This is a type of spreadsheet that can be read by many programs, including Microsoft Excel.\nDashboard: The main landing page in Apricot. The dashboard provides access to all tabs, user information, all Tier 1 forms and records, and My Apricot Tools.\nData Styles (Reports): Data Styles adjust the way data appears in a report.\nDatabase: Apricot is a database, meaning that is it a place to collect data with forms and a place to extract data with reports.\nDefault Value: Default Value is a special property that can be set for some of the fields in Form Designer.\nDisplay Styles: When building reports, you can specify a display style: hidden, graph only, totals, rows, or vertical.\nDocument Folder: When searching for information, you can find all the Tier 2 records associated with each Tier 1 record in a document folder.\nData Archives: Data that has been collected in Apricot can be downloaded/exported from the database into Excel by using this tool as an Administrator.\nDropdown: A field that can be added to a form. Users can select one option.\nDuplicate Check: Duplicate check is a field property that can be added to most fields after they have been added to a Tier 1 form.\nEdit (Form Design): Apricot forms can be edited by an Administrator at any time.\nEdit (Report Builder): Apricot reports can be edited by Administrators to modify data, structure, and formatting.\nEdit Record (Form Access, Form Permissions): When you give a user the access to \"edit records,\" the user will be to see and edit previously created records.\nFavorites Details: When a favorites list has been selected on a record search page, a \"Favorites Details\" pane becomes available below the \"Favorites \nField: Field is the name given to items on a form that can be filled out by users.\nField Choices Palette: In Form Designer, the Field Choices Palette holds all the available types of fields that can be added to a form.\nField Label: The field label records what type of field it is, like a name field or a zip code field, for example.\nField Properties: Optional properties can be set for each field on a form.\nField Type: Fields govern how data is collected and reported on in Apricot.\nField Width: Field Width is a property available for standard text fields that have been added to a form. Field Width determines how much horizontal space the field will take up on a form, measured in pixels.\nFilter Logic (Reporting): When more than one filter has been added to a report section, you will have the option to modify how and when those filters are run.\nFilters (Reports): Filters can be used to narrow or focus your results, personalize your reports, and clarify findings.\nForgot Password: If you have forgotten your password, you can have a new one emailed to you at the same email address as your username.\nForm: Forms collect data in your Apricot database. \nGear Box: Access advanced features of the Form Designer or the Report Builder with a green gear in the upper right hand corner of a Field, Form Section, Report Column, or Report Section.Global Values (Reports): A Global Value is a filter that can be applied to the entire page of a report.\nGoals (Reports): The reporting Outcomes tool can be used to track goals via quantifiable values.\nGuest User: A Guest User has access to a very small part of the Apricot database and only for data entry - usually access only to records they have created themselves in the system.\nImports Tool: The Apricot Imports Tool is a premium feature that allows data from an Excel spreadsheet in .csv format to be inserted into the database. This adds the ability to create and/or edit records in mass.\nInactive User: An Inactive user can no longer access the Apricot database themselves, although their record history and modifications will remain in the database for reference.\nLanding Page: Also called the \"dashboard,\" the landing page is what a user sees after logging in to Apricot.\nLikert Scale: This field allows for collection of Likert items and other ranged responses with defined front-end (visible to users) and back-end (hidden from users) values. \nLinking Field: When added to a form in the Form Designer, a link field allows a user to create a connection between two records that would be otherwise unrelated in the database. \nLinking (Definition): Linking is a way to connect two forms, two records, or two data points in Apricot that would otherwise not be connected\nLocked Fields: Locked Fields are \"read only\" fields. They can be viewed by the user, but they cannot be changed. \nMulti-Select Field: An option field that allows for multiple choices to be selected in the same record, such as a checkbox field or a multi-select dropdown.\nMy Apricot: The My Apricot tab allows access to the data entry side of Apricot.\nNext 20: Selecting \"Next 20\" at the bottom of a record search page will display the next twenty records of a particular form in the database.\nOutcomes: Outcomes can be shown on a report by using the Outcomes feature in the Report Builder.\nPercent Symbol: When a % symbol is typed into a search field or a report filter, it acts as a wildcard value\nPrint Mode: Records and reports that have been created in Apricot can be printed by accessing the Print Mode button on the right hand menu.\nProperties: Clicking the green gear box on fields or form sections, on report columns or report sections allows an Administrator to access design properties that can change the way information in collected or displayed.\nPublished Form: Users can access any published form for data entry purposes.\nQueries: Queries are used by dynamic fields (such as dynamic dropdown, dynamic checkbox, dynamic number and dynamic text) to pull specific information from one record to another. Queries are written in SQL code.\nRead-Only: To make a field on a form or record read-only, that field needs to be \"locked.\"\nRecord: A copy of a form that contains data entered by a user.\nRecord Save Checklist: Before a record can be saved, the data entered into it must meet requirements as set up by an Administrator.\nRecord Search: Selecting a form from the left hand menu under the My Apricot tab opens a record search page. \nReport: A way to view or extract specific kinds of data that has been entered into the Apricot database. \nReport Center: The section of the Administrator tab devoted to data archives and building and editing reports.\nReport Properties (Definition): Properties can be adjusted in reports at three distinct levels - properties that apply to the entire report, properties that apply to one section in a report, and properties that apply to one column in a report.\nRevert Report: Removes any changes that have been made to a report since the last time it was published. \nRoot Form: The root form of a report is the first form added to a section of a report. When using best practices, this should typically be a Tier 1 form.\nRule (Report Filters): A report filter rule has three parts, which are indicated by three separate drop down menus: the column, the determining factor like \"is greater than,\" and the value. \nSection Properties in Forms: Form section properties govern the display style and the tab order for each section of a form. \nSection Properties in Records (Definition): Report section properties govern the display style, the count, graphing, and outcomes for each section of a report.\nSort Results: Results provided through a record search page or a report can be sorted by clicking the gray arrows at the top of any column of data. \nStandard User: A Standard user has access to the data entry side of the Apricot database, mainly access to view, create or edit records. Standard users are limited to only the forms, records, and reports to which their programs have been assigned.\nTabs: Tabs are located at the top of any Apricot page and provide access to different parts of the database.\nTier 1 Form: Tier 1 forms are \"first level\" or \"parent\" forms that are often used to collect information on individual clients or participants. \nTier 2 Form: Tier 2 forms are \"second level\" or \"child\" forms that are often used to collect information on services or programs that each client might access. \nUnrestrict or Gain Access to a Restricted Field or Report: Restricted fields have features that can only be adjusted or edited by Social Solutions employees, not an Apricot Administrator or user.\nView (Form Access Form/Permissions): When \"View\" access has been granted to a user for a particular record or form, the user can view existing records and see the data that has been entered into them. Without this permission, records may not be visible to a user when they attempt to navigate to them.\nView Folder: Available in the Record Options palette when a user is filling out a record. Clicking \"View Folder\" will take the user to the Document Folder that contains the Tier 2 records housed within the Tier 1 record they are currently viewing.","title":"Apricot Glossary","url":"https://apricot-articles.socialsolutions.com/en/articles/1817639-apricot-glossary"}