{"content":"Open the form you want to edit in Form Designer.In the field choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your formThis field is used for data entry where more than one option can be chosen. A checkbox can be checked or unchecked as needed.To add options to this field, in Field Properties, click the \"+\" on the right side of the Field Choices area. Click the \"+\" sign once for each option you would like to add,Or select \"Use Lookup List\" to access any lists you have created using the Lookup List tool.Fill out the text for the options. (Character Limit is 255)If you select \"Allow Other,\" \"other\" will be an option. Users filling out records will have the option to add their own text if they check \"other.\"A default value can be added for the \"other\" option.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View.\n\nNote: Reporting on a multi-select field, like a checkbox field, will render different grouping results than a regular single-select field would do and this is extremely important to consider before using a checkbox field. For more details and information please visit our Reporting on Checkbox Fields article.DropdownThis field is used for data entry where only one option can be chosen. Dropdown fields hide the available options and can provide a clean look to the form design.To add options to this field, in Field Properties, click the \"+\" on the right side of the Field Choices area. Click the \"+\" sign once for each option you would like to add,Or select \"Use Lookup List\" to access any lists you have created using the Lookup List tool.Fill out the text for the options. (Character Limit is 255)If you select \"Allow Other,\" \"other\" will be an option. Users filling out records will have the option to add their own text if they check \"other.\"A default value can be added for the \"other\" option.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View.This field allows the user to select multiple options from a list by holding down the control key while clicking each selection.To add options to this field, in Field Properties, click the \"+\" on the right side of the Field Choices area. Click the \"+\" sign once for each option you would like to add,Or select \"Use Lookup List\" to access any lists you have created using the Lookup List tool.Fill out the text for the options. (Character Limit is 255)If you select \"Allow Other,\" \"other\" will be an option. Users filling out records will have the option to add their own text if they check \"other.\"A default value can be added for the \"other\" option.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View.Note: Reporting on a multi-select field, like a multi-select dropdown field, will render different grouping results than a regular single-select field would do and this is extremely important to consider before using a checkbox field. For more details and information please visit our Reporting on Checkbox Fields article.This field type is used when all options need to be displayed on the form, but only one selection can be made.To add options to this field, in Field Properties, click the \"+\" on the right side of the Field Choices area. Click the \"+\" sign once for each option you would like to add,Or select \"Use Lookup List\" to access any lists you have created using the Lookup List tool.Fill out the text for the options. (Character Limit is 255)If you select \"Allow Other,\" \"other\" will be an option. Users filling out records will have the option to add their own text if they check \"other.\"A default value can be added for the \"other\" option.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View.Notes:To clear out a radio button field after a value has been saved, you will need to import a blank value onto the radio button field.This field allows for collection of Likert items and other ranged responses with defined front-end (visible to users) and back-end (hidden from users) values. For users entering data, it functions like a radio button, in that only one option in the range of responses can be selected. Each option is associated with a numeric back-end value that can be calculated with other Likert items to present a scored scale. The field can be used for non-Likert ranged response applications as well.To add options to this field, in Field Properties, click the \"+\" on the right side of the Field Choices area. Click the \"+\" sign once for each option you would like to add,Or select \"Use Lookup List\" to access any lists you have created using the Lookup List tool.Fill out the text for the front-end options. (Character Limit is 250)Fill out the numeric values for the back-end options. The back-end values for each field must be unique and cannot be used more than one time in each field. For example, you cannot have all the back-end values for a particular field be \"1\".A default value can be added. A default value will be selected until a user changes it.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View.Similar to the Likert Scale field, different only in the way it is displayed on the form, this field allows for collection of a single selected value, displayed through a drop down menu, with defined front-end (visible to users) and back-end (hidden from users) values. It functions like a dropdown field, in that only a single option in the range of responses can be selected. The selected option is then associated with a numeric back-end value that can be used in calculations with other numeric values collected on the form.First, select the display style, Numeric or Mixed. See below for more information on these choices.To add options to this field, in Field Properties, click the \"+\" on the right side of the Field Choices area. Click the \"+\" sign once for each option you would like to add,Or select \"Use Lookup List\" to access any lists you have created using the Lookup List tool.Fill out the text for the front-end options. (Character Limit is 250)Fill out the numeric values for the back-end options. The back-end values for each field must be numeric (1 or 2 instead of I or II). They must also be unique and cannot be used more than one time in each field. For example, you cannot have all the back-end values for a particular field be \"1\".If you select \"Allow Other,\" \"other\" will be an option. Users filling out records will have the option to add their own text if they check \"other.\"A default value can be added for the \"other\" option.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View.You have two choices for backend values in a masked value field - Mixed (numbers, letters, special characters or a mixture of any of the three) or Numeric (numbers only).Mixed: These can include numbers, letters, or special characters. When reporting on these backend values, you will not be able to do calculations.Numeric: These can include only numbers. When reporting on these backend values, you will be able to do calculations with the results.Select the Display Style first. This setting will become locked when you begin to add options to the field.Click the plus sign to add new options. (Character Limit is 250)Or select \"Bulk Entry\" to paste in results from another source.If you have made a mistake in your selection of the display style, delete this field and start over with a new masked value field.You have two choices for backend values in a masked value field - Mixed (numbers, letters, special characters or a mixture of any of the three) or Numeric (numbers only).Mixed: These can include numbers, letters, or special characters. When reporting on these backend values, you will not be able to do calculations.Numeric: These can include only numbers. When reporting on these backend values, you will be able to do calculations with the results.Select the Display Style first. This setting will become locked when you begin to add options to the field.Click the plus sign to add new options. (Character Limit is 250)Or select \"Bulk Entry\" to paste in results from another source.If you have made a mistake in your selection of the display style, delete this field and start over with a new masked value field.The Milestones/Goals Field is used to collect incremental data relating to an indicator or performance measurement of your program.This field allows for a maximum of 10 Milestones or Goals to be defined, but not all must be used. Any option that does not have text entered will not appear when users are creating a record.To use this field, enter the milestones or goals pertaining to the corresponding number (Character Limit is 250). Brown or 1 will be the initial goal and tan or 10 will be the target goal.A default value can be selected.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View.Once you choose a Display Style (Numeric or Mixed) and publish the form you cannot change this.Backend Values can never be the same in the same field. For example, you can only have one \"1\" and no more.You can change the Display values and the record will automatically display this new value because Apricot only stores the backend.You cannot change the Backend value without updating the records manually (or via the Import Tool if you have it).If you change the backend value and do not update records already in the system you will get the \"Other\" box and the record will still hold the original value.When reporting on a Masked field, you can choose the Data Style to show either the Display Value or the Stored Value in the report.","title":"Option Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/1817628-option-fields"}