{"content":"Adding a GraphOne graph can be added to any report section.1. To add a graph to a report section, open the section gear box.2. Under \"show graph,\" select yes.3. Click Apply.To learn more about building a report, click here.1. To download a graph image, select the download icon to the right of the properties gear box within the graph itself.2. Select the type of image file you would like to download. The image will be downloaded to your computer according to your internet browser protocols.PNG image: a compressed file image with better resolution than a JPEG, but that takes up more disk space than a JPEG.JPEG image: a compressed file image with good resolution.PDF document: file format that can be opened and viewed with Adobe Reader, which can be downloaded for free here: Adobe PDF.SVG vector image: an image file that can be opened and read by internet browsers using XML. The new graph will appear above the report columns.1. When you first turn on a graph for your report section, the report builder will automatically select a graph type. To adjust the type of graph, open the graph gear box.2. Rename your graph, if applicable.3. Green text will describe any graph properties that are not available or applicable for the graph type you have chosen.4. Select a graph type from the list.5. Select the Data Source. In most cases, you will want to chose \"group counts.\"The Graph can reference three types of Data Sources; Group Counts, Summaries, and Rows.Using the data source 'Group counts' will simply graph the number of rows for each column that is grouped in your report. All you will need to create this type of graph is at least one column that is being grouped. Please see the below example:\nNotice that the column \"Name of Reviewer\" also indicates that we are grouped by that column, which you can accomplish by opening the column properties and clicking \"Yes\" under \"Group By\". On the right hand side you will see the row count per group, and you'll notice that this row count is represented in the pie graph above.\n\nTo graph a summary, you will first need to enable a summary for a particular column. In this case we will graph the \"Average Time to Complete (in Minutes)\". We will open the column properties for our \"Time to Complete (in Minutes)\" data and then select \"Average\" under \"Summary\". See below:\nNow that we have a summary, we can reference this in our graph.\nClick the gear icon to open the Graph propertiesClick \"Summaries\" under \"Data Source\"Click the small \"+\" icon toward the right side of the properties windowIn our case, click \"Average Time to Complete (in Minutes)\". In your report you will see the type of summary followed by the name of your column appear in this dropdown Apply. Please note that the summary will be specific to any groupings applied to your report section. For exampleNotice that our pie graph is now showing the \"Average Time to Complete\" data grouped by the \"Name of Reviewer\" data. This is possible by using the 'Summary' Data Source, and many graphs are possible with this configuration that are not possible using 'Group Counts' alone.The Data Source 'Rows' is used to graph a numeric value against any other associated value. This data source will show you the data from the left most column and graph a chosen numeric value. For example, let's say we want to see the number of minutes spent to complete each and every article in our report.\n\nClick the green gear icon to open the graph propertiesUnder 'Data Source', click 'Rows'Click the small plus icon toward the right side of the properties windowSelect a column. All numeric columns within your report section will appear in this dropdownApply. The graph will also display the data from the column that is pulled all the way to the left most position in your report section's column order. For example:Pie and doughnut graphs work best with data that has been grouped on one column.Clicking on or dragging the edge of a pie or doughnut graph will rotate it. Line Graph1. Clicking the double arrow circle icon in the lower left hand corner will flip which data in shown on the Y-axis. Area GraphAn area graph is similar to a line graph, but the area underneath the line will be shaded in. BarBar graphs work best with data that has been grouped on one or two columns. ColumnColumn graphs can be shown as separate columns or as stacked (see Stacked section below). Bubble GraphA bubble graph requires a minimum of three data points. Location MapONLY ADDRESS LOOKUP FIELDS CAN BE USED FOR THIS. There will not be a geolocation sub field for non lookup fields. Location Map and Heat Map are used with data collected in the geolocation field inside an address look up field. To create a location map or a heat map, add the geolocation coordinates to your report and turn grouping on for the geolocation column. The geolocation field will need to be the pulled all the way to the left. It must be the first column in the report. Please note that you can only map up to 50 geolocations per graph. 1. Select the + sign to the right of Properties to add2. A center point will need to be established. This should be the longitude and latitude coordinates of the closest major city or your city. For example Los Angeles is listed as 34.0522° N, 118.2437° W. This should be typed in as 34.0522, -118.2437. The default zoom setting will establish how close you want to zoom to be to your Center Point when running the report. You will be able to zoom in or out when on you are looking at the map. 3. Select Data Source = Rows *Please note that unlike the other graph types, maps cannot be exported from Apricot. Maps can only be captured taking screenshots. Heat MapONLY ADDRESS LOOKUP FIELDS CAN BE USED FOR THIS. There will not be a geolocation sub field for non lookup fields. Location Map and Heat Map are used with data collected in the geolocation field inside an address look up field. To create a location map or a heat map, add the geolocation coordinates to your report and turn grouping on for the geolocation column. The geolocation field will need to be the pulled all the way to the left. It must be the first column in the report.\n1. Select the + sign to the right of Properties to add2. A center point will need to be established. This should be the longitude and latitude coordinates of the closest major city or your city. For example Los Angeles is listed as 34.0522° N, 118.2437° W. This should be typed in as 34.0522, -118.2437. The default zoom setting will establish how close you want to zoom to be to your Center Point when running the report. You will be able to zoom in or out when on you are looking at the map. 3. Select Data Source = Rows *Please note that unlike the other graph types, maps cannot be exported from Apricot. Maps can only be captured taking screenshots.\n 1. To add a target line to your graph, open the graph properties.2. To the right of Target lines, click the + sign. More than one targetline can be added to each graph.3. Label your target line and set a value. The value will determine where the target line will appear on the graph.4. Clicking the black bar will allow you to choose a custom color. Available colors depend on which internet browser you use.5. To remove a target line, select the X. 1. To change your graph to stacked, open the graph gear box. Only some of the graph types will allow you to select \"stacked\" as an option.2. Under Stacked, select Yes.3. Apply. 1. To see which additional graph properties are available, open the graph gear box.2. Click the plus sign to the right of Properties to add a new property. 3. Expand the black arrow under Properties.4. Select the additional property you would like to add to your graph.5. If applicable, add a value in the Custom Value text box.If you would like to add more than one additional property to the same graph, select the + sign and repeat steps 3 and 4.6. Apply. HeightThe height property allows you to establish the height of the graph in pixels. Rounded CornersUsing the rounded corners property changes the graph display to show rounded corners on the bars. Hide ValuesUsing the hide values property removes the labeling of values on the graph. Vertical ValuesUsing the vertical values property changes the orientation of the values on the graph. Embed Values in ColumnUsing the embed values property puts the values inside the bars or columns of the graph. Hide Tool TipsUsing the hide tool tips property stops the group summary tool tips from appearing when the cursor hovers over groups in a graph. Show Percent SignUsing the show percent sign property add a percent sign to the values on the graph. It is important to use this tool only for data styles that are actually percentages. SymbolUsing the symbol property will add a symbol of your choice to the values on the graph. Decimal PlacesUsing the decimal places property will show as many decimal places as you enter (in increments of 1) in the property value text box and as are present in the data. Abbreviate NumbersUsing the abbreviate numbers property will truncate long number values on the graph. Connect Empty DataUsing the connect empty data property will connect empty values present in the graph. Label Format: WrappedUsing the label format: wrapped property will take column names and divide them onto new lines if they are too long for the graph. Label Format: VerticalUsing the label format: vertical property will change the orientation of graph labels. Label Format: StaggeredUsing the label format: staggered property will stagger the graph labels. Legend: Position BottomUsing the property for legend position: bottom will add a legend to the bottom of the graph. Legend Position: RightUsing the property for legend position: bottom will add a legend to the right of the graph. Legend CaptionUsing the legend caption property allows you to enter an additional caption in the graph legend. Show LogoIf you have uploaded a logo to your database through the Apricot Settings menu, you can add this logo to a graph.1. To access the graph properties, click the graph gear box.2. Click the + sign to the right of Properties and add the properties related to logo. You will need to click the + sign four times and add a different property in each drop down menu.Show Logo: adds a logo to the graph.Logo Size: allows you to re-size the logo on a scale of 1 - 100. Logo Position: allows you to re position the logo.Logo Opacity: allows you to adjust how opaque the logo is on a scale of 1 - 100. X Axis LabelUsing the x axis label property allows you to label the x axis of your graph. Y Axis LabelUsing the y axis label property allows you to add a label to the y axis of your graph. Rotate Y Axis LabelAfter turning on the y axis label property, adding the rotate y axis label allows you to change the orientation of the y axis label. Y Axis MaxUsing the Y Axis Max property allows you to set the height of the y axis of the graph.Note: A Y Axis of 3 or less will include decimals (ex: 1.5).  To only have whole numbers, set the Y Axis Max to 4 or greater. Enable Y Axis ScalingUsing the enable y axis scaling property allows the graph to scale the results to the most useful range on the graph. Bubble ScaleUsing the bubble scale property allows you to change the size of the bubbles on a bubble graph. The default setting is 1; larger numbers will create larger bubbles and decimals will create smaller bubbles. Default Zoom Level and Center PointDefault Zoom Level and Center Point can be used with location maps and heat maps. Used together, they can ensure that the map will automatically load at a location and zoom level that will make sense to your audience. Using a location map or a heat map without setting the default zoom level or the center point will show the a map of the entire earth, centered on the intersection of the equator and the prime meridian. MilestonesUsing the milestones property assigns nine graph colors to different answers used in the milestones fields. SubtitleThe subtitle property adds a second line of text under the title of your graph. CustomThe Apricot graphing function is an integration with a third party software called FusionCharts. Custom Properties for graphs can be configured by adding additional properties from the FusionCharts Properties document, which can be found here.Most of the custom properties available in FusionCharts have already been added to the graphing tool and are outlined on this page. Graphs colors can be managed by selecting a color theme. Colors are applied to the graph from the palette available in each theme - but in most cases, you cannot decide which color appears on which part of the graph.1. Select a theme by expanding the black arrow in the drop down menu under Themes.The example above shows the standard color palette. Carbon1. The carbon theme is a collection of gray colors.2. Select the x next to a color to remove it from the palette. FintThe fint theme is a collection of bright colors. OceanThe ocean theme is a collection of greens and blues. Custom1. To create a custom color theme, open the graph gear box.2. Select a theme and delete the colors you would like to replace. OR select \"custom\" and select all the colors to be used in the graph.3. Select \"Add Color.\" Once you add colors, your theme will automatically be a \"custom\" theme.4. The color palette will have options based on the Internet browser you are using. Select a new color by using the scroll bar and then clicking into the color field.5. You can also manually enter a color using the R G B number fields.6. The new color will now appear in the available colors. A maximum of 12 colors can be added.7. Select OK. The fonts, text size and text color in a graph can also be adjusted and customized.1. To access text options, open the graph gear box.2. Under \"Font Formatting,\" expand the black arrows next to the font type to change the font within the graph.3. To change the text color, click the color bar until the color palette appears.4. Select the new text color.5. You can also manually enter a color using the R G B number fields.6. Click Apply.","title":"Graphs","url":"https://apricot-articles.socialsolutions.com/en/articles/1817576-graphs"}