{"content":"Apricot users are staff, volunteers and/or community members who can access the Apricot database to enter data into records. Standard users have their own login information and have access to one or more parts of the database for data entry; they can usually access one or more forms, reports, shared files, and dashboard/bulletin announcements.In addition to managing these Standard users, Apricot also has the ability to manage \"guest users\" - people who may not be on staff, who may be members of the community or volunteers, who need much more limited access. Guest users can still maintain their own login information, but generally only have access to a few forms for data entry.Guest User Access is a feature that allows non-staff or community members to become Apricot users with extremely limited access.The instructions below outline how to create a Tier 1 form for guests to fill out, how to grant limited access to it, how to make it into a Secure Web Form, how to create an accompanying Tier 2 form for data collection, and how to catalog these forms as \"guest user\" forms within your Apricot database.Please Note: This article is specific to configuring the ability for guests to create their own user accounts with a secure web form, but it is also possible to create guest user accounts manually through the normal process outlined in our article Managing Users and Access.\n To find out if you have access to the Guest User Access feature, select the Administrator tab.Select Apricot Settings from the left hand menu.Under \"A La Carte Features,\" check to see that Guest User Access has been enabled. If you need access to this feature and it has not been turned on, please contact the Customer Care team.Once Guest User Access has been enabled, a new section will appear in Apricot Settings under \"User Licenses.\"Guest users can only access up to 5 forms.To allow guest users access to a form, expand the dropdown menu and select the name of a form. These menus will show all forms that have been published in your Apricot database. If a form is missing, make sure it has been published.Before you can allow guest users access to your forms, you must create a \"Sample Guest User\" with the appropriate access and permissions. Click the Administrator tab.Select Users in the left hand menu.Select \"User Profiles\" in the right hand menu.Select \"New Users.\"Add an email address for the sample guest user. Every user in the Apricot database must be associated with a unique email address, but no one will actually be using this email address to log into the system (guest users will create and manage their own login information), so you may use a fake email address here if you wish.Add a password. Again, a password is required for each Apricot user, but because this is a sample user account, you can add something simple here.Add a name that will identify this user account as the sample guest user account.Under \"User Type,\" select \"Guest.\"Save record.Once the record has been saved, select \"Go to Search.\" Once you have returned to the search menu, select \"Programs\".Select \"New Program\".\nGive this Program a name that will identify it as a sample guest user Program.Select a Site (in this case, Default).Save record. Hover your mouse over the Actions tab.Select \"Create new.\"Name the permission set.Under \"Assigned Users,\" click the \"Add\" button.Select Sample Guest User from list.Save the record.\nGuest users will need access to at least a Tier 1 form where they can create their own login credentials.Open the Administrator tab.Select \"Standard Forms\" from the left hand menu.If you will be editing a form that has already been created, find the row of data that contains the form you would like to edit and hover your mouse over the Actions tab.Select edit.If you will be creating a new form, select \"Tier 1 From Scratch\" on the right hand menu. Add a User Creation FieldIn the Field Choices palette on the right hand side, find the \"User Creation\" field and drag it into the body of the form.Open the gear box in the upper right hand corner of the user creation field.Rename the field.Under \"User to Copy,\" expand the drop down menu. You will see a list of all the users that have been added as \"Guest Users\" in the Apricot database. Select the sample guest user you created.Select Apply.Publish the form. (Your form will need to have at least one other field set as Searchable and as Duplicate Check before your form can be published.) Open the Administrator tab.Select Users from the left hand menu.Select Programs from the right hand menu.Expand the Add Search Field drop down menu to add a search field.Search for the sample guest user Program you created previously.Select the gray text to be taken to the document folder.Expand the gray arrow next to Permission Sets.Select the permission set you previously created.Scroll down to the Permissions section and find the name of the form you have set up with the User Creation field and grant appropriate access to this form:View Record (Recommended) - Allows your guest users to view records they have created of this form.Search Record (Not recommended) - Allows guest users to search among all the records of this form - guest users should only have access to records they have created themselves, so they should not need access to any search function.Create Record (Recommended) - Allows guest users to create new records of this form. They will need this access to create their own login credentials.Edit Record (Recommended) - Allows guest users to edit records they have created.Archive Record - Allows guest users to archive a record. Recommended for Tier 2 forms only.Ignore Program Assignment (Recommended) - User RLA is recommended, and can only be turned on when program assignment is being ignored.Apply User RLA (Recommended) - Allows guest users to access only records they themselves have created.Create/Edit Forms (Not recommended) \n For your guest users to have initial access to the Tier 1 form you created, create a Secure Web Form with a link you can email or publish publicly.Select the Administrator tab.In the left hand menu, expand External Access and select Secure Web Forms.Click \"New Secure Web Form.\" Name your Secure Web Form.Select the form that will be accessed by the Secure Web Form URL.Select the sample user you created for Guest User Access. All guest users who access this Secure Web Form to create their own login credentials will be given a copy of the access given to this sample user.Under Permissions, you will see if your sample user has enough access to view and/or create the form you have selected under \"Select a Form.\"If access is too restricted and needs to be changed, you will see red text here. If access is sufficient, the text will be green. Clicking on the text will take you to the permission set where you can adjust what the sample user can access.Choose the Program the records should be assigned toSave RecordOnce the record is saved, the fields in the URLs section will be populated. You can copy these as needed to distribute to potential guest users.\n Guest User Access works best if you set up both a Tier 1 form where the guest user will create their own login credentials as well as a Tier 2 form to collect relevant data from this user.Access the Administrator tab.Select Standard Forms from the left hand menu.Find the Tier 1 form you have already created for your guest users.Hover your mouse over the Actions tab and select \"New Tier 2 From Scratch\" or \"New Tier 2 from Template.\"Add relevant fields to the form.Publish. Return to the Permission Set Details to Add Access to Tier 2 FormReturn to the sample guest user permission set and add access to the Tier 2 form you have created.Save record. Select the Administrator tab.In the left hand menu, select Apricot Settings.Under the \"User Licenses\" section, scroll down to the drop down menus. Select all the forms you have created that will be accessed by your Guest Users.Save settings.","title":"Granting Guest User Access through a Secure Web Form","url":"https://apricot-articles.socialsolutions.com/en/articles/1817596-granting-guest-user-access-through-a-secure-web-form"}