{"content":"Programs allow for you to limit user access within a program by outlining which forms, reports, and bulletins a user can access. Limiting or granting access is a two step process. First you will create a program and second you will create a permission set.\n\nIf your organization has made the decision to use Sites, you will have a third level of organization. To learn about sites, click here.In Apricot, programs are collections of users within each site. The programs in your Apricot can mirror the programs or departments in your organization, each with their own staff members and data - a program for counselors, a different program for interns, a different program for volunteers, etc. Each program can have their access to Apricot forms, reports and bulletins limited to only the kind of data they need to see on a regular basis.Once you have created a program, you will add a permission set to that program. Every program should have at least one permission set. Learn how to create a new Permission Set.Each permission set will govern which specific forms, reports and bulletins the users of each program will be able to access.Open the Administrator tabClick the \"Access Control\" drop-downChoose \"Sites & Programs\"Click \"New +\"If your organization has Multi-Site functionality, you'll see be directed to this screen which allows you to choose to create a New Site or New Program.\nTo create a new program, choose the option \"New Program\" on the right.\n\nWhen creating a new program, you'll be able to complete up to 4 sections of data:\n\nProgram Details - set the program name, add an optional description, and select which site the program will live under. If your organization does not have multiple sites, you will have one site titled \"Default.\" This is where your programs will live.Program Location - an optional section to set the program's physical location using an address which includes a Google Maps address look-up field.Program Contact - an optional section to assign contact information for a program's point of contact, such as a program manager.Program Referrals - if your organization has the referrals premium feature, you can designate whether a program sends and/or receives referrals here. You can also assign an email address to receive notifications of incoming referrals to this program.NOTE: Make sure to hit \"Save Program\" at the bottom of your window once you've completed entering the program information; otherwise, this data will be lost when you navigate away from this page.\nTo edit a program:Click on the Administrator tab.Under \"Access Control,\" click on \"Sites & Programs\"Click the name of your desired site which contains the program to be edited (your organization may only have \"Default\" if sites are not being used.Click the eye on the right side of the row for the program you're attempting to edit/deactivate.Once you've scrolled down to the \"Program Status\" pane, you can click \"Update\" to make the field editableSelect \"Inactive\"Click \"Save\"","title":"Programs","url":"https://apricot-articles.socialsolutions.com/en/articles/1817603-programs"}