{"content":"Select the \"Administrator\" tab at the top of the page.In the left hand menu, select \"Standard Forms\" from under the \"Form Designer\" category.Now you can see the list of all the existing Tier 1 forms available to be edited. Expand the black arrow next to the name of a form to see a list of associated Tier 2 forms.When you have found the form that needs to be edited, hover your mouse over the Actions tab and select \"Edit.\"Select \"Previous Version\" from the right hand menu at the bottom of the page. This will remove any changes that have been made since the form was last published. Note: If you need to revert your form and are unsure what recent changes you will be over-writing, it may be a good idea to view the form within the \"my Apricot\" tab. This will show you the most recent published state of the form. The only consideration here is that if you are using form logic some fields or sections may need to be unhidden to give you a full picture of the current published state of the form.You may change the field Display Name of a field at any time. This will not hurt old data or change related report columns.You may change Field Choices at any time but there are some things to keep in mind: If you remove an option, it will not update old records. Those old records will retain the old field choice within an \"Other\" box; If you update an option, say from \"A\" to \"A1\", old records will not be updated, they will retain the old field choice within an \"Other\" box; You may add a choice anytime.Field positions can be changed within the form at any time and won't affect your data, but if you are using Form Logic you will need to ensure the rules have not broken. Expand each form rule to view details, if there is a problem you will see an empty value for a field name within a condition or action.Deactivating a field will remove the field from the form and you will not be able to report on the data. Please note, you can reactivate the field at any time  and the data held within the field will be restored (you may need to add a new column into your reports after reactivating the field in some cases).Support can make copies of forms. If a form on your site needs to be copied, contact Support, and they'll gladly assist you in copying the forms that are needed. Support can make a copy of the Tier 1 form and put it under another Tier 1 form, making the copy of the Tier 1 form into a Tier 2 form. The same can be done for a Tier 2 form by making a copy of the Tier 2 form into a Tier 1 form.","title":"Editing Forms","url":"https://apricot-articles.socialsolutions.com/en/articles/1817543-editing-forms"}