{"content":"Apricot's link function allows you to create connections between records that may or may not otherwise have a connection. These links between records can be used to improve data quality, improve reporting accuracy, and simplify user workflow.Wizard Linking is a linking feature that can improve your user workflow. With this feature, links will open the linked form in a pop-up window, allowing a user to fill it out and save it and then return to the original primary record without opening or closing extra tabs.\nThe record in the example above shows a wizard-style linking field's appearance.It has two \"wizard links\" to some of the Tier 2 records that live in the Tier 1 document folder.Clicking the \"New\" button in one of these links opens a new pop-up window of a new record of the linked form, which can then be filled out, saved, and closed; and then returns the user to this spot where they can continue filling out the base record.Document Folder After Filling Out Wizard-Style LinksThis is what the Tier 1's document folder looks like after creating Tier 2 records with the wizard links.Both of the Tier 2 forms under the Tier 1 record have already been filled out. If your users follow a workflow that requires them to create multiple records for a client, this can save them time because it will be like creating just one record - but in effect they will be creating each linked Tier 2 record at the same time.These Tier 2 records, even though they were created with wizard links, can be accessed like any traditional Tier 2 record. Users can still use the document folder to create more if needed - they can also create more by accessing the base record and creating more linked records.Adding a New Wizard Style LinkTo add a new wizard style link to an existing form, open that form for editing in Form Designer.Expand the black arrow next to Linking to display the link fields.Drag a link field into the body of your form.Open the link field gear box.Under \"Linked to,\" select the form you would like to connect to the form you are editing.If you select a relationship that is can be made into a wizard style link (see list below), the Wizard Style checkbox will appear. Select it. Note: If you are linking two Tier 2 forms (that live under the same Tier 1 form) then Same Folder Linking will be applied automatically.Apply.Updating a Traditional Link Field to a Wizard Style LinkTo update an old or traditional link field to become a wizard style link, open the field gear box on a link field.If the link field connects forms in a relationship that allows wizard style linking,Then you will have the option to make this link relationship into a wizard style link.When you are finished, click Apply. You must also publish the form for changes to take affect for your users.Available Link Relationships for Wizard Style LinkingWizard style links can be created for the following link relationships:Tier 1 form(Base link) to unrelated Tier 1 form(Target link)Tier 1 form(Base link) to related Tier 2 form(Target link)Tier 2 form(Base link) to related Tier 2 form(Target link)Tier 2 form(Base link) to unrelated Tier 1 form(Target link)2. Wizard style links cannot be created for the following link relationships:Tier 1 to unrelated Tier 2Tier 2 to unrelated Tier 2Wizard Style links cannot be created with the Batch Record Creation tool.Wizard Style links will only create new records. They cannot be used to connect existing records.Note: Wizard Links do not stack (you can't open a second wizard link from an open wizard linked form)","title":"Advanced Linking: Wizard-Style Linking","url":"https://apricot-articles.socialsolutions.com/en/articles/1817577-advanced-linking-wizard-style-linking"}