{"content":"Records can be archived or deleted from your Apricot database when they are no longer needed.Information about how to archive records can be found here. Records that have been archived will no longer appear in search results or in reports. However, they can be restored to the database by an Administrator.Deleting records will permanently remove them from your database. Only Administrators can permanently delete records. To delete a record, it must first be archived. Once a record has been deleted, it cannot be restored or retrieved.The first step to permanently deleting a record from your database is to archive that record. To locate a Tier 1 record,Open the My Apricot tab,Select the form from the left hand menu,Add a search field, if necessary, to locate the record you want to archive.Type into the search field to narrow your search results.When you have located the row of data that contains your Tier 1 record, click on the green text to open it.Once you are in the record you would like to archive, click \"Archive Record\" in the right hand menu.Confirm.Note: When archiving a Tier 1 record, the Tier 1 record, as well as any Tier 2 records associated with it, will also be archived at the same time. Only Administrators can archive Tier 1 records. Once a record has been archived and removed from the database, it can be permanently deleted by accessing Archived Records.Open the Administrator tab.On the left hand menu, select \"Archived Records\". The Archived Records window will open.Hover over the Actions tab and select \"Search\".You will be taken to a search screen showing you all the Tier 1 records that have been archived. Click anywhere in the green client data text.\nYou will be taken to the archived Tier 1 record.Note that the data cannot be altered when the record has been archived.From here, you may delete the archived record.Confirm that you want to delete this record. This action cannot be undone.Notes:When you delete a Tier 1 record, all associated Tier 2 records will also be deleted.Once a record has been permanently deleted, you will be returned to the Tier 1 search page.Once a record has been permanently deleted, we (Social Solutions) will not be able to recover it.In order for Support to permanently delete records, you must provide a CSV file with at least 50 Record Ids.","title":"Deleting Records","url":"https://apricot-articles.socialsolutions.com/en/articles/1817265-deleting-records"}