{"content":"When a form has been newly created or has been opened for editing, the Field Choices palette on the right hand side will list all of the fields that are available to be added to your form. They are organized by category.Expand the black arrow next to the category you need and a list of available fields will be displayed. Select one by clicking it and drag it into a section of your form.Note: You will see a green highlight appear when you have dragged a new field over a section and are hovering over an area that will accept a new field.If you are unsure which category contains the type of field you need for your form, expanding the arrow next to \"All\" will display a list of all fields in alphabetical order. If you discover that you have dragged in a field that you do not want, you can delete it.1. Open the green gear box in the upper right hand corner of the field.2. If your form is currently unpublished, you can delete a field by selecting \"Delete.\"*Please note that fields can only be fully deleted when a form has not yet been published*If your form has been previously published, fields cannot be completely deleted. Instead they are \"deactivated.\"Deactivating a field removes it from your form so it can no longer be used to collect data. However, since the field had been published on a form at one time, there may be historical data that has already been collected. To retain any historical data, the field and any data collected in it will remain available as an \"inactive field.\" The field can be reactivated at any time to retrieve this data from records or reports if needed.To deactivate a field, open the green gear box in the upper right hand corner of the field. Select \"Deactivate.\"To see the inactive fields on a form, select \"Show/Hide Inactive Fields\" in the bottom right hand corner of the page. Each section of your form that contains inactive fields will have an area at the bottom of the section where the inactive fields will be listed. To re-activate a field and add it back to your form, click and drag the field to the area above the text \"Inactive Fields.\"Then save or publish your form.Fields can be moved or re-positioned to any location in a form.1. To move a field, click and hold near the name of the field. It will become mobile and you can drag it to another area of your form. You can even move it to another section.2. A green bar will appear when you move it to an available area of your form.Release your mouse and your field will appear in its new place.\n To deactivate a field which has been used in a form rule, first delete all Form Logic conditions and actions that apply to the field. Read more about Form Logic","title":"Adding and Removing Fields in a Form","url":"https://apricot-articles.socialsolutions.com/en/articles/1817549-adding-and-removing-fields-in-a-form"}