{"content":"The grouping feature in Report Builder is a useful tool for creating meaningful reports out of the data you have collected. Grouping on a specific column in a report creates a row of data for each answer that has been collected in that column; each date, each name, each service, etc. You can also group on several columns of data in the same report section, which can make your data easier to understand at a glance. If you need to use a graph for your data grouping can make your graph easier to understand.This report section shows participants' demographic and program information. We can see their names, ages, start dates, enrolled program, and enrollment notes in the column headers. Grouping can help us if we want to see:All record rows related to an individual: We can \"Group\" on the client name to see a row of data for each person.Records organized by age: We can \"Group\" on the age to see a row of data for each number listed under the Age column.What happened on each Start Date: We can \"Group\" on the Start Date column to see data for each date a program began.How many participants enrolled in the individual programs: Grouping on Program Enrolling can show us at a glance how many participants were enrolled in each program. To Access Grouping:Click the green gear box at the top of the column you would like to group. This box is called \"Column Properties\".Under \"Group By This Column,\" select \"Yes.\" The title of your column will include (grouped) so you can identify it when looking at your report section.Click \"Apply.\" A Report With Grouping:We are now grouping this report section on the data in our gender column. The column header title has turned white, to identify it as the grouped column.We now have a row of data for each age of the participants.To hide the row results, collapse the black arrow. In the Report Builder (the edit side of reports), the rows will only preview for the first grouped result. In the run version of your report, these can be expanded for all the grouped results. If you have more than 5 groups in your report, the Report Builder will only show the first five groups. All groups will appear on the run side of the report.We still get the \"Total Rows\" result, showing all the breakfasts that were served. Depending on your Section Count setting it may not be on \"Total Rows\" and you may find more information with Report-Counts Article. Grouping is an easy way to make graphs easier to read and more meaningful at a glance.You can tell we are grouping on the gender column because the column header title says (grouped).Use the report section gear icon to turn on the graph in the section's properties.Use the graph gear icon to adjust what kind of graph you want to use for the section. Here we are using grouping on several columns.By grouping on the \"Age\" column, we get a row of data for each Age we have served. In the example above, we get rows for 21, 18, 17, 16, 15.We are also grouping on the last name, so we have a row of data for each person we served. If you have more than 5 groups, only the first five will be displayed in the Report Builder. All groups will be displayed in the run version of the report. The left-most grouped column corresponds to the topmost level of grouping. If you want to change the order of grouped data, you can drag a grouped column to the leftmost position. If we wanted to see who was served on each date, and therefore wanted to date field to be the first column that was split out by grouping, we would move that column to the left of the name column. Clicking any of the black arrows next to a row of data will expand to show the results.\n","title":"Grouping in Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/1817259-grouping-in-reports"}