{"content":"The Form Permissions feature allows Apricot Administrators to see which Programs/Permission Sets have access to View, Search, Create, Edit, or Archive records of that form at a glance. It also allows them to see which Program/Permission Sets have User RLA applied or those which ignore Program Assignments. Limited adjustments can be made from the Form Permissions to the Permission Sets as well.Why Use Form Permissions?The Form Permissions is an area to go to where you can get an \"at a glance\" view of Programs/Permission Sets that are (or are not) associated with a form. It allows for quick editing of the Permission Sets (Form based permissions only) without having to go into each individual permission set to make adjustments. However, it still allows you to go into the Permission Sets to make further adjustments (like access to reports, for example) by clicking on the Permission Set name.Navigate to the Administrator tabClick \"Form Designer\" in the left menu to reveal additional optionsClick \"Standard Forms\"Once you've chosen the form you want to edit, hover over the \"Actions\" buttonClick \"Edit\"1. Once the form is open for editing, click \"Form Permissions\" in the bottom right hand corner.2. This will open the Form Permissions pop up window. On the left hand side, you will see a list of all the groups in black text and Users under them in green text (hyperlink to the Permission Set) . This will be a list of all the users and groups that have already been set up in your Apricot.To give or remove access to the form you have opened for editing, select the checkboxes to the right of the user or group name.3. Select save.4. Publish the form. Once the form has been published, your changes will immediately go into effect.Note: These changes will be in effect until they are adjusted again by an Administrator. Choosing to revert a form to a \"Previous Version\" will not alter the Form Permissions.\n\nTips/Hints:View Record: This is needed for users to be able to see records/formsSearch Record: This is needed if they want to search for records of a form (for example, using Search Fields)Create Record: Allows users to create new recordsEdit Record: Allows users to Edit records that already existArchive Record: Allows users to Archive records (standard users can only archive tier 2 records)Ignore Program Assignment: This removes access restriction by program. For more information, click hereUser RLA Applied: This enforces User Record Level Access - Please note that this setting can only be applied when Program Assignment is being ignored, in other words, you must check both boxes to activate User RLA. For more information about User Record Level Access, click here.","title":"Form Permissions","url":"https://apricot-articles.socialsolutions.com/en/articles/1817623-form-permissions"}