{"content":"Fields govern how data is collected and reported on in Apricot. A diverse selection of fields is available in the Form Designer, some tailored to correctly collect very specific kinds of data.Open the form you want to edit in Form Designer.In the Field Choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your form.The Address Lookup field permits the user to enter in part of an address and see a search return possible matches that will fill in the remainder of the address lookup fields with correct information and displaying a map of the area. This field is integrated with a Google Maps API (results are pulled from Google Maps).In the screenshot above is the default setup of the Address Lookup field.All Standard Properties can be used with the exception of the following: Duplicate Check, Clear on Copy, and LockedSpecial Properties for this field include (Note: these are hidden by default but will still automatically fill in):Show Neighborhood: This shows the Neighborhood field. For example, this is where \"East Village\" or \"Chelsea\" from Manhattan would be filled in.Show Country: This shows the Country field. For example, this is where \"United States\" would be filled in.Show Coordinates: This shows the Geolocation field. For example, this is where the GPS coordinates are filled in (this is required to properly map a location).This field also includes Map Options:Default Zoom Level: this will allow you to set a default zoom level (how close to the map it will be. 1 being the farthest and 21 being closest; 12 is the default)Hide Map: if you do not want to see the map, this should be checkedHow to Use the MapEnter data into Line 1 of the addressAs you enter data into Line 1 the yellow box will begin to populate with possible addresses. Click the one which you'd like to map (you can narrow down the yellow box results by adding a State and Zip, for example). Click on the one you would like to map.Hints and tips:If you are going to use the Address Lookup field you must enter in a Line 1, City, State, and Zip code at minimumThe address in Line 1 must be a valid address, or this field may not allow you to save (if there is a possibility you may need to enter many records where the Line 1 will be unknown we advise not to use this field for the address, but instead use the regular Address field found in the Demographic field types)You must click a suggestion in the yellow box for it to correctly map a locationYou may import into this field. However, for Apricot to map the imported addresses all fields need to be imported (including Geolocation)Note for Quick View:When the Address Lookup field is set to be a Quick View it will only show data as Quick View data if all of the following data points are filled in:Line 1CityStateCountyZipWe advise to click on the suggested address to be clicked as well to map on it. If all of the above criteria is met then only Line 1 of the Address Lookup field will be displayed in the Quick View area. However, if the data was mapped you could then click on the house symbol and another pop-up will display showing the entire address (without going into the record). Email triggers allow users and others to be notified via email when records within Apricot are created or modified, or when specific fields on a form contain specific values in conjunction with the form being created or modified.This field must be configured before the form can be published and made available to users.Main tabReply To: this is the text box where you can enter an email address that users can reply to when they receive an email. By default (if left blank), emails are sent from a standard Apricot email, to which a reply cannot be sent.Recipients: this is the text area where you can enter the email addresses that will receive the email. Please separate them with a comma. You may enter them in manually, you can click a users name in the \"Users\" dropdown or you can even add an email field from the \"Fields\" dropdown. Note: you can add an email field from the form in which the email trigger exists or, if the email trigger is present within a Tier 2 form, you can pull an email address from an email field within it's associated Tier 1 record as well. Email Text TabSubject: this is the text box where you will add a \"Subject\" which will show in the subject line for the email that they receive.Body: this is where you can enter email text that will show up in the body of the email. You can use your own HTML by using the \"Source\" button or you can use the built in editor.You may also add fields to the body from the form/record (the current form/record or it's associated tier 1):Label/Value: If you \"Add Field To Body\" or \"Add Field Set To Body\" it will show up as Form Name - Label [Label] Do not remove the item in red. This is where the value from the record will populateInline: if you \"Add Field To Body\" or \"Add Field Set To Body\" it will show up as [Label] Do not remove the item in red. This is where the value from the record will populate Filters TabFilters on email triggers govern what conditions must be met before the email will be sent. You can set it to send an email when a record is created and/or updated. You can also set it to only send out if a specific field on the form is changed.You must choose one of the \"Trigger Event When\" checkboxes or the email trigger will not trigger (You can choose more than one. If so it will use \"or\" logic)You can add an \"and\" filter with \"This Field is Changed\" dropdown. This will allow you to select a field on the form which must be changed as well as match one of the trigger event checkboxes to trigger. You may only choose one fieldYou can also add additional \"and\" criteria based on other fields (from the current form/record or it's associated tier 1 form/record) which would allow filters to be applied. \"Filter logic\" can be used. AttachmentsEmail Triggers can also send attachments. Before this can be added to an email trigger, your form will need to have an attach doc field (Click here to see a related article: Upload Fields) on this form or your Apricot will need to have Shared Files that have already been uploaded. Note: If the email reaches 25.00 Megabytes it may not send. Please ensure that it is under that size.For Additional Tips/Tricks and a much more detailed overview of email triggers please see the related article here.\n The label (simple) field is used when the Administrator needs disclaimers, instructions, or notes on a record for the user to read when filling out information. (Example: \"This form should only be used for those service recipients that are in the Accelerated Learning Program.\")Once filled out and published, it cannot be edited by the user.This field can be made Hidden. This field only accepts basic text. The Label (HTML) field is used when the Administrator needs disclaimers, instructions, or notes on a record for the user to read when filling out information. Unlike the label (simple) field, this field can be formatted with text size, color, emphasis, background, styles and justification. Text can also be easily presented in bulleted or numbered lists. It also has horizontal lines, special character entry, links, and the ability to write or view the label in HTML (by using the source function) to labels. Tables can also be created within the label.Once filled out and published, it cannot be edited by the user.This field can be made Hidden.\n\nNote: Do not copy/paste from Microsoft Word or any other word processing program. This will break your form. Please do all formatting with the built in HTML editor only or if you must paste from Word or another word processing program please Right Click, and select \"Paste as plain text\". The record lock field changes all fields on a record to be locked or read-only. Once record lock has been selected on a record, the information entered in a record cannot be edited or changed.You can configure this field to allow certain groups of users to lock records and certain other groups to unlock them.This field can be made Quick View, Searchable, or Hidden.For additional details please the Lock Records article here.The Signature field captures name and signature, date and time at signing, and the logged-in user as witness.Text entries and date can be used in reports, but not the signature image.The signature field be can made Quick View, Required, and Searchable. Locked and Hidden are possible but not recommended unless preserving historical data while removing future use.For additional details please see the Electronic Signatures article here.User creation is a field that allows the person filling out the record to create a new Apricot user. The information entered into this field will be added to the list of users who have access to information in the Apricot database.This field will need to be configured before the form can be published and made available to users. To use it, your Apricot needs to have \"Guest User Access\" turned on and at least one sample guest user already set up in the system. The users created with this field will always copy the sample guest user.\n\nPlease note that this field will only generate a username and password upon record creation, NOT record modification. In other words, if you have already clicked \"Save Record\" without entering a username and password into this field, you will need to archive that record and create a brand new one in order to generate a username and password successfully.This field can be made Required or Hidden. It is Required by default.For additional details on how the User Creation field, Guest User Access, Secure Web Forms, and AFF (if applicable) work together in the Guest User Access article found here.","title":"Special Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/1817640-special-fields"}