{"content":"What a User Sees When Filling Out a Record\nName of the form can be found at the top of the page.Each wide bar indicates a section of the form. Most forms have more than one section.Each item to be filled out is called a field.Some fields have a double square icon next to them. This indicates a field which has been marked as a \"Duplicate Check.\" When you fill out information in a \"Duplicate Check\" field, the database will automatically check the information against other records that have already been created, to ensure you are not creating a duplicate of something that already exists.Some fields are marked with an asterisk *. That indicates a field which has been marked as required. A record cannot be saved until information has been entered into every required field.The \"Record Save Checklist\" palette provides a user with a list of all required fields that still need to be filled out before the record can be saved.The Assigned Programs palette allows a user to set program access every time they create new records or edit existing records. Records assigned to program can only be access by users who have been given appropriate program access. What a User Sees in the System Fields Section\nEvery form in Apricot has a section at the bottom called \"System Fields.\" These are fields that are automatically filled out by Apricot when a user creates or saves a record.Record ID: Every record created in Apricot is labeled with its own unique ID number. Record IDs can be used to identify the differences between two records that may have very similar information. A Record ID is assigned when a record is created and cannot be altered by a user.Assigned Programs: Displays the Programs currently assigned to the record.Modification Date: The most recent date and time when a record was modified or changed.Modified By: This records the name of the user who most recently modified or made changes to a record.Creation Date: The date and time that a record is created.Created By: When a record is created and saved, the Apricot system records the name of the user who made the record.What an Administrator Sees in Form Designer\nThis is the same form viewed in the Form Designer. A form can be edited and customized when it is open in Form Designer.Name of the form can be found at the top of the page.Each wide bar indicates a section of the form.Each gray item in the form is a \"Field.\" The \"Field Choices\" palette on the right hand side contains a list of all the available fields that can be added to the form.Requirements: Before a form can be filled out by a user, it must meet certain requirements, which will be listed here. This form is required to have a \"Duplicate Check\" field, as well as a field that is both \"Quick View\" and \"Required.\" See below for more detail on how to make sure your form meets these requirements.Form Actions:Save Form: Saves the current version of your form, but doesn't push any changes to the users or to the data entry side of Apricot.Publish Form: This saves the current version of your form and makes all changes available to users.Previous Version. Reverts to the last published version of the form.Deactivate Form: Removes the form from the list of available forms. The form and the data it contains are not deleted, but they are removed from the users and the data entry side of Apricot. You cannot report on deactivated forms or their data.Form Permissions: Here you can adjust which users can use this form.Changing Form Properties\nIn Apricot, the gateway to finding customizing features is often through a green gear box.Click the biggest green gear box at the top of the page to open the properties that govern an entire form.You can edit the form name and add a description. Choosing a name that accurately reflects the type of data being collected will increase its usefulness and value. Descriptions added here will appear on the list of available forms in the Form Designer.Adjust settings:Hide from Navigation Menu: checking this box means that the form will be placed into a category called \"hidden records\" in the left hand navigation menu on the my Apricot tab. Users will need to click the \"hidden records\" option to see records of a hidden form.Allow Search by Linked Forms: checking this box means that when searching for records that have been created of other forms, the searchable fields available in this form will be available in the search drop-down.Allow Copies: allows users to make copies of records. If \"Allow Copies\" is selected here, then a field property called \"Clear on Copy\" will become available to fields that are added to the form.Enable in Apricot Results Reporting: checking this box will allow this form to be used in Apricot Results Reporting. This option is only available to sites that have the Apricot Results Reporting feature.Enable Form Logic: checking this box will allow Form Logic to be used in the form.4. Program Assignment Type: Allows Administrators to set the default behavior for assigning records to programs. Available options are: User Selects Program AssignmentAssign Records to Form's Associated ProgramsAssign Records to User's Active Programs5. When adjustments are finished, click \"Apply.\"Changing Form Section Properties\nTo change properties available for a form section, click the green gear icon for the the section. These changes will apply to all the information contained in this section of the form.Edit the name of the section.Choose your display options: \"Collapsed\": the section will appear as collapsed when the form open; \"Hidden\": the section will not appear when the form opens. This can be useful if you have calculation fields or other \"behind the scenes\" fields that you do not need to appear when the form is being filled out.Tab order. This governs which direction - Row by Row or Column by Column - your users can tab to as they fill out the form.When you have finished editing the Section Properties, click \"Apply.\"Changing Form Field Properties\nTo open the properties that govern a specific field, click the gear box in the upper right-hand corner of the field.At the top, the title will always show what kind of field you are using. The example above shows a name field that still has the display name \"Name.\" But if you re-name fields and can't remember what kind of field they are, opening the gear box and looking at the title will always tell you this information.You can edit the name that is displayed.You can also edit the standard properties. This is where you can indicate that a field should be \"quick view,\" \"searchable\" or \"required\" to satisfy the requirements in the right hand palette.Required: When checked, this field will be required to be filled out before a record can be saved.Quick View: On the search page, Quick View fields appear as columns to identify a record.Restricted: A restricted field is essentially locked and its properties cannot be adjusted or edited except by Social Solutions staff.Duplicate Check: The database will automatically check the information in all duplicate check fields against the same fields in other records that have already been created to check that your users are not creating a duplicate of something that already exists.Searchable: On the search page, this field will be available for search.Clear on Copy: This option only appears if you have selected \"Allow Copies\" in the form properties at the top of the page. When a record is copied, all the information in that record will be copied, except in fields that have been marked as \"clear on copy.\" Note: any fields marked as duplicate check are automatically marked as Clear On Copy and this cannot be changed.Locked: This field will be \"read only.\" Users will not be able to add or edit data in this field.Hidden: This field will not appear for users to fill out. Having hidden fields can be useful for calculation fields or other fields that operate \"behind the scenes.\"5. Tooltip: When you enter information into a \"Tooltip Field,\" a \"?\" will appear next to the field name on the form and on the record to be filled out. Hovering your mouse over the \"?\" will show the information entered here.6. Display style: Some fields have an optional display style that can be customized. This name field can be displayed in two different orders7. When your field has been customized, click \"Apply.\"System Fields\nEvery form in Apricot has a section at the bottom called \"System Fields.\" These are fields that are automatically added to your forms when they are created and are automatically filled out by Apricot when your users create records.In most cases, you do not need to change or modify the System Fields.Record ID: Every record created in Apricot is labeled with its own unique ID number. Record IDs can be used to identify the differences between two records that may have very similar information. A Record ID is assigned when a record is created and cannot be altered by a user.Assigned Programs: Displays the Programs currently assigned to the record.Modification Date: The most recent date and time when a record was modified or changed.Modified By: This records the name of the user who most recently modified or made changes to a record.Creation Date: The date and time that a record is created.Created By: When a record is created and saved, the Apricot system records the name of the user who made the record.","title":"What is in a Form?","url":"https://apricot-articles.socialsolutions.com/en/articles/1817608-what-is-in-a-form"}