{"content":"Support is available Monday - Friday, 7:00 AM to 7:00 PM CST. See our 2023 holiday calendar here.In addition to all of the methods detailed below, you can always reach the Apricot support team by sending an email to apricot@bonterratech.comwhich will generate a support case for you automatically.If you're looking for articles on specific topics related to working within Apricot, click here to check out our knowledge base. We also have a fantastic resource on how best to provide the right details for the support team here.Apricot includes built-in chat support on every page. Click the green icon in the bottom right-hand corner of the window to chat with us! Learn more here!\nHome - Open a new chat or see a quick view of our latest notes, articles, and messages.Messages - Browse previous conversations or open a new chat.Help - Browse the knowledge base articles to learn about Apricot.News - Browse recent release notes and new product features.Open tickets, view previous tickets, explore user groups, and more through the Help Center! To access the Help Center while you are logged in to Apricot, click the \"help center\" link from the left navigation menu. A new window will open with access to the Help Center.If it is your first time visiting the Help Center, you will be prompted to log in.2. Click \"Log in with Apricot\" and the system will immediately create a user account for the Help Center using the email address and password you use to login to Apricot.Note: If you receive a sign on error, remove all capital letters from your username and try logging in again.Once inside, you will have the options to explore much more, see an in depth article here. You can email support at this address: apricot@bonterratech.comIf you would like to use your 1 hour of support consultation time (add on), please open a ticket to schedule a call.Please see our support packages for questions regarding phone support packages. Please see our scheduled maintenance, unscheduled maintenance and any open incidents on our status page.Our status page will detail scheduled maintenance, but we also publish scheduled maintenance here.Critical cases are defined as: Client’s production use of the SSG Software is stopped or so severely impacted that no User can reasonably continue to use or access the SSG Software. Critical requests have one or more of the following characteristics:(a) data corruption(b) SSG Software hangs causing unacceptable delays or(c) the SSG Software is inaccessible to all Users. Target response time for Critical/Business Down cases will be 2 hour. More on case priorities here.To open a critical priority case: Open a critical priority support ticket through the Help Center with priority = Critical or call our emergency line at 1-469-874-0792 Ext. 1.When users contact Customer Support, a case will be entered into our Customer Relationship Management (CRM) system resulting in a unique case number. This case number will be given to the customer and will be left open until the inquiry is answered or the issue is resolved. Each time a user contacts Support with a different question or issue, a new case will be entered into the CRM system and the corresponding case number will be issued to the customer.When you contact support, regardless of reason, we will log a Case.When you email support, you will receive an automated email about the Case creation with the case number.If you encounter what is determined to be a bug, we will log a defect and attach it to your Case so that you will be notified when the issue is resolved.","title":"Apricot Support | Contacting Apricot Support","url":"https://apricot-articles.socialsolutions.com/en/articles/1817519-apricot-support-contacting-apricot-support"}