{"content":"Accessing the Document Folder Merge Tool\nThe Document Folder Merge Tool is an advanced feature in Apricot and must be turned on by the Customer Care team before it can be accessed. It does not require an additional fee, but organizations that want to use it will need to request that it be turned on by accessing a secure web form here. An Administrator will need to request that this feature be activated.\nTo find out if you have access to the \"Document Folder Merge Tool,\" open the \"Administrator\" tab.Select \"Apricot Settings\" under Workflow Station.Under the section \"A La Carte Features,\" check to see that \"Document Folder Merge Tool\" has been enabled.Note: Only Administrators can use the Document Folder Merge tool once enabledFinding Duplicate Records\nTo find duplicate records to merge, click the \"My Apricot\" tab.On the left-hand menu, select the appropriate form.If necessary, expand the \"Add Search Field\" dropdown menu to add a search field.Narrow down the records by adding search criteria.In the example above, we can see that someone has entered Robert Superfake Jones twice - but they put the his full name in one record and then his nickname in the other record, so both records passed the duplicate checks and were saved separately. These records belong to the same person and need to be merged together.Click the \"Merge Folders\" button on the right-hand side. Only Administrators will be able to see the \"Merge Folders\" button.Combining Records\nFind the rows of data you would like to merge. Click on the rows.Under Duplicate Folders, select the primary folder (the one you want to keep. In this case, Robert Superfake Jones).Select Merge DuplicatesTip: Since many times it's just the names it may be easier to, in Step 1, to just select one first. Then, mark it as the primary. Then, choose the others that will be merged. Additionally, the one chosen as \"Primary\" will have an duplicate check symbol in the \"Merge\" column.Note: The Tier 1 record selected as the Primary Document is the only Tier 1 record that will be saved. All the other Tier 1 records that have been selected to be merged will be deleted and will not be available to be restored. This means that only data on the Primary Document Tier 1 will remain, including any links and related Attendance Tracker data. If any records are linked to the secondary Tier 1s, they will not be added to the Primary Tier 1 once the folders are merged. Before you merge your documents, it is recommended that you add or import all links onto the primary document Tier 1.  For more information on importing links, please see the Import Links article. Proceed with caution. You will still be able to view information from each Tier 1 record in the Record History.\nOnce you have selected \"Merge Duplicates,\" you will be asked to confirm your selection. Continuing will merge all chosen records into the primary document. This cannot be undone.\nWhen you have confirmed your merge, you will get a message that the merge was completed with details of how many records were merged into the primary folder. Now when you search for your duplicate clients, they will no longer show up. Only the primary document will appear in search.When you open the document folder for the primary document you merged the other records into, you will see all the Tier 2 records that been combined in one place.There will be nothing to indicate which of these Tier 2 records were originally part of this folder or which ones were merged from another document folder.Document Folder Merge Cannot Be Reversed or UndonePlease use caution when using the Document Folder Merge tool. This tool will remove records from your Apricot database. Data that is stored in a Tier 1 record that is *not* selected as the primary Tier 1 record will be removed and deleted from your database. These records will not be archived nor will they be available to be restored by either an Apricot Administrator or by the Social Solutions Customer Care team - they will be deleted. After Tier 2 records have been combined in a single document folder, there will not be an easy way to identify which records originally came from a different document folder.Before using the Document Folder Merge Tool, you can mitigate mistakes by:Printing out the Tier 1 records you plan to delete before you use the Record Merge Tool and keeping them for reference. Tip: If you don't want to print with paper you can save it to your computer as a PDF file with Chrome. To do so, while viewing the record right click anywhere on the record, choose Print, in the \"Destination\" click \"Change...\", then choose \"Save as PDF\"Printing out the list of Tier 2 records in the Document Folder for the Tier 1 records you plan to delete before you use the Record Merge Tool and keeping them for reference.After using the Document Folder Merge Tool, you can mitigate mistakes by:Using the Record (Audit) History feature to view Tier 1 records that have been deleted. They will not be available to be restored like a record that has been archived, but you will be able to view what had been recorded. For more information on using Record History to view deleted records, please see the Help Center section on Record Audit.","title":"Document Folder Merge Tool","url":"https://apricot-articles.socialsolutions.com/en/articles/1817595-document-folder-merge-tool"}