{"content":"Note: this guide is to setup a \"basic\" registration grid that will allow either \"every day\" dates, \"weekday\" dates, or \"weekend\" dates. If you need \"custom\" dates, such as every other date or the 5th of every month, please see our Advanced Registration Grid - Custom Dates guide.Apricot has two short cut options available for users who need to create multiple records that contain the same or similar information - batch record creation and registration grid.Batch record creation is a way to select many Tier 1 records (especially those based around a person, like a client record) at the same time, and to create the exact same Tier 2 record for each of them. If I select five clients, I can create five Tier 2 records, one of each of my clients, at the same time. If anything about one of those clients needs to be adjusted, I will have to open that record after I am done creating my batch records, and manually adjust it.Batch record creation is best used when you are counting attendance for a class or something similar for multiple people at once - especially when you are simply creating a record to show that someone attended. Registration grid works in much the same way as batch record creation - it creates multiple Tier 2 records at once. But it has the additional ability to allow a user to edit/adjust a record during the creation of the Tier 2 records instead of going back and editing the records manually.Registration grid is best used when you are counting attendance or something similar for multiple people at once *but must also* record individual details that may be different for everyone you are creating records for. If you need to count attendance, but you must also record a test score or whether or not a particular person was late, then registration grid can be quicker to use than batch record creation. To check if you have access to the registration grid feature,Open the Administrator tab,Select \"Apricot Settings\" in the left hand menu.Check under \"Premium Features\" to see if registration grid has been enabled. To correctly configure a registration grid, you need to set up three forms in advance:One Tier 1 form to track information about the class or event that the registrants will be attending. You will open a record of this form to access the registration grid itself.One Tier 1 form to track the \"registrants\" or people who will be attending the event or class contained in the registration grid. You will be linking or \"registering\" these people for class attendance.One Tier 2 form under the registrant Tier 1 form to record details of attendance or participation. You will be creating multiples of these records every time you fill out a registration grid. First we need to create the Tier 1 form that will record details about the registrants or people who will be attending the class or event contained in the registration grid.Click the Administrator tab.Select Standard Forms in the left hand menu.Select a Tier 1 form and hover over the Actions tab,Select \"Edit.\"Or, create a new form by selecting \"Tier 1 from Scratch.\"Find one or two fields that can be used to identify the person these records will be created for, like a name field.Note:If you'd like for the order of names in the registration grid to sort on last name instead of first name, you can do so by changing the \"Display Style\" pictured above to \"Last, First.\" This will affect all other areas of the software where these names appear as well. When you load the registration grid, only the fields that have been set to Quick View will appear in the grid, so you need to take these identifying fields and set them to Quick View.Note: Linking fields, Auto Populate fields and Dynamic fields will not show on the Registration Grid, even if set to Quick View.Open the name field gear box.Set it to Quick View.Publish your form. Now that you have created and configured your registrant Tier 1 form, you can create and configure the Tier 2 form that will track attendance for each of the registrants.Click the Administrator tab.Select Standard Forms in the left hand menu.Select a Tier 1 form and hover over the Actions tab.Select \"New Tier 2 From Scratch\" Or Select \"Edit\" for the Tier 2 form if you already created one.The registration grid will be creating multiple copies of this form for each of the registrant Tier 1 records. It needs to contain all the data we want to record in the registration grid - so add all the fields pertaining to attendance that need to be recorded for each of the registrants.The registration grid will only display fields that have been set to Quick View.Open the field gear box.Set the field to Quick View.Click Apply.Publish.Notes:One of these Quick View fields *must be* a date field.Keep in mind that the registration grid can become unwieldy and hard to read if there are too many fields on it; choose your fields wisely and limit how many of them you use. Now that you have created your registrant Tier 1 form and your attendance Tier 2 form, you can create and configure your class or event Tier 1 form.Click the Administrator tab.Select Standard Forms in the left hand menu.Create a new form by selecting \"Tier 1 from Scratch\" Or Select Edit for the Tier 1 form if you already created it. Link The Class Form to the Registrant Form\nYou will be opening a specific record of this class form to access the registration grid itself. Now we need to use link fields to connect this Tier 1 form to the other forms we have already created.Expand the black arrow next to Linking in the Field Choices palette. Drag the link field into the main body of your form. Repeat this step so that you have two link fields added to your form.Open the green gear box in one of the link fields.Rename the field.Under \"Linked to,\" select the registrant Tier 1 form you already created.In the second and third drop down menus, select Many both times. This will allow many registrant records to be connected to each class/event form.Apply.Link the Class Form to the Attendance Form\nYou will be opening a specific record of this class form to access the registration grid itself. Now we need to use link fields to connect this Tier 1 form to the other forms we have already created.Open the green gear box in one of the link fields.Rename the field.Under \"Linked to,\" select the attendance Tier 2 form you already created.In the second and third drop down menus, select Many both times. This will allow many attendance records to be connected to each class/event form.Apply. Add and Configure the Registration Grid Field\n\nOn the right hand menu, click \"Registration.\" This will add the registration grid field to your form.Open the gear box in the registration field.Update name if necessary.Select a schedule. Your registration grid will provide enough space to fill out a week's worth of data entry at a time. If you choose \"Weekdays Only,\" it will provide space for five days of data entry, Monday through Friday.Under Registrant Link, expand the drop down menu and choose the link field that corresponds to your registrant Tier 1 form.Under Registration Entry Form, expand the drop down menu and choose the link field that corresponds to your attendance Tier 2 form.Under Registration Date Field, select the date field from your attendance Tier 2 form.Click apply.Publish the form. Date Field Will Be \"Restricted\"\nAfter you have added and published the registration grid on the Class form, the date field on the Attendance form will become restricted.Restricted fields cannot be edited or removed from a form. This field will be restricted because removing it will cause the registration grid to break and become non-functional.You may contact the Social Solutions Customer Care team to have the restriction removed from this field, but only if you have removed the registration grid. Now you have finished creating the form structure needed to support the use of the registration grid feature.Your next step is to enter data for both of the Tier 1 forms you created.1. Click the My Apricot tab.\n2. Select the registrant Tier 1.\n3. Create at least one record.\nIn order for the registration grid to work, you must already have registrants entered into the system. \nEnter Data in Class Tier 1 Form\nClick the My Apricot tab.Select the class Tier 1.Create at least one record.In order for the registration grid to work, you must already have at least one class entered into the system.\nOnce you have entered data for each of the Tier 1 forms, you are ready to use the registration grid to create multiple records of the attendance Tier 2 form.Click the My Apricot tab.Select the class Tier 1 form.Open one of your class records for editing. You will be recording the registrants who have attended this class. Add Registrants with the Link Field\nClick \"Add.\" Select each desired profile to add it as a link to the Registration Grid.Save the record.Click to begin recording attendance. Parts of the Registration Grid\nClass NameClass Start DateShows how many days will display in the gridRefreshes the grid if any changes are madeShows names of registrants in classShows dates class is heldRecords attendance data for classAllows you to update multiple records simultaneouslySaves entire gridNOTE: Once you save a set of attendances through a registration grid, you cannot create another set of attendance records through the registration grid for the same date. Doing so will override the previous records.When new records are created individually (ie, without a registration grid), the Apricot database will \"validate\" the information that has been entered - to make sure it meets the requirements set up in the form. It double checks that all required fields have been completed and that all duplicate check fields are unique compared to other records that have already been saved in the system. When new records are created with a registration grid, the system skips this validation step. Some records can be created with incomplete information in this case.The registration grid does not have any data validation (for example, it will not enforce a minimum on a numeric field or does not enforce required fields).You must select a Program Assignment manually upon saving your records within the registration grid. When editing existing attendance records through the registration grid, program views are not enforced which can result in the registration grid displaying records that have not been assigned to the currently viewed program. An error will occur when attempting to save an attendance record that isn't assigned to the specific program view. An easy solution to this is to ensure that the program view is set to All Sites & Programs when editing existing attendance records.The following fields can be added to a form but cannot be added to a registration grid. If any of these fields have been marked as Quick View on any of the forms that feed into a registration grid, they will not show up in the grid:Attach docAuto PopulateCalculation (+) AddCalculation (-) SubtractCalculation (x) MultiplyCalculation (/) DivideCalculation RoundCalculation Date AfterCalculation Date BeforeCalculation Date DifferenceCalculation Time DifferenceDynamic CheckboxDynamic DropdownDynamic NumberDynamic TextForm LogicGrantGrant InvitationLinkRecord LockSchedulerSignature","title":"Registration Grid","url":"https://apricot-articles.socialsolutions.com/en/articles/1817602-registration-grid"}