{"content":"Go to the Administrator tab.Click Report Center in the left hand menu.Click on Report Choose \"Create New Report\" under Report ActionsNaming Your Report\nSelect the category for your new report.Type a name for your report into the \"Report Name\" text box.Click \"Create.\"If you need to change the name of your report or you would like to add a description, click the top green gear box. You can edit the name by typing into the Report Name text box.You can add a description by typing into the Description text box.When you are finished, click \"Apply.\"To name your first section, click the gear box for the first section.Type into the section name text box.Click \"Apply.\"If not already expanded, click the gray arrow next to Field Choices to expand the Field Choices palette. This will display all the forms in your Apricot.Expand the black arrow next to the form you would like to use in your report. You will see a list here of all the sections available in the form you have chosen.Expand the black arrow next to the form section you would like to use in your report.When you have found the field you would like to add to your report, drag and drop it into the main section of the report. NOTE: You will generally want to pull a field from your Tier 1 form first, before pulling anything from the Tier 2s, as the first field pulled into the report section will determine the Root Form. For more information on the Root Form, click here. What is in a Report Section?\n\nThe Report Builder will only show the first ten rows of data for any columns you have dragged in (or only data in the first group, if grouping is enabled). The rest of the data will appear when you publish and run your report, but for the building process it is limited to the first ten rows. The far left column is considered dominant data.Forms associated with the included data will be displayed under \"Forms.\"To adjust the properties for any column in your report, click the gear box in the upper right hand corner of the column. This will open the Column Properties window.Each column is automatically named after the field as it is listed on the form. To edit this, click into the text box and type in a new name for your column.Depending on the type of data in your column (such as text or numbers), you will have different options for Data Style and Display.Expand the black arrow next to Formatting to see cosmetic options for your column data.Expand the black arrow next to Form Info to display the name of the form, the section and the field.When you have made your selections, click \"Apply.\" If you have added this column by mistake, \"Delete\" will remove it from your report.Data Styles\nData Styles are available in the Report Builder to adjust the way data appears in a report. \nTo access the column properties, click the green gear box in the upper corner of your data column. The column properties window will open.Data Styles can vary depending on the type of data your column contains. For more information, please see the Help Center section on Column Properties. Filters can narrow the results of your report by focusing what data is being pulled from your forms. For example, you might want to add a filter showing only certain dates or certain answers that have been collected on a form.1. Global Values can be added by clicking the \"Add\" button at the top of the page.2. Filters can be added by clicking the plus sign to the right of \"Filters.\"Adjusting Filters\n\nAdding filters is a way to limit or select the data you would like to appear in the report. One common way to use filters is to select clients served during a certain date range. You can bring in all the clients that have been served and then filter out clients who were served outside the date range you need.To add a filter:1. Under \"Rule,\" choose the column you would like to filter.2. Depending on the data style of the column you have chosen, different filtering options will appear.3. Type into this text box to add the criteria you would like to filter.4. The options under the rule let you customize the filter. “Locked” is always selected as the default, which means the filter cannot be changed when a user runs the report. You can de-select this to allow users to edit or remove filters.5. When you are finished, click Apply. The filter window will close and show you the filtered results in the section of the report.Reports often need more than one section. To add a section to your report, go to the Report Actions palette on the right hand side and select “Add New Section.” It will appear underneath any current sections you have but can be dragged up the page to re-order the sections.“Delete Report” removed this report from the Report Center. Note: If you delete a report by mistake, you will need to contact Apricot Support to have it restored“Return to Report List” takes you back to the Report center where you can see the list of available reports. Copying a Report\n\n\"Copy Report\" allows you to copy your entire report into a new location. This can be handy if you have built one report, but find you need something similar to serve a different function. You can copy the report, adjust the sections or filters as needed, and save yourself some work.1. Click \"Copy Report\" in the right hand menu.2. You will have the option to select a Report Category.3. Name the new Report by typing into the text box.4. Click \"Create.\" You will be taken to your new report.When you are finished modifying a report or would like to see what it looks like when it has been run with all the data, verify it says All checks passed in the Requirements box, then click Publish in the right hand menu.Choose \"run.\"To add a filter, click the plus sign.To return to edit mode of the report, click Edit.To print, click Print Mode.To export, click the Export button.","title":"Reports: Building Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/1817515-reports-building-reports"}