{"content":"Apricot's linking function allows relationships to be established between records that would otherwise not have a connection. Please keep in mind that a single form should not contain more than 100 linking fields.Which Forms Should You Connect with a Link?Some of the forms in your Apricot automatically have a relationship. Tier 1 Forms are, by design, connected to the Tier 2 Records that live under them.Linking is a way to create or add a relationship between two Tier 1 Forms, a Tier 1 Form and an unrelated Tier 2 Form, or two unrelated Tier 2 Forms that would not otherwise have any connection to each other.Why Add a Link?Linking can be useful for connecting data points in your Apricot.In the example above, a Tier 1 form has been created that collects data on \"Donors\" as well as a separate Tier 1 form that collects data on \"Events.\" Maybe we want to start collecting information about which donors have come to which events. Right now, if these forms are not linked, there is not a way to connect any of the data collected in one of these Tier 1 forms with any of the data collected in the other. Without linking, maybe we would add a Tier 2 form under the Donor Profile form to track the different events they attended; or we would add a Tier 2 form under the Events form to collect the names of everyone who attended. That would require extra data entry and could increase the chance for data to be entered incorrectly or not get entered when it should.If we add a link between these two records, however, we can connect each Event record to the Donors who have attended. And likewise, we can look at a Donor Profile record to see a list of Events they attended. We could create a report with fields from both of these forms to compare the data that has been collected in either or both places.Until two Tier 1 forms (or any otherwise unrelated forms) are linked together, you cannot have fields from both of these forms in the same section of a report.Linking to Simplify WorkflowLinking can also be used to create an easier workflow between one form and another.  Sometimes link fields are used to open a window into a different part of the database where you can create new records or edit necessary information before continuing with other data entry.In the example above, a Client Case Notes record needs to be created after a Counseling Appointment record is created. By adding a link field at the bottom of the Counseling Appointment Form (and making it required in order for the record to save), we can prompt users to fill out both forms at the same time.And even though these Tier 2 forms are already related because they are both under the same Tier 1 form, by linking we can establish which Case Notes records were created alongside which Counseling records.Base Links\nIn this Client form, we are linking to \"Referrals\" and \"Classes.\" The form that is being linked from or where the link is being created is called the \"base form.\"The form that is being linked to is called the \"target form.\"Adding a Link to a FormTo add a link to a form, open the appropriate form in Form Designer, expand the \"Linking\" section in the \"Field Choices\" palette.Drag the link field into the section where you would like it to appear.This field must be configured before your form can be published and the changes can be made available to users.Configuring a Link FieldSelect which form you would like your current form to link to. This drop down menu will give you a list of all existing active forms in your Apricot.Choose how many records of this (base) form can be connected to how many records of the other (target) form. This will restrict how many links can be created between the two forms.If one event can be attended by many donors, select \"1\" in the first dropdown and \"Many\" in the second.If one event can be attended by one donor, select \"1\" in both.If many events can be attended by only one donor, select \"Many\" in the first and \"1\" in the second.If many events can be attended by many donors, select \"Many\" in both.3.  \"Number of Links Per Page\" restricts the number of links that will appear on the record. If you think there will be a lot of links and that the list may take up a lot of room, you can select a small number here. Users will be able to scroll through a link screen to see additional links.4. You can choose to include Associated Records and Descriptions on the record next to the linking field.5. When you are finished configuring the link field, select Apply. Then publish your form to commit your changes and allow users access.Configuring a Link Field on a Target FormWhen a link has been added to a base form (where it will be linking from), it also automatically appears on the target form that it will be linking to.To see the configuration details on the target form, open the form for editing in Form Designer and click the gear box on the link field. It will mostly likely be called \"Link Instructions\" until you edit the name.You cannot change the \"Linked To\" details, but you can select the number of links to show and if you want to show associated records.1. To connect this record to another with a link, click the Add button. This will open a search window showing all possible records.2. If you would like to filter your results, or if the record you wish to link is not visible on the first page, you may expand the black arrow to add a search field of your choice. You may then use this search field to filter the available records.3. Choose the record you would like to link. This will immediately create a link to that record. Note: Using the Link All button will link all of the records currently in your search. If Link All adds more links than the field allows (see Configuring a Link Field above) then none of the links will be saved with the record.4. Clicking the \"create new\" button will open a new, blank record to be filled out. When you create a new record through this link window, a link will be automatically created when you fill out and save the new record.After you have selected records to link and have saved your record, the links will appear as active links.Clicking the green text will take you to the linked record.Please note only the first five (5) quick view fields on a form will display on the linking field along with the Link Description if configured in the linking field properties.If a link has been added in error or needs to be removed, it can be deactivated or deleted.  You can deactivate links on a record, which will retain the history of that link existing. You can view deactivated links on a record by unchecking the box next to 'Hide Deactivated Links.'To do this, uncheck the box under \"Active\" and save the record.Deleting a link will permanently remove it from the record.  1. Uncheck the box \"Hide Deactivated Links.\" Your deactivated link will appear. If link was not deactivated, move on to step 2.2. Select the trashcan icon.3. Confirm your deletion.Once a link has been deactivated and/or deleted, it can be re-added if necessary.","title":"Linking","url":"https://apricot-articles.socialsolutions.com/en/articles/1817552-linking"}