{"content":"*DISCLAIMER*This article goes over how to add and manage users in Legacy Permissions, not Role Based Permissions. If you are currently utilizing Role Based Permissions then you would want to access this article.Your Apricot database has a limited number of user seats available. These users are split up into Standard and Administrator seats. What these user types entail is detailed at a later point in this article.Users who once had access but are no longer allowed to use the database are called \"Inactive\" users. The history of what records they created or edited will remain in the system even after they have been deactivated.Note: Administrators take both an Administrator seat and a Standard User seatNote: Some sites may have \"Guest\" as an option. This is because you have Guest User access enabled (a premium, add-on feature).If you believe you require more user seats, you can request them from your Account Manager at an additional cost.Adding a New UserTo add a new user, select the Administrator tab at the top of the page. On the left hand menu, select \"Access Control\"This will reveal several options. Click on \"Users,\" which will bring you to your users listNOTE: In the above screenshot, we've crossed out the \"Add Users/Tools\" button because this is not used in the process of adding users. This button will allow you to reach out to your Account Manager via email in order to purchase additional user seats. For the sake of this article, we'll assume you have sufficient user seats already.\nOnce on your user records list, you can add a new user by clicking the \"New Users\" button in the Search Actions palette.Enter the username for the new user. All usernames in Apricot are email addresses. When a new user is created, an email notification with login instructions will be sent to this email address. Enter a password for the new user. This password will be immediately encrypted and will appear as dots. It is generally a good idea to make this password something easy to remember. The new user will be able to change their password to something else after they have logged in for the first time.Enter the name of the new user. This name will appear on records when the new user creates or edits data in the database. Select \"User Type.\" Your Apricot SLA (Service License Agreement) determines how many Standard or Administrator users you may add or if you have access to add guest users.Standard users have access to log in and edit data in the Apricot database. Their access to certain forms, records and reports can be managed or limited by Administrators.Administrator users have the same access as Standard users, but in addition they also have access to the Administrator functions under the Administrator tab at the top of the page. Access for Administrator users cannot be edited or limited.Guest users have very limited access to Apricot. More information on guest users can be found in the Help Center section on Guest User Access.Inactive users are users who no longer need access to the Apricot database. They are not allowed to log in. In Apricot, users cannot be deleted from the system entirely - Apricot keeps a record of who added or edited data in the database even if the user is no longer active - but they can be made inactive instead.\n5. Check this box if you would like to require a user to update their password once logged in to the system. This can be useful, for example, when a user has forgotten their password and an Administrator has updated it manually.\nOnce the user logs in using their new password they will be directed automatically to the \"Change Password\" page and will have to enter a new password before they can proceed to use the system.When the user has updated their password, this box will also become unchecked within their profile and the User will be able to continue to log in with their updated password.\n6. Click \"Add\" to link the User to a permission set. More information on permission sets can be found in our article Limiting or Granting User Access7. Save. When this user information has been saved, an email notification will be sent to the user email address with instructions for logging in for the first time.**IMPORTANT NOTE**: The login link contained in the invite email will only be valid for 30 minutes. After 30 minutes the link will expire and the user can reset their password to set up their login using the Forgot Password option on the Apricot login page or have their Administrator reset their password following the steps in our User Lock Out article.*Please note that you should never create new users by saving over old user records. Old users should be marked inactive and new users should be created as new user records. This is because Apricot tracks historical information, such as who saved a record and when.Editing an Existing UserSelect the Administrator tab at the top of the pageOn the left hand menu, select \"Users\" under the \"Access Control\" categoryExpand the black arrow next to \"Add Search Field\"Select a field such as \"Name\" or name to enable searching.\nStart typing into the search field to narrow down the list of users.When you find the name you want, click the green text to enter their user record directly.In the \"User Details\" section, you can change the basic information about your user's recordYou can manually change a user's password here. It's important to note that this will not lift an account lock if the standard user has received the message \"too many failed log-in attempts.\" For assistance unlocking a locked user, see our User Lock-Out Article here.Deactivating a UserDeactivating a user is similar to deleting a user. Once a user has been deactivated, they can no longer log in to Apricot or access any part of your database, and they will no longer take up one of your user seats; however, certain details about them will remain in the system - information about what records they created or edited, for example, will still be recorded. Because Apricot keeps track of this kind of historical data, users cannot be completely deleted. If you have a special circumstance requiring a user to be completely deleted from the system, please email the Customer Care team for assistance.To deactivate a user, select the Administrator tab at the top of the pageOn the left hand menu, select \"Users\" under the \"Access Control\" categoryExpand the black arrow next to \"Add Search Field\"Select a field like name to enable searching.Start typing into the search field to narrow down the list of users.When you find the name you want, click the green text.\nUnder User Type, change the status to \"Inactive.\"Save record.NOTE: if the record you are attempting to deactivate belongs to an administrator, you may be prompted to add the user to a permission set before you can set it to inactive.\nYou'll need to set the user to \"standard,\" add them to at least one permission set, then set them to inactive in order to move forward. This user will be inactive, invalidating the permissions assigned to them, but Apricot requires that all user types other than Administrator have at least one assigned permission set (including inactive users).","title":"Adding and Managing Users - Legacy Permissions","url":"https://apricot-articles.socialsolutions.com/en/articles/1817614-adding-and-managing-users-legacy-permissions"}