{"content":"Adding an Email Trigger to a FormIn Form Designer, find the form you would like to add an email trigger to and open it for editing.Under the Field Choices palette on the right hand side, find the Email Trigger field and drag it into your form.The gear box will be gray, indicating that this field has been automatically set to be \"hidden\" from users.You will need to publish the form before your email trigger can be configured. After the form is published, you will be able to return to the edit side and adjust the field properties.To open the email trigger to configure the settings, open the Field Properties (green gear icon) in the upper right hand corner of the field.Now the name can be changed.By default the field is not visible to users when creating a record. If you deselect \"Hidden\" then the users can see the email trigger field. This can be used to check if the email trigger was sent successfully or failed. These tabs are where you will configure the email trigger.Under the first tab, \"Main,\" you can designate a \"Reply to\" address. When someone replies to an email from an email trigger, it will go to the email address entered here. In some cases, if you as an Administrator want to keep tabs on email activity within your Apricot you can use this field in combination with a private email account for monitoring.Add email addresses to the Recipients field. These are the people who will receive the email that gets sent out. Please note, it can pull addresses from email fields from the form (See number 8), as well as User emails from their user records (See number 7). When adding email addresses here, please use all lower case letters and separate by a commas with no spaces:You can designate a specific user by selecting \"Add User to Recipients.\" This pulls user information from the list of all available Apricot users. Note: this will not apply to Guest Users, their emails will need to be added manually. Under \"Fields,\" you can designate an email field to be added to the list of recipient addresses. This would only be useful if an email address were on the form and would be filled out in the record.Please note: Do not copy and paste text into the email body from another source, including another email trigger field. This could cause errors with the email trigger or fail to retrieve field data when emails go out.Under the Email Text tab, you can set up the message that will be sent out by the email trigger.Type in an email subject. Please be sure to enter a subject. Issues can arise causing the email trigger to fail if no subject line is entered. You can select \"Add Field to Subject,\" which will allow you to add a field from the form to the subject of your email. Here, you will see the field name in brackets, like [Text] above. But when the email is sent out, the value in the selected field is what will be sent out.In Body, type the main message you would like to appear in your email. You can format this message by text size, font, style, etc. You can also add HTML code by selecting \"Source\". The record's URL will be added to the end of the email body unless the \"Remove record link from email\" box is checked. The URL will be in plain text but the receiver's inbox may convert it to a hyperlink. You can also add a field from the form to the body of your email. This will, like in the Subject above, show the name of the field in brackets, but when the email is sent out it will contain the value from that field. You can also select from \"Add Field Set to Body.\" You can choose from all Searchable, all Quick View, all Duplicated, and all Required fields. You will also notice there is either a \"Label/Value\" or \"Inline\" option. Let's say you have a field called DOB and we have a record that has 01/05/2016 in it. If you choose \"Label/Value\" they will receive an email that has DOB - 01/05/2016 but if you choose just \"Inline\" they will see 01/05/2016Under the Filters tab, you can set up specific criteria to be met before an email trigger will be sent.Choose to send an email when \"A Record is Created\" and/or when \"A Record is Updated.\"Under \"And\" you can set additional conditions. Like when \"This Field is Changed.\" The dropdown menu will give you a list of the fields on the form. Please note, there is ONLY Conditional Filter Logic when multiple filters are used under \"And the Following Criteria Are Met\" section in the email trigger filter. If only one filter is applied, all 3 events would have to be true (Trigger Event, And This Field is Changed, And the Following Criteria Are Met), in order for the email to be sent.You can also add additional filters by clicking the \"+\" sign to the right of \"And the Following Criteria Are Met.\"When the Filter Properties window opens, you can select a field that has already been added to the Form and set the conditions for that field.You can add multiple filters in this section and adjust the requirements using Filter Logic. Filter Logic supports both 'and' and 'or' operators.When you are finished adding additional filter rules, click \"Apply\" to save your changes.Note: Once published, filters cannot be deleted. If you want to remove a filter, you can use a new email trigger field or set the filter to \"Select Field\" so \"New Filter\" is displayed.Under the Attachments tab, you can select which documents can be attached to an email trigger.You can attach documents that have either been uploaded onto the specific record that will send out the email trigger (via an attach doc field), or you can select documents that have been uploaded to your Apricot (via Shared Files.) An attach doc field will have to be added to your form and then published for the attach doc field to show up in the email trigger settings. In order to attach something from your Apricot Shared Files, Shared Files must already be uploaded to your Apricot when you configure your email trigger.Click Apply when you are finished setting up your email trigger. Then publish your form to make these changes available to your users when they enter data.You can add a default \"Reply-to\" email address to all emails sent from your Apricot by email triggers. This would allow recipients of those emails to click their email client's \"Reply\" option and it will go to that designated Reply-to email address. Note: If you do not set this as a default it will automatically go to no-reply@socialsolutions.com which is not a valid monitored email address and they will not get a reply. We will not be able to recover their email. Click on the Administrator tab.Choose Workflow Station then Apricot Settings from the Navigation Menu.Once you navigate to the General Configuration section enter in a desired email address into the Reply-to box.Click on Save Settings.Note: You can add a default Sent From contact in the field below Reply-to, but this setting will only work if you have a valid email address entered in the Reply-to field.Check out our Email Trigger Troubleshooting article for additional troubleshooting steps!Email is not a secure form of communication. Please take this into consideration when deciding what information to send via an email trigger field.System fields (Record ID, Created By, Creation Date, Modified By, Modification Date and Assigned Programs) cannot be used in email trigger filters.An email is only sent to recipients listed in the Main tab of the Email Trigger properties, if all the field's configured conditions are met. The trigger does not automatically send an email to the user who created or edited the record.We use a 3rd party integration to send emails through Apricot on your behalf called SendGrid (see below for additional details). Customer Support can check to see if an email was sent, but SendGrid only saves email logs for 7 calendar days so you must contact us within that time for us to check. We cannot provide direct access to SendGrid. You may need to inform your recipients that they might need to whitelist the following email address if the emails are going to their spam folder: no-reply@socialsolutions.comImports cannot be used to prompt an email trigger to send an email. Records must be manually created or updated in order to activate the email trigger.Email triggers cannot be used to send emails at a future time. They are triggered by an action and will only send upon creation/modification save.Images from Shared Files that are linked in the email body will not display in external email clients.If a record is filled out through Connect, attachments intended to be sent by email trigger will not send. ","title":"Email Trigger","url":"https://apricot-articles.socialsolutions.com/en/articles/1817592-email-trigger"}