{"content":"In Apricot, each field type has an assortment of properties that can be customized to better capture data. Properties control what kind of data is collected, how it is organized, and how it can be pulled into reports.While some fields have very specific properties that can be customized, what follows here is a list of the more commonly used properties available for most or all of the fields.Finding and Customizing Field PropertiesFields and their properties can only be customized after they have been added to a form.To open a field to access its properties, click the green gear icon in the upper right hand corner of the field.The title at the top of the properties window will always display what field type you are customizing in parentheses.The name of the field can be customized here. Each field must have a unique name. Your form will refuse to publish if any two fields have identical names, and it will notify you of this error in the Form Publish Checklist.Properties and special properties can be customized here.When you are finished, select \"Apply.\"RequiredMaking a field \"required\" means that your users will not be allowed to save a record until data has been put into this field.Required fields are identified by an asterisk * after their name.Duplicate Check1. Marking a field \"duplicate check\" prevents users from entering identical data in this field in more than one record. When a user enters information into this field, the system will check it against the data in this field in all existing records.This property is available for Tier 1 and Tier 2 records.Setting a field as duplicate check on a Tier 2 field will only check for duplicate data inside the Tier 1 form's document folder instead of checking across all Tier 1 records.The Duplicate Check on Tier 2 fields will be ignored when using Batch Record Creation, Copy Record, or Registration Grid.All \"Duplicate Check\" fields will automatically also become required fields.2. Fields with \"Duplicate Check\" applied will have a double apricot icon next to the field name.Quick ViewQuick View allows users to preview the data stored in this field when searching records.What Does a Quick View Field Do?The above example shows the Client Intake search page. Even without searching for a specific record, we can see the first 20 records in the search.Each column that appears here is a field that has been marked as \"Quick View\" in Form Designer. If you frequently search for a specific piece of data in a specific field, you can save time by making that field a Quick View.SearchableMarking a field as \"searchable\" allows users to search for records by the data collected in this field.What Does a Searchable Field Do?Searchable fields appear in the \"Add Search Field\" drop down menu in record search. Every field that has been made searchable will be available in this drop down menu. Add or remove fields from the \"Add Search Field\" drop down menu by changing that option in a field's properties.Entering partial data in a Search Field, even as little as one letter, will narrow down the search results that appear on the search page.HiddenHidden fields are not visible to the users when they fill out a record. They cannot be populated with new data by a user. Sometimes it can be useful to hide a field if you are not quite sure you want to deactivate it. Hiding calculation fields can keep a form neat and tidy by hiding from view any \"behind the scenes\" work that may take place on the form.Hidden fields are identified by a gray - rather than a green - gear icon.LockedLocked is the term used for a field that is \"read-only.\" Users can see any information in that field, but they cannot edit it or make changes.RestrictedRestricted fields are fields whose properties can be adjusted or customized *only* by Social Solutions staff. The ability to adjust a restricted field is not available even to Apricot site Administrators.Many of the more basic field properties are grayed-out and unavailable in a restricted field, although Quick View and Searchable properties can still be added or removed.Green text alerts the user that some properties in this field cannot be edited except by Social Solutions staff.If you would like to have this restriction removed from a field, please open a case in the Help Center to request this adjustment.Additional InformationThe Check Box, Multi Drop Down, Address Global Lookup, Address Lookup,  Append Only, Multi-Line, All Calculation Fields, Scheduler, Attach Doc, Image, Link, Label, Record Lock, Signature, and Email Trigger are not able to be duplicate checked.","title":"Standard Properties for Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/1817626-standard-properties-for-fields"}