{"content":"Activating \"allow other\" on a radio button or dropdown field allows users to type in their own answers that may be different from the options listed. What \"Allow Other\" Looks LikeWhen a user selects \"other\" on a field with \"allow other\" activated, a text box will appear. If you would like to make these limits smaller, they can be customized by typing a number into the Character Limit box.Important: Text fields are automatically limited to 200 characters; multi-line fields are automatically limited to 5,000 characters. Users will not receive a warning that they have reached the limit but it will automatically stop accepting new characters. When a form has been set up to allow copies, \"Clear on Copy\" wipes out the original value of the field when a record has been copied. Fields where \"Clear on Copy\" has not been marked will retain their value in the copy. All Duplicate Check fields and Append Only fields will automatically be designated as \"Clear on Copy.\" Label fields and System fields cannot be used with \"Clear on Copy.\"This allows an Administrator to pre-set the contents of a field with a specific, unchanging value. Every time a record is created, this field will be automatically populated with the default value.One way to hide your \"behind the scenes\" work on a form is to add a numeric field with a default value, adjust the properties to make it hidden, and use it in conjunction with a calculation field.The form will appear to automatically make a calculation for the user.Note: If you add a Default Value to a field after records have already been created any old records already in the system will not be automatically updated. Only new records moving forward will have this default value.Additional Note:  Leaving the default value blank in a numeric field will not leave the field blank and will default to the number 0. Defaults a designated date field to the current date when a new record is created.This property can be updated on existing forms, but existing records that were created before a default date was added will not be automatically updated to reflect it.This property does not automatically update the stored date value on subsequent record views after record creation. It will only default to the current date and store that date value on the date of creation. A specific field width dictates the amount of space, measured in pixels, the field can take up on the form.Adjusting field width can change the appearance of the form onscreen (including introducing scroll bars) and can change how much of a field's contents are visible when printing records. Hint allows an Administrator to provide guidance in what should be entered into a field.Whatever you add as the hint will appear in gray text in the field itself. Hints are not saved within the field (unlike a default value) so if a data entry user skips this field, it will save as an empty value This property requires that the value entered in the field meet or exceed the designated minimum value.If you enforce a Minimum Value, do not set it as a Required field, and the data entry user inputs a value lower than the minimum value, then they will not be able to save the record without the minimum value (or greater) in the field itself. However, if the field is not set to required and is left empty upon record creation, it will let the user save the record and will automatically input \"0\" for the value in the field. This property requires that the value entered into the field be the designated maximum value or less.It can be helpful to pair it with a \"Hint,\" because there is no other way to indicate to your users what the maximum value for a field might be. This property is used to provide additional information regarding the associated field.When a Tooltip is created for a field, a question mark icon will appear to the right of the field name.When hovering over the question mark icon with the mouse, the designated Tooltip will display in a popover box.If you click on the question mark the tooltip will go away (or not appear at all)PLEASE NOTE: Different Browsers will allow a different amount of characters in the tooltip. We suggest using a label field if it is more then 100 characters. This property enforces a maximum number of words that can be entered into a Multi-Line field.\"Max Allowed Words\" and \"Remaining\" text will display for fields with this property. The user will be allowed to continue entering words over the max, but will be prevented from saving the record until the number of words is at or below the word limit.","title":"Special Field Properties","url":"https://apricot-articles.socialsolutions.com/en/articles/1880987-special-field-properties"}