{"content":"Note: This article applies to Apricot's Legacy Permissions. If your organization is currently using our Role Based Permissions, click here to add Administrator tasks to Standard Users. When a standard user needs additional access to functions and features in Apricot that are usually reserved for administrator users, these can be granted through assigning Roles.Roles represent the different kinds of access and functions that standard users usually cannot use.In the example above, \"Manage Reports\" is one of the roles that can be granted to a Standard user. Usually, Standard users can run and view reports that have already been built, but only Administrators can build or edit reports. By granting this role to a Standard user, you can allow someone who is not a full Administrator to have access to the Report Builder feature, granting them the ability to create and edit reports. To add a role to a user, select the Administrator tab at the top of the page.On the left hand menu, select \"Users\" under Access Control.On the right hand side, select \"User Profiles.\"Expand the black arrow next to \"Add Search Field.\"Select a field like Username or Name to enable searching.Start typing into the search field to narrow down the list of users.When you find the name you want, click the text in the first column.Scroll down to the section called \"Assigned Roles\" and click the Add button.Select a gray arrow and expand to show the roles that are available.Click on the role you would like to add to this user.You will see the role listed under \"Links to be Added Upon Save.\"If you would like to remove a role at this point, click the X.If you would like to add more roles, click Add.When you are finished, save the record. To remove a role from a user who no longer needs it, open the user for editing and scroll down to the Assigned Roles section of the page. De-select the checkbox under the \"Active\" column.Save record. Manage Lookup Lists. A user with this role can access the Lookup Lists portion of the Administrator tab. They will be able to create new Categories and Lookup Lists as well as edit or delete existing ones.Manage Queries. A user with this role can access the Query Tool under the Administrator tab. They will be ale to create new Categories and Queries as well as edit or delete existing ones.Manage Standard Forms. A user with this role can access Form Designer under the Administrator tab. By default they will only be able to create a brand new Tier 1 form and then it's subsequent Tier 2 forms. If you would like them to have access to edit preexisting forms you will need to provide them access via their Permission Set (check the Edit check box for the forms you would like them to edit). Additionally, only those with the Manage Standard Forms role will be able to Edit the forms, regardless if Edit is checked off in their permission set. Lastly, they will need Edit access to the Tier 1 form if you want to give them access to any of the Tier 2 forms. Please note: If a standard user creates a new form, once publish they will need to given access to it via their permission sets.Manage Templates. A user with this role can access Form Templates and use them to create new forms. Manage Aggregate Reports. Note: Since Aggregate Reports may only be used by Administrator Users this Role should not appear in the list. However, it does but please note that it will not work.Manage Data Archives. A user with this role can export large amounts of data from the Apricot database through the Data Archives tool.Manage Reports. A user with this role can create and edit reports using the Report Builder tool. Please note, you must first create a Category for them to place reports into (they do not have access to create a new Category). They will only be able to create new reports by default. If you would like them to edit preexisting reports you will need to grant them Edit access via their permission set. Only those with the Manage Reports role will have access to edit, even if others are in the permission set with Edit checked. Note: You do not need this role for Standard Users to be able to edit reports. You can toggle individual reports in a User's permission set itself to be able to edit. Manage Automated Imports. Automated Imports are no longer supported, so this Role should be ignored.Imports. A user with this role has access to the Import Tool and can import (create new and update existing) data into your Apricot database. They can also import links.Manage Record Archives. A user with this role has access to the Record Archives. They can search for records that have been archived or removed from your Apricot database and, if necessary, re-activate or add them back into the system.Manage Record Audits. A user with this role can access the Record History tool. They can see which users have accessed or changed existing records. Manage Bulk Assignments. A user with this role will be able to assign records in bulk to one or more users. This role is only available if Record Level Access has been turned on.Manage User/Programs Profiles. A user with this role can add new users and edit details pertaining to existing users. They can also manage what those users can access within the database. Please note, if you have Program or User RLA enabled on your site  you will also have to Adjust Access to each user, program record, and permission set which they should have access to.Manage Account Information. A user with role can update the account information including billing information. Please note the Account Information page is only available to Essentials customers who purchased Apricot on-line.  Manage Apricot Settings. A user with this role can update select standard features are turned on or off within Apricot settings.\n-User Licenses: they can manage which Guest Forms are allowed\n-Security: they can manage all password related items and the system inactivity timeout\n-General Configuration: they can manage everything in this section (IP Allowlist (IP Whitelist))\n-Accessibility: they can manage everything in this section\n-Exchange Integration: they can manage everything in this section\n-Logo: they can remove or add a new logoManage Bulletins. A user with this role can create and edit the bulletins that show up on the My Apricot landing page. Please note, you must grant them access to a category via their permission set as they cannot create a new category. For preexisting bulletins you must give them Edit access via their permission set.Manage Calendars. A user with this role can add and configure the calendars that interact with the scheduler field.Manage Grants (AFF only). A user with this role can create new Application Intake Forms, Applicant Profile Forms, and Reviewer Profile Forms. To finish the process they may need an Administrators assistance. They may not edit existing grants in which they did not create. This is an extremely limited role.Manage Shared Files. A user with this role can upload and delete files in the Shared Files area of Apricot. If you have Program or User RLA enabled they will only be able to add a new category and shared files. Manage Connect. A user with this role can edit and manage Participant Types, Connect Settings, and Direct Messages. A User with this role will not be able to send Direct Messages that would exceed the monthly allotment.Manage Secure Web Forms. A user with this role can create a new secure web form. If you have Program or User RLA enabled they will not be able to edit existing secure web forms.Manage Grant Dashboard. A user with this role can access the grant dashboard and see where along the process an organization is and may be able to adjust their current grant phase.Can't edit Admin accountsCan access Apricot settings, but can't toggle Standard Features (Auto Search, Record Audit, User RLA, Secure Web Forms)Does not have automatic access to all forms/reports/records. Access still depends on what is granted in their permission setCan't merge foldersCan't build workflowsCan't build Intake forms","title":"Granting Administrative Functions","url":"https://apricot-articles.socialsolutions.com/en/articles/1880214-granting-administrative-functions"}