{"content":"Report form properties are available after forms have been pulled into a report.The first form pulled in is called the root form. A best practice is to always pull in a Tier 1 form first so it will always be the root form. The root form establishes a foundation for how data is pulled from your database.1. To access the properties associated with the root form, click the name of the report under \"Forms\" at the top of your report section.2. In the window that pops up, you can select [highlight] to show which columns in your report section have been taken from the root form. A green border will appear around those columns.3. You may choose to enforce or not enforce Record Level Access or User Level Access for your report. These are restricted by default, which means that if you have users who have not been given access to certain forms or certain kinds of data in your database, they will also be restricted in what they can see when they run reports.4. When you have finished adjusting these properties, click \"Apply.\" Note: Each report section has a limit of 256 columns that can be pulled in.\"Connected Form\" is the term used for a form that has been pulled into a report after the root form has been established.1. To access the form properties, click on the name of the connected form under the root form.2. Clicking [highlight] will add a green border around the fields in your report section that come from this connected form.3. Under \"Required,\" you can choose \"Always,\" \"Sometimes\" and \"Never.\"Always – [Root form] records will only be included if they have at least one [selected connected form] record.Sometimes – [Root form] records will be included whether or not they have a [selected connected form] record.Never – [Root form] records will only be included if they do not have a [selected connected form] record at all.4. Limit: The Limit property establishes which records of the selected Connected Form will show.None – All [selected Connected Form] records will be included.Last Created – Only the most recently created [selected connected form] record will be included.First Created – Only the earliest created [selected connected form] record will be included.5. You may choose to enforce or not enforce Record Level Access or User Level Access for your report. These are restricted by default, which means that if you have users who have not been given access to certain forms or certain kinds of data in your database, their access will also be restricted in what they can see when they run reports.6. When you have finished adjusting these properties, click \"Apply.\" 1. To access the report section properties, click the green gear in the upper right of the report section.2. The name of your section can be adjusted here. The section name has an 80 character limit.3. Display style lets you customize what your report will show and how it will display the data.- Hidden: Hides the section. Useful if you are feeding the results of one section into a summary section.- Graph Only: Displays the graph without the accompanying rows of data.- Totals: Gives totals only, without accompanying rows of data.- Rows: Shows the rows of data that make up your report data - this is the default setting in Report Builder. -Vertical: Shows data stacked on top of each other rather than side-to-side. 1. Count:-\"Total rows\" will count and show all the rows of data.- \"[Specific Form]\" counts: choosing a primary form here will limit the number of records counted in your report. If, for example, we were to choose \"Breakfast Program Records,\" our report could show data from the \"School Program - Intake Records,\" like client names, but the Section count would only include the rows from the Breakfast Program records.2. Show Graph: Turns the graph feature on and off. For more information on creating graphs, please see the Help Center section on Graphs.3. Show Outcomes: Turns the outcomes feature on and off. For more information on adding outcomes to your report, please see the Help Center section on Outcomes.1. Show Percentages: Shows percentage of the whole represented by a drill-down group.2. Auto Run (Edit Mode): When dealing with a large data set that might take a long time to load, you can turn Auto Run off, which will allow you to build a report without waiting for the data to load.3. Auto Run (Run Mode): Allows you to toggle the data re-loading if the data is changed while in Run Mode.4. When you have finished adjusting the report section properties, click apply.To run a report that shows certain sections collapsed by default, follow these steps for each desired section:Open the section properties.Toggle \"Auto Run (Run Mode)\" to No.Apply the changes.Manually collapse the section by clicking on the arrow icon to the right of the section title.Publish and run the report.","title":"Section Properties in Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/1881656-section-properties-in-reports"}