{"content":"Finding a Report to Run:1. Click the \"My Apricot\" tab2. On the left hand palette, click \"My Reports.\"3. Expand the black arrow next to the report category to view the reports in that category.4. Hover your mouse over the Actions arrow of the report you wish to run.5. Choose \"Run.\" A tour of the \"Run\" Version of the report:1. Name of the report.2. Global Values. This is a space for values that can be applied to multiple sections of a report.3. A report section. A report may have many sections, each identifying a different data set.4. Forms. This lists the names of the form or forms that have been used to create the report.5. Filters. Filters can narrow down the applicable data being pulled from the database. 6. Columns of data. Each column usually represents a specific field in a form and the data that has been collected in that field.\n 1. If \"Auto run\" has been turned off, this text will appear in your section. Click the \"click here\" to load your data.2. A report can be designed with Global Values and filters \"locked or unlocked.\" If unlocked, Global Values and filters can be edited from the run view of a report to personalize, adjust results, and clarify findings. To edit Global Values, click into the text boxes.3. To edit a filter, click the pencil icon (only visible if the filter is not locked).4. To add a filter, click the plus sign.5. Users with access to edit a report will see an Edit button displayed in the Form Actions palette on the right. Click to edit the report.6. To export, click the Export button. When you click \"export,\" your report will download as an Excel spreadsheet per browser protocols.In your exported spreadsheet, graph-only sections will not have a tab, as there is no exportable data available.If Outcomes and Goals have been utilized in the report, there will be an additional tab in the exported spreadsheet reflecting that data.  For more information on how to build reports in Apricot, please see the Help Center article on building reports here.","title":"Running Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/1881948-running-reports"}