{"content":"Open the form you want to edit in Form Designer.In the field choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your form.All fields are displayed in the All section, in alphabetical order. Or, you can look at fields by category. This document will discuss fields found in the Demographic category.This field displays as two text boxes for a physical address.The first line is standard for the number and street name while the second line is used for the apartment or unit number.Character limit: 200.This field can be made required, searchable, hidden, and locked. It can be used in Quick View and as Duplicate Check.The Address Lookup field permits the user to enter part of an address to see a search return of possible matches. The selection of the correct match will fill in the remainder of the address lookup fields with correct information and display a map of the area.Required Subfields:In the Required Subfields section, you can require only parts of the Address Lookup field instead of requiring the whole field to be filled out (i.e. Address Line 1, Address Line 2, City, etc.). Special Properties:Show Neighborhood: Will show the neighborhood associated with the address entered.Show Country: Will show the country where the address is located.Show Coordinates: Will show longitude and latitude coordinates.Map Options:Default Zoom Level: By increasing the zoom level, you can have the map highlight a very small localized area.Hide Map: Hides the map feature.This field can be made required, searchable, and hidden. It can be used in Quick View.Note for Quick View:When the Address Lookup field is set to be a Quick View it will only show data as Quick View data if all of the following data points are filled in:Line 1CityStateCountyZipWe advise to click on the suggested address to be clicked as well to map on it. If all of the above criteria is met then only Line 1 of the Address Lookup field will be displayed in the Quick View area. However, if the data was mapped you could then click on the house symbol and another pop-up will display showing the entire address (without going into the record).When you begin typing into an address lookup field, the software will provide you with valid addresses based on what you have entered.You can select a red line of text to fill in the remaining address fields. If there are no matches for your address, manually type the address. Select the Clear button to clear the fields and start over.Once you have finished entering an address, a map of your location will appear. You can turn off the map feature by selecting \"Hide Map\" in the field properties. The address global lookup field permits the user to enter part of an address to see a search return of possible matches. The selection of the correct match will fill in the remainder of the address global lookup fields with correct information while displaying a map of the area.The address global lookup search has already been configured to look across all international addresses with matching criteria to provide a set of result options.Required Subfields:In the Required Subfields section, you can require only parts of the Address Global Lookup field instead of requiring the whole field to be filled out (i.e. Address, Postal Code, Country). Special Properties:Show Neighborhood: Will show the neighborhood associated with the address entered.Show Country: Will show the country where the address is located.Show Coordinates: Will show longitude and latitude coordinates.Map Options:Default Zoom Level: By increasing the zoom level, you can have the map highlight a very small localized area.Hide Map: Hides the map feature.This field can be made Required, Searchable, and Hidden. It can be used in Quick View. This field displays as three different text boxes: one each for first name, middle name and last name. Each of these values is stored separately and will appear in individual columns when this data is pulled into a report.\n\nYou cannot hide or remove the middle name field on a form, however, even when the Name is a required field, the middle name will not be required. When designing reports, the middle name can be omitted. Display Style:You can specify which part of the name to display first, the first name or the last name.This field can be made required, searchable, hidden, and locked. It can be used in Quick View and as Duplicate Check. This field can be set to either US format (four separate text boxes with one for the 3-digit area code, two for the 7-digit phone number, and one for an extension, if applicable) or UK format (single text box). Only numeric values can be entered in this field. If an extension number is entered, the value will be stored as x123 when printing or reporting.This field can be made Required, Searchable, Hidden, and Locked. It can be used in Quick View and as Duplicate Check. This field is made up of three separate text boxes that hold three, two, and four numbers indicating an individual's US Social Security Number.It can be made required, searchable, hidden, and locked. It can be used in Quick View and as Duplicate Check. This field provides a drop down menu that displays the names of every state for selection. No further entry is allowed.It is best to choose this field if you pair it with the standard address field. If you use the address lookup or address global lookup, the state field will automatically be filled in and adding a separate state field will be unnecessary.Special Properties:Default Value: If most of your data entry will require the same value in the state field, you can set the default to show a particular state. You can enter either the abbreviation or the entire state name. This field can be made required, hidden, searchable, and locked. It can be used in Quick View and as Duplicate Check. This field is displayed as two separate text boxes. The first box holds the basic five-digit zip code number. The second box is for the additional four-digit postal code, which is optional.If this field is made \"Required,\" only the first text box must be populated. This field will display with a dash between the first five digits and the four digit postal code (i.e. 78701-1234). If only the first five digits are entered, the dash will not display when printed or reported on.It is best to choose this field if you pair it with the standard address field. If you use the address lookup, the zip code field will automatically be filled in and adding a separate field will be unnecessary.This field can be made required, hidden, searchable, and locked. It can be used in Quick View and as Duplicate Check.","title":"Demographic Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/1882120-demographic-fields"}