{"content":"To get to the Data Archives there are two steps we need to complete. First, click on the \"Administrator\" tab at the top of your ApricotNext, click on \"Data Archives\", located in the Navigation Menu. Now we will go over the different portions of the Data Archives:Form(s) to Export: this dropdown menu will show you every available Tier 1 and Tier 2 form that you can export. You can only export one form at a time.Modification Date (optional): this radio button defaults to \"All.\" You can adjust it to different date filters which would export data based on the Modification Date system field. Note:  If the record was only created and never modified the Creation Date and Modification Date are the same.File Format: this radio button defaults to \".XLXS\" and can be changed to a different format. Please note, XLXS can store more data than XLS and is a Microsoft Excel file format. You may also choose to export as a CSV file which stores data in plain text and can be opened by Excel and other compatible programs.Export Your Database: this button will export the data based on your selections in numbers 3 through 5. Depending on how much data is in your system this may take some time.Data Archives do not export the linking relationship of linking fields (Record ID to Record ID). You will need to build a report for each linking field on a form to retrieve the related record and the Record ID.Data Archives do not export the linking relationship of dynamic fields (Record ID to Record ID). You will need to build a report for each linking field on a form to retrieve the related record and the Record ID.Data Archives do not export most System Fields (like Created By or Creation Date). The only System Field that it exports is the Record ID as \"id\".Data Archives do not export data stored in inactive fields.Data Archives do not export Append Only fields.Data Archives do export the text values found in dynamic dropdowns.Data Archives do export the \"Parent ID\" of all Tier 2 records. For example, Suzy Smith has a Tier 1 Record ID of 256. We export all Service records for Suzy Smith. The \"Parent ID\" for all Service Records is 256.If the number of records in the date range for Modification Date is too large, the page may freeze and not download the spreadsheet. If this occurs, reduce the date range and try again. If you are still unable to export, contact Apricot Support, as they can assist with retrieving the data.","title":"Data Archives","url":"https://apricot-articles.socialsolutions.com/en/articles/1885121-data-archives"}