{"content":"*NOTE* It's recommended that you have an understanding of using queries before attempting to use Dynamic Dropdown fields.In the example above, the fields labeled \"Service Category\" and \"Service Provided\" are considered dynamic dropdown menus.1. Depending on what you select in the \"Service Category\" menu,2. The options available in the \"Service Provided\" field will change. If you select change the selection under \"Service Category\" from Community Education to Women's Shelter, the options that show up under \"Service\" will change to match the new Service Category selection.Note: When a user fills out a record, in most cases the standard dropdown fields look similar or the same as the dynamic dropdown fields. An Administrator can see the differences, but only when they are editing a form's design.On the same form design page, if we attempted to change the options in a dynamic dropdown field, this is what we would see.At the top of the field properties window, it will be labeled as a \"dynamic dropdown.\"Instead of rows for our options, it will display the name of a different form instead (in this case: Category).To change options in a dynamic dropdown field, click the My Apricot tab.Click \"Hidden Records\" in the left hand menu.Select Category.Dynamic options live here under the Category form.Expand the black arrow next to \"Add Search Field\" and add \"Category\" and \"Option.\" These are the two dynamic fields that appear on the Services form.If you are interested in changing some of the options available in a specific category, you can type that into the search bar to narrow down the search results.Expand the gray arrow to view the available options. You may need to review the options that are already entered into the system before making changes.If you need to edit an existing option (the service category has a new name, it has been spelled wrong, you would like your user's to refer to it in a new way, etc.), you will need to mark the existing service category \"Inactive\", and create a brand new one. This will ensure that your prior records remain linked correctly.If you would like to add a new option under the category you have selected, click the gray text.Choose the category folder (Tier 1) that you want to use for your service optionClick on the page icon with a \"+\" sign on it.Type your new option into the text box.Select Save Record.Now your new option will be available in the dynamic field.You can also remove options from the dropdown menu. To do this, follow the steps to find the category that contains the options you want to edit.Instead of creating a new option, click on the circle with a \"+\" sign to display your options. A \"-\" sign will appear in the circle.Click on the option you would like to remove from the dropdown menu.Check the checkbox for InactiveSave Record","title":"AVS: Changing Available Options in Dynamic Dropdown Menus","url":"https://apricot-articles.socialsolutions.com/en/articles/1885483-avs-changing-available-options-in-dynamic-dropdown-menus"}