{"content":"Unlike traditional report columns, which must be pulled from a list of fields that have been added to forms, summary columns allow you to pull summaries from one section of a report to another.Summary columns can pull section counts or column totals from one section of a report into another. They cannot be used to display data that is in the same section of the report as the summary column. An easy way to use a summary column is to keep them in their own separate report section.From the right hand menu, select Add New Section.In the upper right hand corner of the Report Builder, expand the gray arrow next to \"Special Columns\" under \"Field Choices\"Expand the black arrow next to \"Summary Columns.\" You will be presented with the options \"Section Summary\" and \"Section Count\", continue reading to understand what each option represents. The section summary column takes the value from any column in a report that has been set to display a summary value and brings it into its own column. In this example, we will add a summary to capture the average age from our \"Client List\" report section. We will start by pulling Date of Birth into our \"Client List\" sectionOpening the column propertiesThen selecting the display style \"Age\"After changing the display style, we are greeted with a message indicating that the Data Style has changed and we should click here to refresh the page to see our new optionsAfter refreshing the page we will see the list of options in the screenshot below. In our example, we want \"Average (no zeroes)\". We are picking this option in case we have any client records missing a date of birth, we don't want those to throw off our average!Important: Selecting the summary in the above screenshot is the key piece to carrying over this summary onto a summary column. This is the \"Summary\" that the feature is referring to.Now that we've selected a Summary option, we can reference this summary in our Summary Section:To access the properties, select the gear box in the upper right hand corner of the summary column.Choose a section. Only sections that have been configured to include a column with a summary enabled will appear here.Choose a column. Only columns with summaries enabled will appear here.We recommend also changing the name so that it is clear which summary this representsWhen you have finished configuring your column, select Apply.Now we can see that the average age that we've captured in our \"Client List\" section has been carried over to our Summary column:Summaries carried over into a section like this can also be graphed. Please read more details about this in our article on graphs, here.The section count column takes the value of the \"total rows\" from one section and brings it into another section. In the example below, the total rows in the report section for \"Clients Served\" has been brought to its own section by the section count summary column. This can be useful to highlight a particular data point and/or to allow us to use that count in more complex mathematical functions.To access the properties, select the gear box in the upper right hand corner of the summary column.Choose the section of data by expanding the black arrow. All sections in the report will appear here.Limited data styles and summary options are available for calculation columns.When you have finished configuring your column, select Apply.Summary Column Notes:In order to prevent circular logic, sections containing summary columns cannot be referenced by other sections' summary columns","title":"Summary Columns","url":"https://apricot-articles.socialsolutions.com/en/articles/1885469-summary-columns"}