{"content":"Please take a look at the above example of an outcomes report. Towards the center of the screenshot we see an \"Outcome\" area which lists different outcome statements or goals. Below that we see our report results, which will be familiar to anyone who has worked with the standard Apricot report builder, except in this example we can also see a graphical or text value to measure progress toward each outcome. The purpose of this article will be to cover how to build an outcomes report, like the one in our screenshot. To start building an outcomes report we will first need to enable the outcomes tool.Click the gear for the sectionChoose \"Yes\" in the Show Outcomes areaChoose ApplyIn our example we will be working with donations. We want to show outcomes for a lot of different things and that will require us to have 2 sections. As you can see in the above screenshot we have a fairly simple report. The top section shows results for individuals (you can see that we have grouped the report by the \"Client Name\" column to achieve this) and then we have an overall donation section at the bottom. The \"All Donation Outcomes\" section is using Summary Columns to pull information from the section above, \"Individual Donation Outcomes\". You'll also notice that each section has a box that says \"Outcome\" and it is empty except for the words Description and Goals. This is where we will establish our outcomes (our targets or goals that we wish to track progress toward).To see some configuration options for the outcomes click the gear for the Outcome area. Configuration options include:Description: This is where you can write a description of the overall goal of all included outcomes (there can be more than one goal/outcome)Goals: Click the \"+\" button to add an outcomeHighlighted here is what appears after you click the \"+\" sign.Name: this is where you will name the goalDisplay Style: you can choose either a graphical outcome or a text valueDescription: you may add a description for the specific goalEquation: this is where you will select the column for which you will be setting a goal, the qualifier (for example, 'Greater Than'), and finally the Target (50, for example)In the screenshot above you can see that we are setting up 3 different outcomes for each individual. Remember, this is per individual because we used a Text Calculation column to combine First and Last Name and grouped by that column. In the popup box toward the center of the screenshot is where we configure the outcomes, to the left is where the report lists each outcome's description, title, and criteria. To the right of the pop up are the actual outcomes, and current progress for each client. We have highlighted each outcome in the popup with the corresponding description and outcomes in the same color. These are just examples, your outcomes may be different. Note: Outcomes will need to be based off of numbers, please take this into consideration when building your forms (masked fields will allow data entry users to select text values while the database will store the numerical values, for example).You may want to get an overall outlook on progress towards a goal instead of focusing on individual progress. This can be done in the same report with an additional summary section that pulls the \"totals\" from another section(s). You can see the end result in our screenshot above. To get the above results we will need to use some of our Special Columns, Section Summary and/or Section Count, found in the Summary Columns category within the Field Choices palette. Both of these will pull information from other sections within your report. Please review the article on Summary Columns and keep the following hints/tips in mind:Section Count: this will pull the count of the groups from a report section. In our example we have combined Client First/Last Name and we're grouping by that. Each group only has \"1\" client record, we want to add up all of those \"1\" values, and this is where the section count will do that, in our example, the total is \"3.\"Section Summary: this will pull information from the \"Summaries\" of specific columns. For example, our Amount Donated has a \"Total\" summary applied. This will add up all of the values for each client within a specified column, and will display the overall total for us.Note: Because outcomes need to look at summaries it's important that we select \"Value\" within the column properties for each of the columns in our Summary sectionLet's look at how we would set both of the above examples:\n\nSection Count (Total Donators)\nSection Summary (Total Donation Amounts)\nFinishing the Setup\nAfter configuring the summary columns, the outcomes must be configured. The Outcome Properties window displayed below is an example of a completed outcomes configuration.","title":"Outcomes","url":"https://apricot-articles.socialsolutions.com/en/articles/1885225-outcomes"}