{"content":"Apricot's Calendar tool, which has always been compatible with Gmail and Google Calendar, is now able to integrate with an Exchange server to work with Microsoft Outlook. With the Calendar tool, you will be able to view Outlook calendars' availability from Apricot as well as add Outlook appointments when filling out and saving records.1. To double check whether or not you have the Exchange Calendar integration activated in your Apricot go to the Administrator tab.2. In the main site menu (left hand menu), click into 'Apricot Settings' which is found under 'Workflow Station'.3. Scroll to the 'A La Carte Features' section and make sure \"Integrated Exchange Calendars\" is marked as enabled, and not disabled.If you do not have the Calendar Integration for either Gmail accounts or Microsoft Office Suite you can contact your Account Manager for more information.If you do not know who your Account Manager is, or are not sure how to reach them, you can reach out to Customer Support for more information.The picture below shows the Scheduler Field on a record. The Scheduler Field integrates with the Calendar Tool to create appointments and send invitations.An administrator can select which integrated calendars to show on each Scheduler Field.1. When filling out a record with a Scheduler Field your users create the date and a time for any upcoming appointments.2. Users can view the availability for the selected Outlook and/or Google calendars by selecting the \"[Check Availability]\" button underneath the available calendars.- Other resources associated with an exchange server can be included as well.3. Email addresses not associated with an Outlook and/or Gmail account synced with Apricot can be added in the 'Other Attendees' text box.- When the record is saved a calendar invitation will be sent to each of the accounts that are listed.When using the scheduler field on a record, you can also click the name of the calendar so that you can view an entire month of 'free' or 'busy' availability.1. To view any calendar that has been added to Apricot, click on 'My Calendars' in the main site menu under 'My Apricot Tools'.2. Select the name of the calendar you would like to preview or review.3. The calendar will show marked busy time and tentative appointments that have been sent but not yet accepted, allowing you to understand when the calendar is open for new appointments.Your Outlook account will need to communicate with Apricot via a 'Service Account'. A service account can be any email account associated with your organization's Outlook and Microsoft Suite set up. The service account will need to have access to \"free/busy\" information on each of the calendars you want to add to Apricot.To connect a service account to your Apricot you will need the following information:- An email address associated with the service account.- The password for the service account's selected email account.- The server name associated with the service account.1. To find the server name; click the up arrow in the bottom right corner of your desktop which will display icons for each program that is running.- If the Outlook envelope icon does not appear, open Outlook and try again.2. Hold the Control key on your keyboard and right click (secondary click) on the Outlook icon.1. When the Outlook 'Connection Status' box pops up you need to find the column \"Server Name\".2. Locate the email address associated with the service account in your Apricot site and copy down the server's name that is connected to it. You only need to copy the actual server name, not any of the extra information surrounding it. For example, if your server name reads \"https://outlook.office365.com/mapi/nspi/?MailboxId......\" then you will only need \"outlook.office365.com\".The Outlook Service account will need access to the \"free/busy\" information for any calendar that you plan to add to your Apricot site. You can instruct a user to go into their Outlook calendar and set up their default permissions so that Apricot is allowed this level of access.1. Open your Outlook Calendar and go to your 'Calendar Permissions' menu, found in the Toolbar Ribbon.2. Select a permission.3. Set the permission level to \"Free/Busy time\".4. Click apply.1. To connect Apricot to the Exchange service account go into the Administrator tab.2. In the main site menu, select 'Apricot Settings' under 'Workflow Station'.3. Scroll down to the 'Exchange Integration' section.4. Fill in the required information to open access to your Exchange Server.5. Click 'Save Settings' in the open page menu (right hand menu).Once an Apricot site has been connected to your Exchange server you can add a calendar for any Apricot user. There are two ways to do this:- As an Administrator; you can add a calendar for yourself or any other user on the 'Calendars' page from the main site menu. Only an Administrator can add more than one calendar into your Apricot site.- you can also access the User Preferences page from the User Badge menu (located in the very top right where your name appears) to add a calendar for a specific user.(Below are the steps and pictures corresponding to the first option of adding a calendar from the Calendars page in your Apricot site. Below that are the steps and pictures to the second option of adding a calendar from the User Preferences page.)*1. To add a calendar on the Calendars page, click into the Administrator tab.2. In the main site menu, select 'Calendars' under 'Workflow Station'.3. Select 'Create New Calendar' from the open page menu.1. Under 'Calendar Type', select \"Microsoft Exchange Calendar\".2. Under 'Calendar Owner', select the name of a user.*(Each calendar must be associated with one of your Apricot users.)*3. Create a display name for the calendar being added.4. Enter the email address associated with the calendar.5. Save calendar.An Administrator can also add a calendar for any user by accessing that user's User Preferences page. Additionally, a user can add their own calendar by accessing their own User Preferences page from their User Badge menu in the top right corner.1. To access User Preferences, simply click on the User Badge in the upper right hand corner of Apricot (where your name and profile picture are).2. An Administrator can access User Preferences for a user other than themselves by changing the name in the User View drop down menu.3. Select the 'User Preferences' button after switching to the view of the user you would like to add a calendar for.1. Under the 'Calendars' section add the email address associated with the calendar you would like to add to your Apricot site.2. Add a calendar name.3. Save the User Preferences.Once your calendars have been added to your Apricot site, any Administrator can set up the Scheduler Field to find the calendar's availability. A Scheduler Field must be added to an existing form in Apricot. Open a form for editing in the Form Designer and drag in the Scheduler field. Below are the steps and pictures to assist you through adjusting the Scheduler Field.1. Click the Properties green gear box.2. Set up any standard properties you want.3. Special Properties for the Scheduler Field include:- 'Allow Other Attendees': This will allow a user to add email addresses not fully associated with your Apricot site to the scheduler field. The field will not be able to check the availability of the calendars added here, but it will still send appointment invitations to these email addresses.- 'Allow Location': This is a text box that appears on the Scheduler Field where a user can type in the location for meetings or appointments being set up.- 'Allow Details': This is a text box that appears on the Scheduler Field where a user can type in details or notes about the meeting or appointment.4. Set up time format (the choices are 24 hour time or 12 hour time).5. In the 'Manage Exchange Groups' dropdown menu, select the program(s) of calendars you would like to add to the Scheduler Field. When you want to add a program, click the '[+]' sign to the right of the drop down menu. Selecting a program will display all calendars associated with the users within this program.6. In the 'Manage Exchange Resources' dropdown menu, select \"Resources\". These are usually rooms that have been added to the Outlook Exchange server. They do not need to be pulled into your Apricot site individually in order to show up on the Scheduler Field. When you want to add a Resource, click the '[+]' sign to the right of the drop down menu.7. When you have finished setting up the properties to your specifications, select 'Apply' and then publish the form to push these changes to your site's users.There are three ways to deactivate a calendar that has been previously added and/or used in your Apricot site.1. Deactivate the user associated with the calendar. When a user is \"inactive\" in Apricot, their calendar will no longer be available in your Apricot site.2. Deactivate a calendar on the User Preferences page.3. Deactivate a calendar from the Calendars page.*You can also edit preferences and permissions within Outlook to block access to Apricot.","title":"Calendar Integration with Exchange (Outlook)","url":"https://apricot-articles.socialsolutions.com/en/articles/1885273-calendar-integration-with-exchange-outlook"}