{"content":"Apricot records capture and store all your essential data.Tier 1: These records are the top most level. They are much like the piece of paper on a manila folder for a client. Generally, these records track data that doesn't change and the data that you don't need a historical trace of; for example, demographic information (name, date of birth, street address).Tier 2: These records live under the Tier 1. They are much like the pieces of paper which go inside the manila folder for the client. Generally, these records track data that may change over time. For example, you need to track all services provided and the dates of those services so you may have multiple records that track this information.1. Select the My Apricot tab.2. Select the form you would like to enter data into.3. When the search screen opens, search for the record you would like to edit.4. Or select \"New [Form Name]\" in the right hand menu to open a blank record.1. Here is a blank record ready to be filled out with information.2. The * next to a data field means that this field is required. Apricot will not allow you to save the record until all the requirements have been met.The double-square icon means the field is considered a \"duplicate check.\" This means the database will check the information entered here against the information that has already been entered to make sure you are not creating duplicate or identical records. This can be useful for checking names against other client names already in the system. Note: If you have multiple duplicate check fields, then all duplicate check fields must match. For example, if both the Name and the Date of Birth field have duplicate check, then both fields must match exactly against another record to trigger the duplicate warning (not pictured).3. The Record Save Checklist keeps track of the required fields that still must be filled out before the record can be saved.4. When all the requirements have been met, you can save the record. 1. Once a record has been saved, you can select \"Continue\" to remain on the same page.2. \"View Folder\" takes you to the Document Folder for this client.3. \"Go to Search\" takes you back to the Search screen for this form.","title":"Filling Out a Record","url":"https://apricot-articles.socialsolutions.com/en/articles/1885253-filling-out-a-record"}