{"content":"Start at the \"My Apricot\" tab.On the left hand menu, click \"My Reports.\"Expand the black arrow next to the report category you would like to see.Hover your mouse over the Actions arrow.Choose \"Export\"Please note that if you export any report without running it first, by selecting \"Export\" from this menu, it will export based off of the default filter values found in the report which can be viewed in Edit mode as an Administrator. 1. Start at the \"My Apricot\" tab.\n2. On the left hand menu, click \"My Reports.\"\n3. Expand the black arrow next to the report category you would like to see.\n4. Hover your mouse over the Actions arrow.\n5. Choose \"Run\"1. From the Report view once it has been run, choose \"Export\" in the \"Report Actions\" pane on the right.The report will export with the results based on the filters. Please ensure you update any and all needed filters before you export. Choose to export all sections of the report or one specific sectionChoose your file format (XLS is for versions of Microsoft Excel before 2007, and XLSX is for versions after 2007)When you have made your selections, click Export. A document will be downloaded via your Internet browser. If you choose to export one section, you will be able to select which section from a drop down menu..CSV file export is only available when you have selected one section to export. If you have a large report that you have had trouble exporting, exporting it one section at a time may improve your results.Note: If you export a report with this method the report will export based off of the default filter values found in the report. This can be seen in Edit mode as an Administrator. Data Style Checking provides an extra method of processing your reported data to ensure that Excel correctly reads information such as date columns as \"dates\" and not as \"general.\" Enable Checking Data Styles when you plan to further filter your report in Excel based on information in date or number columns. Disable Checking Data Styles when you have a large report that will not otherwise export.Notes:Exported reports with sections that have Show Percentages enabled will ignore any grouped percentages and only show the smallest grouping's percent.There is no hard cutoff for the expected number of rows that can be exported from a report, as there are a huge number of factors at play when doing so. It's possible that a report containing only a few columns may be able to export 100k rows, but other reports with more complex data structures may only be able to export 10k rows.","title":"Exporting Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/1885314-exporting-reports"}