{"content":"The section count is found in the bottom right corner of a report section. It represents the total rows within the section or the distinct record count for a particular form. By default, it counts the \"Total Rows\" which might be a duplicated number of results depending on how the report was built. Adjusting What is Counted in a Report SectionYou can customize which records are counted in a report section.Open the green gear box at the top right corner of your report section to access the Section Properties window.Under \"Count,\" you can adjust which records are counted to come up in place of \"Total Rows\" at the bottom of your report section. You will see an option here for each form you have pulled into a report. Total Rows is the default setting. It counts all the results included in your report section. If your report contains both Tier 1 and Tier 2 records, Total Rows will show the count of all the Tier 1/Tier 2 combinations possible by default. Your other options will depend on what forms you are using in your report and your reporting need. You can choose to count just the Tier 1 records - in the example above this is the Client Profile records - or just the Tier 2 records. If you want to limit the count to the number of individuals served, you will need to set the count to any records that are created only once per person, like a Client Profile Tier 1. If you are counting a total number of times that a particular service is provided, you may need to switch the count to a Tier 2 form instead.If the Total Rows clutters the look of your report and draws attention away from other information, you may hide or suppress this count in your report section. It can be suppressed for any combination of the following:When a report is run.\nWhen a report is embedded in a bulletin. \nWhen a report is printed. \nWhen a report is exported. \n\nTotal Rows is usually an extra tab in an excel spreadsheet when a report is exported. Suppressing this means that your Excel spreadsheet will not have a tab dedicated to the Total Row count.  4. When you are finished making adjustments, click Apply to return to your report.","title":"Report Counts","url":"https://apricot-articles.socialsolutions.com/en/articles/1885756-report-counts"}