{"content":"Set-up for Internal Program Referrals in AdministrationCreating a New Internal ReferralBulk Creating a New ReferralCreating an External ReferralAccepting and Rejecting ReferralsBulk Accepting and Rejecting ReferralsView All Accepted and Rejected ReferralsExporting Referral InformationEmail Notifications for ReferralsReferrals needs to be set up in 2 locations:1. In the Administrator Tab, under the User/Program Profiles link, select to edit a specific program     a. You can individually set a program to receive referrals and send referrals     b. You can also setup the email address that will receive the notification when a                            referral is made to that program\n2. Within a permission set, you can setup user access to:Create internal referrals for a programAccept internal referrals for a programReject internal referrals for a programEdit internal referrals for a program**Note** Permissions will need to be established for each Role/Permission set as needed for referrals.Referrals are created from the Tier 1 level. To create a new referral:Under the My Apricot tab, navigate to your participant profileNext, select the client you want to referWithin the Client document folder, click the three vertical menu dotsSelect \"Create Referral\"Choose a Program(a program selection is required before continuing)Once the program is selected you will be able to select the owner and the records within the folder to be referred:Your referral will be automatically set to the \"Current Owner\", or userForms to Transfer: This option is a checkbox field that allows you to select individual tier 2 records within the folder to referSelect \"Submit\" to complete ReferralClick this link to move on to steps for accepting your referral!**Note** You won't be allowed to send a referral for a program that the record is already assigned to. Referrals can also be created for more than one Tier 1 at a time.1. Navigate to your participant profile and search to narrow down the list of people to the ones you want to refer.\n2. Select the Create Referral button from the Search Actions menu on the right.3. Select the individual referral items that are specific to the group of people you are referring and then select the Send button: The program you are referring the clients toThe forms that will be shared as part of the referralAny notes you have about the referralSend the referral. Click this link to move on to steps for accepting your referral!**Note** You will need to have referrals enabled for each program and each permission set before you can use this feature. Otherwise, you will have no options in the \"Program Referring To\" dropdown.Navigate to your participant profile and narrow down the list of clients to help find the client for whom you are creating a referral.Select the client you want to refer to open their document folder.Select the Create Referral button from the folder navigation menu on the right of the screenSelect the External Referral button in the bottom left corner.\nSelect the individual referral items that are specific to the person you are referring and then select the Submit button: The email address of the outside referral agencyAny notes you have about the referralSubmit referralOnce a referral has been created, a person from the program that the client is being referred to will need to accept or reject the pending referral.1. Navigate to the My Referrals section of Apricot from the My Apricot Tools>My Referrals link on the left hand navigation menu.2. Find the pending referral that you want to accept or reject.\n3. Select the Accept button or Reject button accordingly.**Note** The created by filter shows the creator of the referral, not the creator of the record being referred. It can be used to find who made the referrals even when the Owner isn't showing accurately.After a referral has been created, certain items can be edited before accepting or rejecting the referral.Navigate to the My Referrals section of Apricot from the My Referrals link on the left hand navigation menu as shown previously.    2. Find the pending referral to accept or reject.\n    3. Select the Edit button.4. Update the fields necessary and then select the Accept or Reject button: The owner can be changedThe forms being shared can be changedThe notes field can be updated with text specific to the acceptance or rejectionAccept or reject the referral or cancel your edits.If you know you are going to accept or reject multiple referrals, you can use the filter to narrow down the list to the ones you want to accept all or reject all and then bulk update with the appropriate action.\n1. Navigate to the My Referrals section of the application from the My Referrals link on the left navigation.2. Use the filter to narrow down your list to only those you want to perform the bulk action on.3. Select the action you want to take and then select the Bulk Update button\nA user can view all accepted and rejected referrals that are associated with his or her programs.1. Navigate to the My Referrals section of the application from the My Referrals link on the left navigation.2. Find and select the Referral History tab.\nA user can export referral information from the My Referrals Page or the Referrals History Page.1. Navigate to the My Referrals section of the application from the My Referrals link on the left navigation.2. Filter for the information you want to export on either the My Referrals tab or the Referrals History tab, and then select the Export button.3. Select the type of export you want to create, and then select the Export button.Two types of email notifications exist for referrals. Referral emails are sent when a program receives a new referral. This email is sent to the designated email address setup on the program page for that programReferral emails are sent when a referral is accepted or rejected. This email is sent to the person who created the referral.","title":"Internal Referrals","url":"https://apricot-articles.socialsolutions.com/en/articles/1885140-internal-referrals"}