{"content":"The Batch Records Tool can be activated for any Tier 2 form. To turn it on, open a Tier 2 form for editing.Open the Form Properties by clicking on the top most gear.Under Settings, select \"Allow Batch Record creation?\"Apply.Publish the form. Now the Batch Records Tool will be available when users access a Tier 1 search screen. Select the \"My Apricot\" tab.Choose the appropriate Tier 1 form from the left hand menu.Under \"Create Batch Records,\" you will see the name of the Tier 2 forms that have been enabled to allow Batch Records. Once you have selected a Tier 2 form from the list under \"Create Batch Records,\" a blank copy of the form will open. Fill out the fields as appropriate.If you would like to create this identical record for a group of Tier 1 records you have saved as a Favorites List, you can select that list by expanding the gray arrow next to \"Favorites List\" and choosing one.The list of records will appear below under \"Records Selected.\" You can remove people from this list by selecting the \"x.\" This will not remove them from the Favorites List for the future, but will ensure that the Batch Records Tool will not create records for those that have been removed.If you would like to select records that are not contained in a Favorites List, you may select your own list here:Next, we must choose our clients (Tier 1) records which the Tier 2 form (in this scenario, \"Intake Assessment Record\") will be placed under. Click the \"Pick [Tier 1 form name]\" button in the Record Options palette.Our search box shows up, to add a client pick the \"+\" sign. Select profiles as neededIf you chose a client by mistake you may choose the \"X\" symbol by their nameIf you chose a client by mistake you may also choose the smaller \"x\" in the Records Selected palette.Once everyone is selected, click to close out of the search pop upAfter our last step, this pop up will show up right away.Select the \"Programs\" from the box on the left which the records should be assigned to. If only one Program is assigned to this form then it will already be over in the box to the right.If you did need to select a program(s) click AddOnce done, choose ApplyOnce you are ready to save:Click \"Save [Tier 2 Form Name]\" button. When the save has worked you will see the \"Batch Records\" pop up with some details such as hoe many records were processed and for which Tier 1s.  The Batch Record Creation Tool is best used when you have an event or activity, etc. that applies to many Tier 1 records at the same time. In the example above, the Tier 1 records are based around a Client Intake or a specific rescue dog and the Tier 2 form details what kind of Activity applies to each of these Clients. Batch Records is a tool that makes it easy to fill out the same Activity details for more than one person - for example, if everyone attended the same class on the same day.Batch Records are only available for Tier 2 formsIf you would like to use the Batch Record Tool you will need to enable it on each individual Tier 2 formSome features do not work with the Batch Record Tool (like some Dynamic Dropdowns or any Wizard Links); if you have a question or concern about your form and it's compatibility with the Batch Record Tool please contact the Ongoing Support teamThere is no undo after you create the Batch Records. If there was a mistake they will need to be archived or modified individuallyAll Tier 2 records created using the batch records tool will be exactly the same, you will not be able to customize it for Client 1 versus Client 2, for example, if you would like a feature like that please see our premium add on, the Registration GridBatch records cannot update existing records, they may only create new ones. If you would like to modify many records at once, you would need to use the import tool","title":"Batch Records Tool","url":"https://apricot-articles.socialsolutions.com/en/articles/1885766-batch-records-tool"}