{"content":"Here is a report that has been \"grouped\" by name. This report shows:All the kids who have been enrolled in a program.How many programs they have been enrolled in.A group filter would be useful if we wanted to see all the kids who have been enrolled in more than one program.With a small data set like this, it is easy to see who has a row count of more than 1 program enrollment. However, if we had a data set of thousands of kids, most of whom had only been in one program, it would be a lot of work to go through the rows and identify just those who had been enrolled more than once. This is when a group filter is useful. Now we have added a group filter looking for students who have more than 1 program enrollment record.Everyone who has a row count of more than 1 is included; everyone else has been filtered out or removed from our report. Group filters are only available when you have grouped by at least one column in a report section. To learn more about grouping please see the Grouping in Reports article.Add grouping to a column.\"Group Filters\" will appear as an option. Click the plus \"+\" sign to the right of \"Group Filters.\"Adjust your filter as necessary.Add options if needed.Click \"Apply.\"Another advantage of using group filters is that you can filter on summaries. Summaries are the options chosen for a column that can total columns, give you an average, or even show the latest date. \nTo apply a summary:Click the gear for the columnChoose the type of summary (these options will be different depending on the data within the column)Choose ApplyAfter grouping by our name column and applying a summary to the \"Length of Enrollment in Days\" column to calculate an average, we are then also given a new option for our group filter criteria. This allows us to narrow down our results to those clients who have hit (or have not yet hit, depending on your reporting needs) a certain \"Average Length of Enrollment in Days\" value.","title":"Group Filters","url":"https://apricot-articles.socialsolutions.com/en/articles/1886055-group-filters"}