{"content":"1. Select the \"My Apricot\" tab.2. Choose a Tier 1 form from the left hand menu.3. Expand the gray arrow next to \"Favorites List\" on the right hand side.You will have the choice to open an existing Favorites List or to create a new one. 1. Expand the gray arrow next to \"Favorites List.\"2. Select \"Create New.\"3. Name your new Favorites List.4. Save.5. Now you may add records to your list by clicking the gray stars in the Add column. 1. When you have selected a Favorites List, the \"Favorite Details\" will appear. Expanding the gray arrow will allow you to see the records that have already been added to this list. Clicking the gray gear box allows you to rename the Favorites List.2. In the \"Add\" column, a yellow star indicates those records that have already been added to the Favorites List.To add more records, click a gray star. To remove a record, click a yellow star.This list of records will be saved and any time you select this Favorites List, these records will appear in the \"Favorite Details.\"3. Clicking the green text in the Favorite Details will take you to the Document Folder for this Tier 1 record. A record can also be added to a Favorites List from the record itself, rather than from the search screen.1. Create and save a record. Favorites Lists will not be available on this page until after a record has been saved.2. In the right hand menu, find the Favorites palette. Select the Favorites Lists you would like to add this record to by clicking a checkbox. A record may belong to more than one Favorites List.- A record may also be removed from a Favorites List by de-selecting one of these checkboxes.3. Click Set Favorites.4. A message will appear telling you the record was added or removed from the Favorites List.As an Administrator you can delete any favorite list in the system (global or non-global). However, to delete a non-global Favorites List which a Standard User created you will need to switch to their view to do so. Standard Users can only delete their own Favorites List or any Favorites List set to Global.1. After selecting a favorites list, click the grey gear in the Favorites Details palette.\n2. Click the Delete button. Note: When you click Delete nothing will happen. Please refresh the screen to see the Favorites List removed.Hints/Tips1. Global Favorites lists are seen by all users.1. Global Favorites lists are seen by all users2.  Global Favorites lists are denoted with an asterisk *\n\n3. Anyone can Delete a Global Favorites List.\n\n4. Administrators can see non-global Favorites Lists by switching to a Standard User's view.\n\n5. Clicking \"Delete\" will not automatically refresh the page, please refresh your browser page to see the change.\n\n6. Do not use an apostrophe in a Favorites List name, it can cause errors (like the inability to delete it unless you remove the apostrophe first).","title":"Favorites Lists","url":"https://apricot-articles.socialsolutions.com/en/articles/1886309-favorites-lists"}