{"content":"Why health 'regimen'? Dictionary.com defines a regimen as \"a regulated course, as of diet, exercise, or manner of living, intended to preserve or restore health or to attain some result.\"\n\nHere at Social Solutions, we want to ensure that you're getting the most out of your Apricot Essentials database, and we believe that there are certain areas that help measure the health and success of your product. In this section, we'll provide suggestions and recommendations for ways to improve one of those areas of your site so that you can be sure that you're getting the most out of your Apricot Essentials tool. Check back for new resources and recommendations on how you can get more from your Apricot Essentials!\nA healthy Apricot should have at least two participating users actively accessing Apricot and entering data on a consistent basis. It is common practice to have one Administrator and at least two other standard users entering data into Apricot. Users do not all have to have the same level of access to Apricot, but having as many staff involved as possible can have a very positive effect on collaboration and engagement.Spotlight: Administrator Roles\nA healthy Apricot will have a number of record saves each week equal to or greater than the number of services provided by your organization in the same amount of time. Updating Client Profile Records, Supporter (staff) records, and even User records count toward your Apricot’s weekly record saves, therefore, the number of saved records in Apricot each week will often be slightly higher than the number of services you provide.Spotlight: Batch Records\nA healthy Apricot should have at least one report run per month, but ideally, will have many more. Apricot reports are used to organize and access records and quickly. When at least one report is not being run every month, it’s likely you could be getting more from your Apricot.Spotlight: Grouping and Graphing\nA healthy Apricot should have at least one form published in a 90 day span. This is not to imply brand new forms should be created and published. In an active, healthy Apricot, existing forms used every day will likely need minor adjustments over time. A field could be marked as searchable, or a new field is added to an existing form.Spotlight: Live Form Modifications","title":"Health Regimens Overview","url":"https://apricot-articles.socialsolutions.com/en/articles/1894109-health-regimens-overview"}