{"content":"Google Calendars can be integrated with Apricot. This allows events to be scheduled and event invitations to be created and emailed to Apricot users and/or Administrators who have a Gmail account and an Apricot Calendar configured for their username.  The scheduler field, which can be added to a form for data entry, can be used with an integrated calendar to verify a user's availability. This is a Premium feature that you can add.To be able to add calendars to your Apricot, check to see that this feature has been turned on for your Apricot.1. Click the Administrators tab at the top of the page.2. Open Apricot Settings.3. Under Premium Features, check to see that \"Integrated Gmail Calendars\" has been enabled. If it has not and you would like to turn on this feature, please contact the Customer Care team. First, we want to make sure we are in the \"Administrator\" tab at the top of the page (not pictured)1. Select Calendars from the left hand menu (Navigation Menu).2. Select \"New Calendar\" from the right hand menu. The calendar feature requires you to be signed into a Google Gmail account to proceed (located in Apricot Settings). You may receive a message asking to sign in or for your permission to share details between your gmail account and your Apricot system. These permissions will allow Apricot to read your calendar.3. Pick the \"Calendar Type\" that your Gmail is using. Under most circumstances  you will choose Standard Gmail Calendar. If you are uncertain please ask the I.T. team at your organization.4. Choose a Display Name, this will show up when you are selecting calendars while designing forms.\n\n5. Type in the associated email address for the calendar (Note: Only the primary calendar for the selected email address can be integrated)\n\n6. This allows you to show the calendar on associated records with the scheduler field.\n\n7. Click the Generate Preview button to see how this will look. Click the X when done.\n\nClick Save Calendar when done.To access an integrated calendar from a record during data entry, the scheduler field must be added to the form and configured to interact with the calendar that has already been integrated with Apricot.1. To open a form for editing, select the Administrator tab at the top of the page.2. Select \"Standard Forms\" from the left hand menu.3. Find the form you would like to open for editing and hover over the Actions tab.4. Select \"Edit.\" 1. Expand the arrow next to the Date and Time fields, find the scheduler field and drag it into the main body of your form.2. Here you will see the calendars that have already been configured with your Apricot system.3. Publish the form.Create a new record with the scheduler field that you just published. The scheduler field will now take any events you add to the scheduler and align them with the selected calendar that has been integrated with Apricot.1. Name your event.2. Schedule your event.3. Select an integrated calendar.4. Click \"Check Availability.\"5. Once you've clicked \"Check Availability,\" you will see \"available\" or otherwise in this sectionAll Integrated Gmail calendars will show on the Scheduler fieldOnly the primary calendar for each email address will appear in Apricot. If you have a secondary calendar or shared calendar you would like to integrate, it is recommended that you create a new email address for it (Calendar@[Organization].org can be a useful alternative) and use that email address when setting up the calendar integration.","title":"Google Calendars - Integration","url":"https://apricot-articles.socialsolutions.com/en/articles/1911596-google-calendars-integration"}