{"content":"The Picture of Health\nA healthy Apricot should have at least one report run per month, but ideally, will have many more. Apricot reports are used to organize and access records and quickly. When at least one report is not being run every month, it’s likely you could be getting more from your Apricot.  Symptoms of Not Running Reports\nWhen at least one Apricot report isn’t being run per month, the following symptoms can be expected:Records are not being checked for accuracy. Don’t wait until your big funding report is due, run quick reports weekly or daily to gauge the number of services being provided and records filled out completely.Workflow could be taking longer than it has to. Rather than using record search tools alone, use a report to query clients who need a follow-up visit, or other action itemsPrescribed Regimen \nTo ensure that more than one report is being run each month, we recommend the following:Create a report to help you as Administrator monitor the numbers that matter to you. This might be a service report broken down by service type. This report can help you gauge the accuracy of your service counts before your annual or quarterly funding report is due.Create a Case Load report for your users. Make a report that isolates each user’s case load so they can monitor their own data. Ensure the users have permissions to the report you build for them in their Permission Set record.Create a Dashboard Report for your Apricot Bulletin page. This will run each time a user logs into Apricot and give them a bird’s eye view of the data being entered in Apricot.Administrator Monitoring Report: Reports can be designed to keep Administrators in the know about records being entered into the database on monthly, weekly or daily basis. These reports tend to be simple, but serve a powerful purpose. These resources will help you get started.Article: ReportingArticle: Building ReportsVideo: Report Building Level 1 Staff Case Load Reports: Reports can be built that provide clarity for data entry users. This type of report can be built once and copied for each user, or grouped by User Name.Article: Grouping in ReportsArticle:Copy Reports and Report SectionsVideo: Report Building Level 2 Dashboard Reports: Dashboard reports are a great way to share the stories told by your data with your staff. Use calculations and graphs to add clarity to reports viewed on the bulletin page.Article: Calculation Columns in ReportsArticle: GraphsArticle: BulletinsVideo: Administrator Tools Level I","title":"Essentials Health Regimen | Running Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/1919816-essentials-health-regimen-running-reports"}