{"content":"The Picture of Health\nA healthy Apricot should have at least two participating users actively accessing Apricot and entering data on a consistent basis. It is common practice to have one Administrator and at least two other standard users entering data into Apricot. Users do not all have to have the same level of access to Apricot, but having as many staff involved as possible can have a very positive effect on collaboration and engagement. Symptoms of a Lack of Active Users\nWhen two or more users are not actively using Apricot, the following symptoms can be expected:Conduct frequent user trainings. Engage your users by quizzing their knowledge of their workflow process and asking for their feedback.Check User and Permission Set Records. Confirm users can all access Apricot and have only the permissions they need.Utilize the Record Audits Tool. Monitor the usage of your Apricot using the Record Audits tool on the Administrator. See the number of records entered each day by form, or focus on a specific user’s record entry.Add User Profiles: Managing users is an important part of managing your database. Apricot has a set number of active user seats. These seats can be opened up when a user is made inactive. Every User Seat has a Username, Password, profile image, and specific database permissions and settings.\nApricot tracks activity history for every user including records they have created, records they have modified, and reports they have run.Video Tutorial: Add User ProfilesRecorded Webinar Course: Administrator Tools Level IArticle: Managing Users and AccessAssigning User Access: Users do not all have to have the same level of permissions. A permission set record, tied to each User Record, determines how much access the user should have to your database and data.\nUsers can also be granted some Administrative duties called “Roles” that allow them to perform certain tasks typically only handled by an Administrator.Recorded Webinar Course: Administrator Tools Level IIArticle: Granting Administrative FunctionsArticle: Record Audit (Record History)User Settings and Preferences: Once user access is created in your Apricot, the user can then adjust some of their own settings and preferences. Some user settings, like password requirements and log-out time, are determined by the administrator.Article: User Information and PreferencesArticle: Apricot SettingsVideo Tutorial: Configure Apricot Settings** View all of our Video Tutorials and Training Classes! **","title":"Essentials Health Regimen | Active Users","url":"https://apricot-articles.socialsolutions.com/en/articles/1919752-essentials-health-regimen-active-users"}