{"content":"The Picture of Health\nA healthy Apricot will have a number of record saves each week equal to or greater than the number of services provided by your organization in the same amount of time. Updating Client Profile Records, Supporter (staff) records, and even User records count toward your Apricot’s weekly record saves, therefore, the number of saved records in Apricot each week will often be slightly higher than the number of services you provide. When the services provided by your organization are not documented in Apricot as records, the reports built to report those numbers will not be a true reflection of the work you do.Symptoms of a Lack of Saved Records\nWhen records are not being consistently saved, the following symptoms can be expected:  Inaccurate results in reports. Reports that accurately reflect the work your organization does require that work be documented in Apricot.Records do not have the most up-to-date information. Users may not be checking profile information, like address and phone number, to ensure it is current.Users do not feel familiar with Apricot. When fewer than fifty records are created each month, users have very little experience in the software and will likely not feel very savvy using it.Workflow Tools: Create more Tier 2 records at one time using the Batch Records tool. When attendance records, services or any other Tier 2 records are identical for many clients, the batch record tool allows users to created many records at one time.Article: Creating Records with the Batch Records ToolArticle: Favorites Lists (Used with Batched Records)Video Tutorial: Batch Record CreationArticle: Copying RecordsReport Center: Monitor the amount ofdata entered into your Apricot with the Apricot Report Builder. Design custom reports to monitor and compare data of a certain type.Article: Building New ReportsVideo Tutorial: Access the Report BuilderVideo Tutorial: Modify ReportsRecord Audits Tool: Better Manage your Users data entry practices with the Record Audit and Record History tools in Apricot. Monitor actions taken in your database, changes made to records, and the amount of data addedVideo: Record Audit and Record History \n** View all of our Video Tutorials and Training Classes! **","title":"Essentials Health Regimen | Data Entry and Record Saves","url":"https://apricot-articles.socialsolutions.com/en/articles/1919779-essentials-health-regimen-data-entry-and-record-saves"}