{"content":"The Picture of Health\nA healthy Apricot should have at least one form published in a 90 day span. This is not to imply brand new forms should be created and published. In an active, healthy Apricot, existing forms used every day will likely need minor adjustments over time. A field could be marked as searchable, or a new field is added to an existing form.Symptoms of Not Publishing Forms\nWhen at least one form isn’t being published every 90 days, the following symptoms can be expected:Forms are out of date. Forms do not have the most up-to-date dropdown options or data collection fields. Forms could be more user friendly. Listen to your users’ feedback. Are their fields on a form that should or should not be marked as required? Are their fields like “phone number” that could be useful to search records by?There may be other ways you could be using Apricot. Does your organization have areas of data collection still being using spreadsheets? Perhaps this data could also be stored in Apricot with the use of new forms.Prescribed Regimen \nTo ensure that one form is being published every 90 days, we recommend the following:Periodically audit your forms. This could be a report that pulls every field from your most frequently used forms. This could be a manual review of each form in your site.Walk through workflow with your Users. Schedule a database review with your users 2 to 4 times per year. Walk through real life scenarios for data entry in your site with your users and identify areas that could use improvement.Check with your staff to see if there is data being collected in a spreadsheet that could be stored in Apricot instead. Do you hold events? A new Tier 1 form could easily be created to collect that data.Check the Data You’re Collecting: Take some time to review the information you are collecting with your existing forms to ensure you’re not tracking too much or too little. Use the Report Builder to generate reports that will show you exactly what data is being captured in your Apricot. If you are missing data collection fields, simply add new fields to your forms.Article: Building New ReportsVideo Tutorial: Access the Report BuilderVideo Tutorial: Modify ReportsArticle: Export ReportsVideo Tutorial: Add New Fields to FormsMake Workflow Improvements: Users can offer great feedback for making forms more useful and workflow more efficient. Ask users about fields they would prefer to search records, data elements that would helpful to see in a Record’s QuickView.Article: Basic Field PropertiesArticle: Edit Forms in Form DesignerArticle Collection: How to Design FormsVideo: Form Design Level II Create New Forms and Deactivate Unnecessary Forms: Over time, it’s likely that you will find opportunities to add new forms, and remove forms that you no longer need.Article: Creating FormsArticle: Design FormsArcticle: Deactivate Fields and Forms ** View all of our Video Tutorials and Training Classes! **","title":"Essentials Health Regimen | Publishing Forms","url":"https://apricot-articles.socialsolutions.com/en/articles/1919860-essentials-health-regimen-publishing-forms"}