{"content":"The Picture of Health\nIn the Apricot Essentials Health Regimen “Publishing Forms,” we discussed the importance of publishing forms, testing the data collected with these forms and periodically auditing your forms. So, what happens to your existing data if you choose to make changes to a form that has already been used to create real records? Here, we’ll take a closer look at how to safely update forms without losing any data.Spotlight: Making Form Changes with Live Data\nForms in Apricot can continue to be updated even after the forms have been in use and data has been collected with them. Considerations must be made to ensure data is not hidden by mistake, but following these rules should prevent unexpected results when changing forms containing live records.Helpful Tools for a Healthy Database:\n\nReplacing Dropdown Menu Options\nChanging Dropdown menu options is very easy in Apricot. Suppose you have a dropdown field to collect volunteer’s favorite color with dropdown options red, blue and yellow. Adding new options – like green and purple – will have no effect on existing records, but the new options will be available moving forward.\nReplacing values is a bit different. With the same list (red, blue and yellow) let’s say we instead need to replace the value “red” with “crimson”. We can type over the value “red” with “crimson”, however records that already have “red” selected will not be updated with the new “crimson” value. The value “red” will not be able to be selected moving forward.\n\nDropdown options can be changed in the field properties window. If your dropdown options were created in the Look Up Lists library, see this article for more information.Replacing a Field with another Field Type \nSometimes, a situation may arise when you want to replace one field type for another. Perhaps you are using a text box to collect the favorite color of every volunteer. A text box allows anything to be entered and you’re noticing quite a few spelling errors and a dropdown could be used to control the answers given buy users.\n\nFields cannot be converted from one field type to another, but you can “lock” the original text box within the field’s properties and add a new dropdown with your list of colors. Note, the two fields will need unique names, such as “Favorite Color - Locked” and “Favorite Color”.\n \nAlso worth noting, the data will not automatically be moved from one field to another. The data collected in the text box will not be available in the new dropdown until those records are updated, either by hand or using the Import Tool.Adding New Fields to Forms \nAdding new fields or sections to an existing live form is no problem at all. New fields can be added to a form at any time. Existing forms may also be rearranged on a form without affecting the data collected within them. Properties for fields may also be changed without harming existing records. Make fields Required, Searchable and Quick View at any time. Just remember to publish the form when you’re ready for those changes to be visible to users.New fields to consider adding to your existing forms:Attach Doc Field: Upload a file (PDF, JPG, Word Doc, Excel, etc.) to save to a record.Image Field: Upload a photo of each of your clients or volunteers to display on their record.HTML Label Field: Add instructions, images, and hyperlinks to your forms.Record Lock: The record lock field allows only certain users to edit records once they have been “locked”. \nLearn More About Modifying Forms  Article: Table of Contents – How to Design FormsTutorial: Add New Fields to Forms","title":"Spotlight: Live Form Modifications","url":"https://apricot-articles.socialsolutions.com/en/articles/2066345-spotlight-live-form-modifications"}