{"content":"An Apricot Administrator, or a Standard User with the Manage Bulk Assignments Admin Role, has the ability to restrict which records can be accessed within the database by different users. Administrators may also need to assign or adjust access to records that have already been created. If you need to remove program assignments in bulk, you can follow along in the article Bulk Assignments.\n Once you have created a program and a permission set, you will need to assign existing records to the correct program. The users will not be able to access any of the records until they have been assigned. To update this from the search:1. Click the My Apricot tab.2. On the left hand menu, select the form you would like to use.3. Expand the black arrow to select a search field. Your goal at this point is to narrow down your search results to exactly the records you would like to assign - so searching for a specific name might be a good idea. \n1. When you have narrowed your search results so that the page only shows those records you want to assign,\n2. Select Program Access.1. Select the program(s) to which you would like these record(s) to be assigned.\n2. Owner: This field will establish access restrictions based on the feature User Record Level Access. If you do not use this level of access restriction, you can ignore this field. To find out more, take a look at our article on User Record Level Access (User RLA)3. Click Add4. Click Apply.Similar to assigning records for Tier 1 forms, you will head to a records search. Make sure that the Tier 2 records you need to adjust are within the Tier 1 records you are searching. Select the associated Tier 1Click \"Add Search Field\"Select a search field from the Tier 2 for which you are adjusting accessWith the search field included it is now possible to adjust access for Tier 2 records pulling into your search. Click \"Program Access\"Notice that we now have a dropdown field called \"Form\"Select the Tier 2 form for which you are adjusting accessChoose 1 or more programsClick \"Add\"Click \"Apply\"To learn more about User RLA, please check out our article User Record Level Access (User RLA). Once you have created a program and assigned User RLA to a permission set, you will need to assign the existing records to the correct user. The user will not be able to access any of the records until they have been assigned.1. Click the My Apricot tab.\n2. On the left hand menu, select the form you would like to use.\n3. Expand the black arrow to select a search field. Your goal at this point is to narrow down your results to exactly the records you would like to assign - so searching for a specific name might be a good idea.1. When you have narrowed your search results so that the page only those records you want to assign,\n2. Select Program Access.1. When the access window opens, select the form you would like to adjust access on. This will default to the Tier 1 form you utilized in the search.2. Owner: Expand the black arrow and select the user who has been assigned to the permission set for User RLA. It will change the User RLA for all the records currently showing in the search screen.\n3. Hit Apply.\n Updating Program access for an individual record can be done from the record itself:1. Open the record that needs to be updated and click the Program Access button in the Assigned Programs menu on the right.2. From the Assigned Program popup window, add or remove Programs as needed. 3. Click Apply and save the record.","title":"Assigning and Removing Programs in Bulk","url":"https://apricot-articles.socialsolutions.com/en/articles/2066969-assigning-and-removing-programs-in-bulk"}