{"content":"The Picture of Health\nA healthy Apricot will have a number of record saves each week equal to or greater than the number of services provided by your organization in the same amount of time. Updating Client Profile Records, Supporter (staff) records, and even User records count toward your Apricot’s weekly record saves, therefore, the number of saved records in Apricot each week will often be slightly higher than the number of services you provide.\nIn the Apricot Essentials Health Regimen “Data Entry and Record Saves,” we discussed Apricot Workflow tools that can help users enter more records while maintaining data quality. One of the tools discussed was the Batch Records Tool. Here, we’ll take a closer look at how the Batch Record tools can speed up data entry for users. \n\nSpotlight: Batch Records\nCertain Tier 2 forms in Apricot may be enabled with Batch Record functionality. This allows the user to create identical Tier 2 records for many Tier 1 records at one time.Prescribed Regimen \nTo ensure that records are being entered into Apricot on a regular basis we recommend the following:Conduct frequent user trainings. Engage your users by quizzing their knowledge of their workflow process and asking for their feedback.Utilize the Record Audits Tool. Monitor the usage of your Apricot using the Record Audits tool on the Administrator. See the number of records entered each day by form, or focus on a specific user’s record entry.Explore workflow options like Batch Record Creation and Copy Record that could speed up the process for Users.Helpful Tools for a Healthy Database\n\nWhen would Batch Records be a fit? \nBatch record creation is perfect for tracking class attendance, group activities, and sometimes even service tracking. Think about scenarios where a group of individuals all need the same record entered in their folder.\n \nChanges can be made to the records individually. Building a report as a workflow tool to find records created in batch can help you manage the batches of records created at once.\n \nUsing Favorites Lists to Build Classes\nIf your program offers classes and the same group of students attend week-to-week, favorites lists can be created to make the process of Batch Record creation even faster. If an individual shows up for a class and they are not part of the list, they can be temporarily added to receive an attendance record.\n \nFavorites Lists can be either “Global”, meaning they are accessible to all users in your Apricot, or specific to one staff member.\n \nSet Up Batch Records\nBatch records does not include a lengthy set-up process. Simply activate the property in the Form Property box. Any Tier 2 form can be enabled with Batch Record Creation. Favorites lists are built from the Tier 1 search screen.\n \nLearn More About Batch RecordsArticle: Creating Records with the Batch Records ToolArticle: Favorites Lists Video Tutorial: Batch Record Creation \n** View all of our Video Tutorials and Training Classes! **","title":"Spotlight: Batch Records","url":"https://apricot-articles.socialsolutions.com/en/articles/2066317-spotlight-batch-records"}