{"content":"The Picture of Health\nA healthy Apricot should have at least one report run per month, but ideally, will have many more. Apricot reports are used to organize and access records and quickly. When at least one report is not being run every month, it’s likely you could be getting more from your Apricot.\n\nIn the Apricot Essentials Health Regimen “Running Reports”, we discussed the importance of utilizing the Apricot Report Builder for day-to-day data management as well as for funding reports. We mentioned a few useful kinds of reports, such as Staff Case Load Reports and Administrator Reports. Here, we’ll take a closer look at how to accomplish these types of report designs by highlighting the Grouping tool and how it can be used to make visually stunning graphs.Spotlight: Grouping and Graphing\nIn any report, any column can be used to “Group” data. Unlike filters, grouping a report by a certain data column will not remove any records from the report based on the data recorded. Rather, the grouping property will arrange records in the report base on the selection.Prescribed Regimen \nTo ensure that more than one report is being run each month, we recommend the following:Create a report to help you as Administrator monitor the numbers that matter to you. This might be a service report broken down by service type. This report can help you gauge the accuracy of your service counts before your annual or quarterly funding report is due.Create a Case Load report for your users. Make a report that isolates each user’s case load so they can monitor their own data. Ensure the users have permissions to the report you build for them in their Permission Set record.Create a Dashboard Report for your Apricot Bulletin page. This will run each time a user logs into Apricot and give them a bird’s eye view of the data being entered in Apricot.Helpful Tools for a Healthy DatabaseWhen can the Grouping property be used in reports? \nThe Grouping property can be applied to any column in any report, but is typically the most useful when activated on columns that track data stored in a single-select drop down list. It is used when you need to organize records based on the data stored in the field, but you don’t want to remove any records.\nCommon fields used to group on for funding reports:  Month or Year of Client IntakeZip CodeGenderAge GroupAssigned Staff MemberFiltering Groups\nAfter data has been grouped, groups can be filtered out based on the number of records in a group, or column summaries applied to columns. For instance, clients could be filtered based on the number of service records they have in their folder.Advanced Grouping \nGrouping can be applied to more than one column at one time. Imagine you need to pull a report that shows the number of clients based on both gender and year of intake. This is very simple with the grouping tool. First, convert the date of intake data style to year. Next, Group the data based on Year of intake, then group again on the gender field. The “gender” groups will appear within the “year” groups. This can also be graphed, most often using a Stacked Bar or column graph.Creating a Graph with Grouping\nThere are several ways to graph data in Apricot, but the default data source comes from Group counts. In other words, if you group your client records based on a certain field – for example Program Enrolled – activating the graph tool will automatically produce a graph showing the number of clients enrolled in each program.\n\nLearn More About Grouping and GraphsArticle: Grouping in ReportsArticle: Group FiltersArticle: GraphingTutorial: Modify Reports and Adjust Column PropertiesTraining: How to Build Reports** View all of our Video Tutorials and Training Classes! **","title":"Spotlight: Grouping and Graphing","url":"https://apricot-articles.socialsolutions.com/en/articles/2066337-spotlight-grouping-and-graphing"}