{"content":"If many report sections in the same report require the same filter and value, you might find it easiest to add a Global Value.Click [+] Add under the Global Values section.Name your Global Value. For example, if you're reporting on case notes and want to show case notes that only belong to a certain caseworker, you could create a text Global Value called \"Caseworker Name\".Determine the type of Global Value. This is dependent on what field type you're filtering on. For example, if you're trying to view case notes entered within a certain time frame, using a date Global Value would work best.You have the option of making these Global Values locked (meaning no one can edit these when running the report) or hidden. Click Apply to save.A filter's options can be set to \"Global\" in order to feed the Global Value into all the filters it is applied to. Click the [+] button under filters.Select what you'd like to filter on. In this example, it's Service Date.Select \"Global\" under Options.Select the global values from the last drop down(s). In this example, I'm filtering in between two global values (dates). Click Apply to save. You can easily identify a Global Filter because it will show square brackets [ ] around the value. See the example below:For more information on how to filter reports check out this article. Global Values can be applied to filters in all sections in a report. However, copying the report will not copy the global values.Global Values cannot be used as a way to filter multiple options, such as with the \"Matches Any Of\" option in a filter.Global Values that are formatted as Text are spelling and case sensitive. If the Text Global Value is tied to a filter set to _____ \"equals\" ______, then the text must be entered exactly as it is set up for that field. Example: in the screenshot above, there is a filter for Service Type Equals _____. In the Global Filter for Service Type, \"Family Coaching\" must be entered fully and spelled correctly to see results.When entering text in a Global Value, be aware that an extra space or entered empty line will cause the filter not to work properly. ","title":"Global Values","url":"https://apricot-articles.socialsolutions.com/en/articles/2218143-global-values"}