{"content":"Fields govern how data is collected and reported on in Apricot. A diverse selection of fields is available in Form Designer, some tailored to correctly collect very specific kinds of data. Here we will go over date, dropdown date and time fields, and will also cover the scheduler field.Open the form you want to edit in Form Designer.In the Field Choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your form. This field is used to track any date as needed in the form.Under \"Special Properties,\" you can set the default value of this field to be today's date, i.e., the date the record is being filled out. You can also set the earliest/latest date that a user is allowed to enter for this field.This field can be made Required, Searchable, Hidden, Secure and Locked. It can be used in Quick View and as Duplicate Check. Unlike a traditional date field, dropdown date allows a user to select day, month, and year from up to three separate drop down menus.Under \"Display Style,\" you can select how many date fields to show.Under \"Special Properties,\" you can set the minimum year and maximum year values. You can also select the default value to always read today or the current date.A \"today\" button can be added to the field, allowing users to enter the current date by clicking a button.This field can be made Required, Searchable, Hidden, Secure and Locked. It can be used in Quick View and as Duplicate Check. This field is used to mark a specific time of day.Under \"Time Format,\" you can select 12 hour or 24 hour for the display format. You can also:- Show Now Button. This will allow users to select the current time (according to the time zone set in their internet browser) when they are filling out a record.- Default to Current Time. This will automatically fill in the current time on a new record at the time it is opened.This field can be made Required, Hidden, Searchable, Secure and Locked. It can be used in Quick View and as Duplicate Check.This is what the time field looks like on a form with the \"Now\" button. The scheduler field allows users to create calendar or meeting requests that can be sent to other users or to anyone with a calendar that has been added or configured to Apricot. To be able to add calendars to your Apricot, check to see that this feature has been turned on for your Apricot.Click the Administrator tab at the top of the page.Expand Workflow StationOpen Apricot Settings.Under Premium Features, check to see that \"Integrated Gmail Calendars\" has been enabled.\nClick the Administrator tab at the top of the page.Expand Workflow StationSelect \"Calendars\" from the left hand menu.Select \"New Calendar\" from the right hand menu. The calendar feature requires you to be signed into a Google Gmail account to proceed. You may receive a message asking to sign in or for your permission to share details between your gmail account and your Apricot system. These permissions will allow Apricot to read your calendar.Click \"Generate Preview.\"Save your calendar.The scheduler field will now take any events you add to the scheduler and align them with the selected calendar that has been integrated with Apricot.1. Name your event.2. Schedule your event.3. Select an integrated calendar.4. Click \"Check Availability.\"5. Apricot will tell you if the day and time is available and will send out an event invite to the owner of the calendar when the record is saved.Note: You can update the time for an appointment but a correction email will only send if you have the \"Integrated Exchange Calendars\" and \"Integrated Gmail Calendars\" settings active. You do not need a calendar connected if you are using the \"Allow Other Attendees\" option in the Scheduler field.","title":"Date and Time Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/2218219-date-and-time-fields"}