{"content":"The Record Audit feature allows Administrators to access past versions of records, compare prior and current versions, and restore earlier versions of records. It can be accessed through the Record Audit feature under the Administrator tab, or it can be accessed through an individual record.Record Audit is a standard feature of Apricot that can be turned on by an Administrator.To check if Record Audit has been enabled for your Apricot database, select the Administrator tab at the top of the page.In the left hand menu, select Apricot Settings.In the section called \"A La Carte Features,\" you can select Record History - Audit to turn it on.Under \"Premium Features,\" there is also a feature called Track Record Views. This feature allows an Apricot Administrator to track not only the different versions of a record that have been saved, but also every time a record has been opened or viewed, whether or not anything was changed. This feature may be disabled by default, but can be enabled for any type of Apricot without additional cost. To enable this feature, please contact the Customer Care team.Save Settings.Select the Administrator tab at the top of the page.In the left hand menu, select Record Audits. This will open the Record History search page. You must now enter search criteria in order to see results!! Here you will need to add filters to narrow down the search results to just the records you want to look at. Filters can be applied to:Programs and Users: Limits the search results to just one program or one user.Forms: Limits the search results to records of just one form.Actions: Limits the search results to just records that have been created, modified, deleted, etc.Dates: Limits the search results to Actions within a specific date range.Limit: Limits the search results to a specific number of records. This can be useful if you have a large database that is returning too many results.Once filters have been applied, you will need to click the search button to display only those records that apply to the search criteria. Filters can be adjusted at any point.Selecting Reset Filters will clear out your selections and allow you to start over from scratch.When the \"Track Record Views\" feature has been enabled, the Record History search page will also show an Action filter for \"Viewed.\"This filter will return results for every separate instance a record has been opened.The \"Track Record Views\" feature begins tracking the views only after it has been turned on for your Apricot. This information is not available for a time when the \"Track Record Views\" was not enabled.To see one of the records that has been altered, click the row of data you need under \"Results.\"A pop-up window will give you the choice to see the \"Current view\" - most recently saved version of the record - or the \"Historic view\" - the version of the record that has been returned in the search results.Selecting \"Historic view\" will open the record and show the older, historic version. Each field that has been altered between this version and the current version will be raised a bit from the background.On the right hand side under \"Record History,\" the specific version will be highlighted next to information on all the versions that have been saved by the system. You can navigate to a different version by clicking the green text.This view automatically compares this historic record to the current version. If you would instead like to see this record compared to the next previous version, you can select \"Compare Previous Record.\"This view is only displaying the previous versions. None of it is saved or restored until you select \"Restore.\"To access the Record Audit feature from the record itself, rather than through the Record History search page, select the My Apricot tab at the top of the page.Select the form you would like to search.Select a record for editing.When the record is open for editing, it will always show when it was last saved and which user modified the record.For access to in-depth history, select \"View History.\"Now a Record History palette will appear on the right hand side.To view a previous version, click the green textOnce you're done viewing the Record History, you can click \"Hide History\"Selecting a previous version will open that version for viewing.You then have the option to select \"Return to Current\" recordOr, you can \"Restore\" the record to this version: Selecting Restore will save this version as the new/current version. Apricot always saves every version of a record as a previous version. Any past version can always be accessed.Reverting a record to a previous version does not write over any other previous versions. The reverted version, even though it is identical to something that was previously created, is saved as an additional (and the most recent) version of the record.Linking imports do not show in Record Audits or in the Record History of a record.","title":"Record Audit (Record History)","url":"https://apricot-articles.socialsolutions.com/en/articles/2279863-record-audit-record-history"}