{"content":"Attention: Apricot is now Bonterra Case Management. Please bear with us as we update our screenshots to match our new name.Apricot's linking function allows relationships to be established between records that would otherwise not have a connection.Same Folder Linking feature provides the option to connect Tier 2 records within the same Tier 1 folder.Same folder linking connects Tier 2 records that exist under the same Tier 1 folder.It can be useful to create this kind of connection if you:Have more than one Tier 2 form that must be completed at the same time. Example: when a client goes through the intake process, they must fill out an intake evaluation and an intake tracking form. Same folder linking can help your users remember to create both of these Tier 2 records at the time of intake.Have one Tier 2 form that should always be connected to the other Tier 2 records that were created for the same incident. Example: when a client attends a counseling session, you need to record details of that particular session on a Tier 2 attendance record and also on a Tier 2 case notes record. In this case, you would want to make these connections from the same counseling session.Adding a same folder link follows the same steps as adding a traditional link between records. The only difference is that it must be added to a Tier 2 record. You want to create a connection between two Tier 2 records, so you need to have more than one Tier 2 form created under a Tier 1 form for it to work properly.To open a Tier 2 record for editing, select the Administrator tab.In the left hand menu, select Standard Forms.Expand the black arrow next to a Tier 1 form and find one of the Tier 2 records you would like to connect.Hover over the Actions tab to the right of the Tier 2 record and select Edit.Expand the black arrow next to the Link category in the Field Options Palette.Find the Link field and drag it into the main body of your form.Click the gear box in the upper right hand corner of the field to access the properties.Under \"Linked To,\" select the other Tier 2 form under the same Tier 1 form that you would like to connect. Note: in this screenshot example we can see a 1:1 relationship. That means that one record of this form can be linked to just one other record of the other linked form. Depending on your setup you may have different types of relationships. If you are unsure, the easiest one to choose is Many to Many (unlimited records can be linked to any amount of other records).Under Special Properties, select Same Folder Linking.Select Apply.When you are finished adjusting this form, select Publish to commit your changes.Note: When you add a link field to one form, it will automatically appear in the form you are linking it to. It will show up in its own section called \"Linked [Name of Originating Form] Records.\"Now when we create a new Tier 2 record,We can see our new link field.To create a connection or link between this record and another Tier 2 record, we will select Add to the right of the link field.When the link search window opens, we have the option to select an existing Tier 2 record ORCreate a new Tier 2 record that will be connected to the one we are already creating. Note: that the only records that appear in this search window will be Tier 2 records that have already been created under the same Tier 1 record. The Create New button may not work unless you save the record you are currently on first (please keep that in mind with the design of the form and whether or not you need the linking field to be required).When you are finished creating the link, close the search window.Save the record.","title":"Advanced Linking: Same Folder Linking","url":"https://apricot-articles.socialsolutions.com/en/articles/2282777-advanced-linking-same-folder-linking"}