{"content":"Individual records can be printed from the database and exported as .pdf copies. This can be useful if all the information contained in a record needs to be submitted as a hard copy. It can also be useful if you would like to print a blank copy of a record to be completed by hand before it is entered into the database.Open the record you would like to print.In the right hand menu, select Print Mode.This will open a printer-friendly view of the same record.1. Select from the checkbox options in the right hand menu.- Show Empty Values: Displays fields on the form even if they have not been filled in.- Show Secure Field Data: Displays data for any Secure Fields that are on the record.- Enable Section Pagebreaks: The document will insert page breaks between sections of the record.- Shrink to Fit: Will shrink the record to fit the width of standard printed page.- Collapse All/Expand All: Collapses or expands each section.2. Select Print. This will open your browser's print function, allowing you to send it to your printer or export it as a .pdf document.\nIf you would like to print a blank copy of a record - for example, something that can be filled out by hand before it is entered into the database - open a new, blank record.1. Access the settings for your internet browser.2. Select the print function.\nThis will allow you to print a blank copy of the record.1. Name fields and email fields will always have gray text showing the type of data that should be entered. You may want to choose a form to print that does not contain these fields.2. Fields set to have a default value will always be filled out.3. Radio button fields and checkbox fields will display all the available options.4. Dropdown fields will not display the available options.5. Sections that were collapsed when you opened the record will remain collapsed in print view. The fields within these sections will not display.Note:   You will not be able to print Attach Doc fields when in Print Mode.  You will need to download and print them separately.","title":"Print and Export Individual Records","url":"https://apricot-articles.socialsolutions.com/en/articles/2286655-print-and-export-individual-records"}