{"content":"Step by step instructions for creating a new aggregate report containing a new grid.1. To create a new aggregate report, select the Administrator tab at the top of the page.2. In the left hand menu, select Aggregate Reports under Report Center.3. In the right hand palette, select Create New Category.4. Name the category that will contain your aggregate report.5. Select Create.1. Once you have created a new category, select Create New Report in the right hand palette.2. Select the category you created for your aggregate report.3. Name your new aggregate report.4. Select Create.1. Once you have create a blank report, select the Add button at the top to select appropriate data sources or feeder reports to populate the aggregate report with data.2. Expand the black arrow under Select the Category to select the report category you would like to access.\n1. Expand the black arrow under Select the Report to choose which report you would like to populate the aggregate report.2. Expand the black arrow under Select the Report Section to choose which report section you would like to populate the aggregate report.3. Select Create.\n1. Once you have added a section of a report to the aggregate report builder, it will show up in the right hand palette. Expand the black arrow next to the report name to view the individual sections that have been added.2. Each report section will need to be added individually. To add more, select the Add button to the right of Data Sources.3. After you have selected the report category and the report, sections listed under \"Select the Report Section\" will be grayed out if they have already been added to this aggregate report.1. Available data sources can be viewed at any time by expanding the white arrow next to Data Sources, or by2. Expanding the black arrows next to the report names under Data Source Choices.\n1. Once data sources have been added, you are ready to create a new aggregate report grid. Select Add New Section from the right hand palette.2. Name the section.3. Select the section type:- Single Source: allows for one data source or traditional report section to provide the data for the entire aggregate report section. Each row, each column and each cell can be filtered individually which will create a simple grid of data.- Source Per Row: allows for one data source or traditional report section to provide the data for each row of the grid. Each row and each cell can be filtered individually.- Source Per Column: allows for one data source or traditional report section to provide the data for each column of the grid. Each column and each cell can be filtered individually.- Source Per Cell: allows for one data source or traditional report section to provide the data for each cell of the grid. Each cell can be filtered individually.4. Create.1. Once your aggregate report section has been created, it will be labeled with the section type you selected, like Single Source.2. An empty grid with one cell will be displayed.3. To add data sources to the grid, click and drag a report section from the Data Source Choices palette and drag it into the cell in the middle of the grid.If any changes are made to your grid, like adding a new data source, the text (expired) will appear. To refresh the grid to include the most recent changes, select the refresh icon in the bottom right corner of the grid.1. A grid will always begin with a \"total\" row and a \"count\" column. These can be edited by clicking the row or column and typing in a different heading.2. The number that first appears in the grid will correspond directly with the \"total rows\" that appears in the bottom right hand corner of the data source report section.3. To view the feeder report that has been added to this aggregate report section, click the green text of the report name under Data Sources. You may make edits or changes to the feeder report; once the aggregate report sources have been refreshed, these changes will be reflected in the aggregate report.1. To add new rows to the grid, click the + sign at the bottom of the existing rows.2. To add new columns to the grid, click the + sign to the right of the existing columns.- Rows and columns can be moved within the grid by clicking on them and dragging to them to the desired location.- Until filters are added or changed, the same number from the \"total rows\" area of the underlying report section will appear in each new square of the grid.1. To adjust what is shown in a column of the grid, click on the column heading.2. Here you can edit the name of the column.3. Under Data Source, the name of the feeder report section will be listed. You can click this green text to open the feeder report in a new tab. It can be very useful when you are setting up new filters to have the report section available as a reference.4. Click the plus sign to the right of filters to add a new filter.5. Under Rule, create a report filter. Creating a filter for an aggregate report is similar to creating a filter for a traditional report, however not all the options available in a traditional report filter will be available in an aggregate report filter. For more information on creating report filters, please see the Help Center section on Filtering Reports.6. When you are finished creating your filter, select Apply.1. After you have added filters to a column, the text (expired) will appear.2. Click the refresh icon to reload the report section and see the changes that have been made.1. To adjust what is shown in a row of the grid, click on the row heading.2. Here you can edit the name of the row.3. Under Data Source, the name of the feeder report section will be listed. You can click this green text to open the feeder report in a new tab. It can be very useful when you are setting up new filters to have the report section available as a reference.4. Click the plus sign to the right of filters to add a new filter.5. Under Rule, create a report filter. Creating a filter for an aggregate report is similar to creating a filter for a traditional report, however not all the options available in a traditional report filter will be available in an aggregate report filter. For more information on creating report filters, please see the Help Center section on Filtering Reports.6. When you are finished creating your filter, select Apply.1. After you have added filters to a row, the text (expired) will appear.2. Click the refresh icon to reload the report section and see the changes that have been made.Each row and column that has been filtered will have a ~ to the right of the row or column header.Calculations can help make sense of the data in an aggregate report grid. These calculations must be added to each cell and cannot be added at the column or row level.1. To add a calculation, click into the cell that will display the result of the calculation.2. Under Type, select Calculation.3. Under Options, select the calculation you would like to use.4. Then select \"row\" or \"column.\"5. Apply. Then refresh the grid to see the results.1. If any of the results in the aggregate report grid look incorrect or need to be edited, you can access the records by clicking on the cell in the grid,2. And then selecting Drill Down.1. This will open a display of all the records that have been fed into the aggregate report. Clicking on a row of data will open the associated record.- If you make changes to a record, these will be reflected in the aggregate report as soon as you refresh the data sources in the aggregate report builder.1. If your feeder report contains records from more than one form, you can specify which records are counted in the aggregate report by clicking an individual cell.2. Under Type, select Distinct Record Count.3. Under Options, expand the black arrow and select the name of the form you would like to be counted in the aggregate report cell.","title":"Creating a New Aggregate Report","url":"https://apricot-articles.socialsolutions.com/en/articles/2290633-creating-a-new-aggregate-report"}