{"content":"Filter rules are made up of three parts: the column, the filter statement, and the value. More information on how to construct a simple filter can be found in the article called Using Filters In Reports.When the column of data in a filter is drawn from an option field type, the report builder will allow you to use \"matches any option\" or \"matches any of\" in the filter statement.Option fields that can be added to the forms in your database include:- Checkbox- Dropdown- Milestones/Goals- Multi-Select Dropdown- Radio ButtonFor each option field type, in addition to customizing the list of options you would like the field to hold, you can also select \"allow other.\" This allows the users who are filling out records to add their own options if the available options do not fit.When you create a filter on a column of data that is drawn from an option field, selecting \"Matches Any Option\" for the filter statement will allow you to create a filter based on the standard choices that have been entered into the option field. If users have been writing in new options using the \"allow other\" function, these will not be included in the \"Matches Any Option\" function.Note: Filters ondynamic fields may not populate correctly with Matches Any Option, due to the size of the query involved. Using the \"Other Values to Match\" Section with each option separated by bars (|) will allow the filter to run properlyIn contrast, selecting \"Matches Any Of\" for the filter statement will allow you to create a filter based on any of the answers that have been entered in the records, including anything that was entered using \"Allow other.\"\"Matches Any Of\" will also show you in the report builder how many times an answer has been used in the records.If you don't see the option you want in the Lookup List when using \"Matches Any Option\" or \"Matches Any Of,\" find the green \"More\" in the Filter Properties box and click it. This will display the full list of options available in the field. Selecting \"Matches All Of\" for the filter statement will allow you to select multiple field options. Each option selected in the filter must also be selected on the record in order for it to show in the report results, including anything that was entered using \"Allow other.\"When you create a filter on a column of data that is drawn from an option field, selecting \"Matches All Options\" for the filter statement will allow you to create a filter where each of the standard choices selected in the filter must also be selected on the record in order for it to show in the report results.If users have been writing in new options using the \"allow other\" function, these will not be included in the \"Matches All Options\" function.","title":"Matches Any Option and Matches Any Of","url":"https://apricot-articles.socialsolutions.com/en/articles/2291209-matches-any-option-and-matches-any-of"}