{"content":"Reports and sections of a report can be copied in the Apricot Report Builder. Sections can be copied within the same report or copied from one report into another report. This makes it easier to build multiple reports that contain similar information, but display or analyze it differently.You have a report that meets your needs, but you want to experiment on it without disrupting the original report;You need a similar report for a different time period or group of users;You don't want to start from scratch, and you already have a report that draws on the forms you need for a new report.You are creating different sections filtered for specific time periods, such as Intake Date is after 01/01/2014 and Intake Date is before 01/01/2014;You need several summaries or graphs for the same set of records, such as \"Active Clients by Gender\" and \"Active Clients by Zip Code;\"You have a section that meets your needs, and you want to experiment without disrupting the original section.Open the report you wish to copy in Report Builder.1. In the right hand menu, click \"Copy Report.\"2. Select a category for your new report.3. Name your new report.4. Click \"Create.\"You will be taken to your new report. You may now edit or adjust this report as necessary.Open the report that contains the section you wish to copy in Report Builder.1. Click on the green gear box in the upper right hand corner of the section you wish to copy.2. Click \"Copy.\"\nYou can copy a report section within the same report or into an entirely different report.1. Select the report you would like to copy the section into. To copy your section into the same report, leave this field unchanged.2. Name your new section.3. Click \"Copy.\"You will be taken to the report that contains your copied section. If you have copied your section into the same report, look for it at the bottom of the page.Save or publish your report.\n\nTIPS:\nYou cannot create a new report by copying a section. You must first create the new report, which will open with an empty section by default. Navigate to the report you wish to copy the section from, and copy the section into the newly-created report. When you click back into the new report, you can delete the empty default section and only the copied section will remain.","title":"Copy Reports and Report Sections","url":"https://apricot-articles.socialsolutions.com/en/articles/2293826-copy-reports-and-report-sections"}