{"content":"New enhancements to the Apricot Report Builder should save you time when you are building or adjusting an Apricot report. These enhancements include: the ability to add and organize multiple columns at one time and the ability to adjust \"Auto-Run\" settings for an entire report.To add or organize multiple columns in your report, click the new \"Add Multiple Columns\" button beneath the Field Options palette.2. In the new pop-up window, select the section where you would like to add or adjust the columns.3. Available columns are listed in the left hand menu under the heading of the name of the form section. To find the name of the column to be added, expand the black arrow next to the form name.4. Select the column by clicking on it.5. Select the right arrow to add it to the list of columns in your report.6. To add all of the columns from one form section, select the plus sign to the right of the section name.To change the name of a column, double click on the column name. A cursor will appear and you will be able to type in a new column title.2. To change the order of the columns, click on a column title and use the up or down arrows to change its position in the report.3. To remove a column, select a column and click the left arrow.4. Click apply when you are finished making changes. The columns listed in the right hand side will be added to your report section.Auto Run affects whether or not data is generated by a report every time you access the report in Run or Edit mode. When Auto Run is enabled, your report will automatically load all your report data as soon as you open the report. This can create problems when very large reports stall out or freeze during loading, so you may find it necessary to turn Auto Run off for some reports. Auto Run can be turned on each time a report is run or edited by clicking a button embedded within your report; it can be enabled by any user with access to your report. These new settings affect how the report runs automatically when it is opened by a user.1. To access Auto Run settings that will affect an entire report, click the top or report level gear box at the top of your report.2. You can set Auto Run to be enabled or disabled for an entire report in Edit Mode.3. You can set Auto Run to be enabled or disabled for an entire report in Run Mode. This setting will also affect report bulletins you may have on your Apricot landing page.*Settings that are changed here will override any settings at the section level. If you make changes to Auto Run at the section level, these checkboxes will disappear at the report level.4. When you have finished making adjustments, click Apply.","title":"Report Builder Enhancements","url":"https://apricot-articles.socialsolutions.com/en/articles/2293822-report-builder-enhancements"}