{"content":"The Record Lock feature allows specific records to be locked - or made \"read-only\" - which locks the data as it is and does not allow it to be edited by users. Administrators can set up the Record Lock feature so that certain groups of users can lock records and others can unlock them.Locking records, or making them \"read-only,\" is a way to secure the data that has been entered and prevent anyone from editing it.For example, you may have counseling records that need to be reviewed and approved by a supervisor before they can be printed. You could have a counselor lock a record until it has been reviewed by the supervisor.Or, you may have old data that needs to be preserved for historical purposes and do not want to risk anyone accidentally updating it. You can lock the record to make sure no one can edit or delete information.Administrators automatically have access to use the Record Lock feature. They can lock and unlock records once Record Lock has been added to a form. To give access to Lock Records to Standard Users, you will configure that in the \"Record Lock\" field's properties.Select the Administrator tab.In the left hand menu, select Standard Forms.Choose the form you would like to add the Record Lock feature to, hover your mouse over Actions.Select \"Edit.\"1. Find the Record Lock field in the Field Choices palette and drag it into the body of your form.2. Open the gear box in the upper right hand corner of the record lock field.3. Under \"Locking Programs,\" the dropdown menu will show you all the programs that have been created in your Apricot. Be advised that programs need to be set to Active in order for it to appear in the menu. Select the one that should be given access to lock records.4. If necessary, select a second group to have the ability to unlock records. Administrators always have access to this feature, whether or not they have been added to these groups.- You can add more than one program to both or either the Locking Programs or the Unlocking Programs.- Only one Record Lock field may be added to a form.5. Click \"Apply,\"6. Publish.1. To find a record to lock, select the My Apricot tab.2. Select the Tier 1 form from the left hand menu.3. Select a row of data to open a record.1. The Record Lock field is on your form, but it cannot be changed in the main body of the form like the other fields.2. Access this feature by selecting \"Lock record\" from the right hand palette. Once selected, the data on the form will gray-out and become locked or \"read-only.\"3. Save the record.\nTo unlock a record, select \"Unlock Record\" from the right hand palette.Once it has been selected, the fields will be available for editing and the record can be saved.","title":"Lock Records","url":"https://apricot-articles.socialsolutions.com/en/articles/2294299-lock-records"}