{"content":"Unlocking Your AccountClick the \"Forgot Your Password?\" Link on the login page.Enter the email address you use to login to Apricot.You will receive an email to reset your password. Click the link in this email and enter and confirm a new password. This link will expire after 30 minutes.Note: If you have a login for multiple databases, you will receive a password reset email for each database. You will need to use the link in each email to reset the password for each database to regain access.There are a couple of additional ways to unlock user accounts which are different depending on the version of permissions you are using. The steps for both are laid out below:Role Based PermissionsLegacy PermissionsFor those on Role-Based Permissions, the interface is a little different, but the methods to unlock your users' accounts is similar. Navigate to the administrator tabNavigate to the Access Control category, then click it to reveal the contained optionsClick \"Users\"From here in the Users list, you will choose the account that you are attempting to unlock.\nClicking on \"Force Password Reset\" will automatically force the user to reset their password when they next log in. When the user's password has been changed, the Force Password reset box on their user page will no longer be greyed out.  Clicking \"Send Password Reset Email\" will automatically send an email to the user's email on file. This will only work with the email that the user initially signed up with. If for whatever reason the above fails, an administrator can unlock another user's account.\nNavigate to the administrator tabNavigate to the Access Control category, then click it to reveal the contained optionsClick \"Users\"From here in the Users list, you will choose the account that you are attempting to unlock.\nOnce in the user's record, you'll need to click on \"Edit\" in order to edit their record of the Users form.\nClick on the \"Force Password Reset?\" checkbox. If you skip this step, the user will not be able to log in.Set a default password here that you can pass along to the locked out user. To Unlock the account you MUST set a new password.Make sure to save the record. If you miss this step, the user record will not be unlocked.Once the user logs in with the temporary password, they will be prompted to change the password.When the user's password has been changed, the Force Password reset box on their user page will no longer be checked.","title":"User Lock-Out","url":"https://apricot-articles.socialsolutions.com/en/articles/2414728-user-lock-out"}