{"content":"Open the form you want to edit in Form Designer.In the Field Choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your form.This field is used for data available as a whole number/integer (e.g., \"Total Number of Household Members\" or \"Number of Visits\").Letters cannot be entered into numeric fields.The largest number this field will hold is 2,147,483,647. If you attempt to enter a larger number, the record will not be able to be saved until the number has been changed.Special properties available include the ability to set a default value, a minimum value and a maximum value. If a minimum or maximum value has been set for this field, a record will not be able to be saved until the number in this field meets the requirements set by the minimum or maximum value. You may also add a hint (which can be helpful if you are setting a minimum or maximum value).This field can be made Required, Searchable, Hidden, Secure and Locked. It can be used in Quick View and as Duplicate Check.Like a numeric field, the decimal field collects numeric data. It can be used for tracking things such as time (1.5 hours) or specific weight (34.7 oz) that may not be a whole number. Only numeric values can be entered into this field.Special properties available include the ability to set a default value, a minimum value or a maximum value. If a minimum or maximum value has been set for this field, a record will not be able to be saved until the number in this field meets the requirements set by the minimum or maximum value. You may also add a hint (which can be helpful if you are setting a minimum or maximum value).This field can be made Required, Searchable, Hidden, Secure and Locked. It can be used in Quick View and as Duplicate Check.Important Notes:Numeric fields only store up to two decimal places, for example: 1.12If you try to enter 1.123 it will round the number, please see the next bullet points for how Apricot will round in this exampleA third decimal, for example, of 1-4 will remain the same. For example: 1.124 will be saved as 1.12A third decimal, for example, of 5-9 will round up. For example: 1.129 will be saved as 1.13This field is used to track currency.You may choose the format for your currency - dollars ($) or pounds (£). Once chosen, the user filling out a record will only see the currency symbol you have chosen.Other special properties include the ability to set a default value, a minimum value or a maximum value. You may also set a hint.This field can be made Required, Hidden, Searchable, Secure and Locked. It can be used in Quick View and as Duplicate Check.\nNote: Due to how values of zero are stored on the back-end, numeric fields marked required will not be able to have a value of zero. It is recommended that you utilize form logic to require a field in order to ensure the value won't be zero.","title":"Numeric Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/2437062-numeric-fields"}