{"content":"All customers receive our free support package, which includes:Unlimited access to the Apricot Knowledge Base7 AM - 7 PM CT Chat and Email Support. More about how to contact support here.60 Cases (emails + chats) a year. Tickets related to defect reports, network outages, or legacy browser setting support do not count toward your 60 case total. Your account management team will contact you if you are at risk of exceeding your case limit.24-hour emergency line at 1-469-874-0792 Ext. 1 for use in the case that a client’s production use of the SSG Software is stopped or so severely impacted that no User can reasonably continue to use or access the SSG Software. This line is available every day from 7 PM Central - 7 AM Central.Learn about support case priorities and SLAs here.Learn about product development defect severities and SLAs here.Learn about our Support Master Service Agreement and SLAs here.Your account manager is the well informed on all our support add-ons. Please reach out to them to learn which package might be best for your organization:accountmanagement@socialsolutions.comPhone Support Blocks are intended to support clients who prefer prescheduled phone call sessions with support. These phone calls last 30 minutes - 1 hour and are conducted once a month by any member of the Tier 1 support team. More about Phone Support Block here. An Advanced Support Consultant (ASC) is a dedicated, subject-matter expert who partners with you. It is client-led consultation and provides one-on-one help.Choose a block of support hours and work with your ASC to prioritize services that align to your objectives and needs. Consider the menu of services that include configuration services, reporting development, and utilization of best practices. Customization of packages is available as needed. Learn more here.In an effort to better support our clients that have complex service program needs with a desire to take their platform use to the next level we have developed the ASC Program Management Bundle. Throughout our time supporting these clients we have found that the greatest blocker to success within a platform is the tendency of these clients to experience their individual service programs becoming siloed and misaligned with overarching organizational goals, complicating their approach to design and sustainable use of their platform. Learn more here.Managed Services, Apricot for Homelessness Services (AHS) Quality Assurance Program provides a dedicated, subject-matter expert who partners with you. Our experts understand HUD compliance complexities and the importance of reporting accuracy. Consultation is one-to-one and pro-active assistance. Learn more here.We are offering a comprehensive package that that provides Results Reporting specific services at a client-led pace. We will meet your scoping, creation, maintenance, and instance specific training needs to ensure you are capable of successfully achieving your outcome measurement goals on our Apricot 360 & ETO platforms. Learn more here.If you would like to learn more about any of the Support Add-On packages or you do not see a package that fits your need, please contact your account manager or simply reach out to: accountmanagement@socialsolutions.comIt doesn't end here! Become an expert yourself by taking Apricot Trainings. Learn more here.\n","title":"Apricot Packages and Add-Ons | Apricot Support Packages (Free and Add-On)","url":"https://apricot-articles.socialsolutions.com/en/articles/2460197-apricot-packages-and-add-ons-apricot-support-packages-free-and-add-on"}