{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.AFF's grant tool manages access to key forms within the database.- Application. A grant or funding application is made up of one or more forms depending on needs. It will consist of at least the Application Intake form, detailed below, but might also include a number of Tier 2 forms associated with the Application Intake form. These secondary forms might contain requests for uploaded .pdf documents, program budgets, staffing requirements, etc. that may need to be submitted by the applying agency.- Applicant Profile form. Each applicant or applying agency fills out this Tier 1 form and any accompanying Tier 2 forms at the time of the initial funding request. They are designed to collect general information that will be applicable to the applying agency over multiple years and/or multiple grant applications. This form is required to use the AFF Grant Tool.- Grant Invitation form. A specific grant can be restricted so that only those agencies who are invited to apply can access and submit an application. In this case, a Grant Invitation can be created by the Funder to invite specific non-profit agencies or individuals to apply.- Application Intake form. A grant or funding application. Each applicant fills out one of these Tier 1 forms and any accompanying Tier 2 forms each time they apply for funding. This form is required to use the AFF Grant Tool.- Review Scorecard form. An optional form that is to be completed by a Reviewer once an application has been submitted. A reviewer can use this form to rate an application and recommend funding.- Reviewer Profile form. Each Reviewer completes this Tier 1 form and any accompanying Tier 2 forms during their intake into the system. These forms are designed to collect contact and possibly demographic information about the people reviewing the grant applications. This form may be required if the funder is utilizing the built in Reviewer module.- User Creation Field: This field is added to the Applicant Profile form and the Reviewer Profile form. It allows someone from outside the funding organization to create their own login credentials, which will allow them to access the Apricot database when they need to access forms and information.Grant Field: This field is added to the Application Intake form. It links records of the Application Intake form to the appropriate grant.  It also displays the grant and phase that the Application Intake is in. When updating forms, please keep in mind that this field cannot be replaced once the form has been published even if the original field is deactivated. For more information, click Grant Field.Link Field: A linking field is added to the Application Intake form to connect it to the Application Profile form so that an individual Application Intake records is connected to the appropriate Application Profile record. A linking field is also added to the Review Scorecard form to connect it to the Reviewer Profile form so that an individual Reviewer Profile record is connected to the appropriate Review Scorecard records.Review Assignment Field: This field is added to the Review Scorecard form. It links records of the Reviewer Profile to the reviewer module.The Grant Tool is a special module that can be accessed by the Funder to manage key details about a grant like user access and dates that apply to different periods of a funding cycle. It manages two important aspects of the grant application workflow: phases and actions. Each grant will have its own specific phases and actions.- Phases outline the dates that apply to different periods of time in a funding cycle. Access to available forms and actions (see below) can change depending on the phase. Some common phases include when an application is open, when an application is closed/ready for review, and when an application is ready for agency reporting.Actions move a specific application from one phase to another as outlined in the Grant Tool. Actions are completed at the end of each phase by the specific users as assigned to the Action. For example, when an application is ready to be submitted to a funder, the applying agency will press the “Submit” button, which will engage an action to move the application from the “Open” phase to the \"Submitted” phase.AFF manages the workflow around several key users - what forms they can access, when they can access them, and what they can see or edit within the database.- Funder: The Apricot for Funders database administrator or the organization who distributes grant funds on a regular, cyclical basis.- Direct Service Agency or Individual applying for funds: The non-profit organization or agency, or an individual who is applying for grants funds from the Funder- Reviewer: An individual on staff at the Funder, a volunteer, a member of the community, or an expert in a particular field who reviews funding applications and/or reported data to determine if funding should be approved or should continue.Each of these users might be an individual or may be part of a program. They will each have their own access permissions outlined to manage what they can see.Before an AFF database can manage grants and funding requests, a funding organization Administrator must configure the AFF database to collect appropriate data and define grant workflow.1. The Funder creates a form structure to collect application data and reporting/mid-year/end of year data from agencies who will apply for funding.\n\n2. The Funder creates sample users and programs in the AFF database to mimic the access that will be granted to applying agencies and reviewers. 3. The Funder creates a form structure to manage reviewers and what they can review/see.\n\n4. The Funder uses the grant tool to create a grant. The Administrator outlines dates surrounding key period of time in the funding cycle, like deadlines, and creates a list of actions that can be taken by Applicants and Reviewers.5. The Funder sends out invitations to non-profit organizations to apply for funding, if the grant is a restricted grant, or otherwise distributes information about how to apply for funding.6. The Funder secures Reviewers and has them create a Reviewer Profile record and user account if they do not already have one.7. After the application deadline, the Funder assigns at least one Reviewer to each application. The Funder creates one Review Scorecard record under every application for each reviewer. For example, if every application will be reviewed by five Reviewers, there will be five Review Scorecard records created under each application, one for each Reviewer.8. The Funder opens the appropriate Reviewer Profile records and connects each record to the matching Review Scorecard with a link field. This will assign applications to each Reviewer.9. After a reviewing deadline, funds are distributed to agencies that have been approved for funding.10. The Funder reminds funded agencies to submit reporting data on how funds are being/have been used, if applicable.11. After the funding cycle has ended, the Funder reminds Reviewers to review reported data, if applicable. If there is a formal reporting review process, step 6 above would be repeated by the Funder to support the secondary review process and its associated forms.12. Prior to the start of the next application cycle, the Funder sends out invitations to non-profit organizations to apply for the next funding cycle (if it is for a restricted grant) or otherwise distributes information about how to apply for funding.Note: Invitations only really apply to grants that have been marked as \"restricted.\" But all Funders, regardless of whether or not the grant is restricted, need to distribute some kind of instructional information about how direct service agencies should apply for funding.When an AFF database has been set up and is ready to be used, an applying agency or individual applicant will follow this workflow to complete and submit a funding application:1. The Applicant receives instructions for accessing an available application. If an applicant has not yet created a profile in the system, this could include a link to a Secure Web Form to create an Applicant Profile record which will create their login credentials; if they have already created a profile, these instructions could include steps to log in to the system and access relevant records.2. Once logged in, the Applicant will click Application Overview in the left hand menu to view available grant applications and create an Application Intake record to start the application process.3. Once the Application Intake record has been created, the Applicant will be directed to any additional Tier 2 forms required to apply for funding. The Applicant can save incomplete documents and return to complete them at any point until the application deadline.4. Once all the required fields and forms have been completed, the Applicant will submit their application. At this point, the information contained in the application will be locked and made read-only. It will not be able to be edited unless manually unlocked by the Funder.5. The Applicant receives notice that they have been approved.6. The Applicant receives funding.7. The Applicant accesses the AFF database to report on how the funds were spent, if applicable.8. If applicable, the Applicant receives an invitation or a reminder to apply for the following year/funding cycle.When an AFF database has been set up and is ready to be used, a Reviewer will follow this workflow to review a pending application for funding:1. A Funder invites a member of the community to be a new grant application Reviewer. This invitation could include a link to a Secure Web Form where the Reviewer can create a Reviewer Profile record and create their own login credentials to access the AFF database.2. Once they can log into the system, the reviewer will click on the Review Assignment link to view any applications they have been assigned to review. This will include links to the appropriate applications and Review Scorecard records.3. The Reviewer fills out a Review Scorecard for each application before the review deadline. The Funder will compile all the comments and ratings recorded in the Review Scorecards to make a determination about which applications should receive funding.4. If the Funder has created a review process for reporting, the Reviewer will receive instructions on how to view and review reporting records (see steps 2 and 3).5. During the next funding cycle, the Reviewer will receive instructions on how to log into the system to review the next batch of applications.","title":"An Introduction to Apricot For Funders (AFF)","url":"https://apricot-articles.socialsolutions.com/en/articles/2568527-an-introduction-to-apricot-for-funders-aff"}