{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.\n\nThis is step 2 of 2-step process. Please read this article to learn how to set-up applicants.Once sample users (applicants and reviewers) have been created and profile forms (applicant profile and reviewer profile) have been created in the AFF database, you should create access to these forms via Secure Web Forms.Secure Web Forms allow a person without an Apricot username or password to access one form via a hyperlink on a website or in an email. AFF applicants and reviewers should access their respective profiles forms via a Secure Web Form and then use the embedded User Creation Field to create their own usenames and passwords, which will allow them to access their applications in the future.Secure Web Forms are available to Apricot customers for no additional charge, but the tool must be activated before it is available for use.1. To see if you have the Secure Web Form tool turned on, access the Administrator tab.2. Select \"Apricot Settings\" from the left hand menu.3. Under \"A La Carte Features,\" check to see if Secure Web Forms has been selected.Contact the customer care team if you would like this feature turned on in your Apricot.1. To create a new Secure Web Form, select the Administrator tab.2. Select \"Secure Web Forms\" in the left hand menu.3. Select \"New Secure Web Form\" in the right hand menu.1. Type in the name that will be associated with this Secure Web Form.2. Select a form that will be accessed through the Secure Web Form. This drop down menu will show all Tier 1 forms that have been published. A Secure Web Form must be a Tier 1 form.3. Select a User. Select one of the \"Sample Users\" that were created in the previous article(Setting up Applicants in AFF)\n4. Save record.Once the record is saved, the Basic URL and Embed URL boxes will be filled in. These can be copied and pasted into an email or a webpage, etc. to be distributed to anyone who needs access to the Secure Web Form.When you send out an email with the URL to the Secure Web Form, this is what the recipients will see.Clicking the link in the email will take the recipient to the Tier 1 form that was chosen as the Secure Web Form.The recipient will not have access to any other parts of your Apricot. They will only be able to enter data and save the record.1. Once the record has been saved,\n2. A \"Record Saved\" message will appear, allowing the recipient to close the page or print it.- Choosing Print will open the printer dialog window.- Choosing Close will log them out of Apricot.\nMost problems with secure web forms are caused by one of the following issues:\nThe wrong URL is being used to access the secure web form.\n-Once a secure web form user clicks the Embed URL, the URL displayed in the browser window will be shortened. This URL no longer contain the validation information from the Embed URL and cannot be used by secure web form users to access the site. It is a very common for admins and standard users to provide this shorter URL to secure web form users since it is the URL displayed when admins and standard users are logged in the site.The Embed URL has been altered by a Word program.\n-Pasting the Embed URL into any Word program will add metadata to the link that corrupts the validation process and prevent site access.The URL has been shortened using a URL shortening service.\n-This too removes the necessary validation information needed to access your site.","title":"Creating Secure Web Forms to Access AFF for the First Time","url":"https://apricot-articles.socialsolutions.com/en/articles/2568831-creating-secure-web-forms-to-access-aff-for-the-first-time"}