{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.\n\nAFF is an initialism for 'Apricot For Funders'. This is a specially configured module within an Apricot database for managing grants, scholarships, or other types of cyclical funding applications. It combines the features available in Apricot for data collection with a grant management tool.\n\nThe Application Overview page allows applicants easier access to their grant applications and also allows AFF Administrators to view and fix problems with access for specific grants or specific applicants.1. AFF Administrators will need to change your \"user view\" to access the Application Overview page. Hover your mouse over the user badge in the upper right hand corner and select the name of the user whose applications you would like to see on the Application Overview page.2. Click the My Apricot tab.3. On the left hand menu, select Application Overview.4. Under Application Summary, the number of grants and applications that have been created in your AFF database will be displayed. If any of these are inaccessible to the user you have chosen, they will be detailed in red text.1. Information about each grant is displayed under this large banner.2. Information on the Description line comes from the Grant Tool description field.3. Enrollment End Date comes from the end date associated with the Open phase, which is also outlined in the Grant Tool.4. Status comes from the current phase, also outlined in the Grant Tool.- If a grant is currently open, users can click the text next to Status to create a new application record.5. If an application has been started, clicking the name of the application under Grant Project will take the user to their application record.6. If no applications have been started for a particular grant, \"No applications have been created for this grant\" will be displayed instead.","title":"AFF: Application Overview","url":"https://apricot-articles.socialsolutions.com/en/articles/2571394-aff-application-overview"}