{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.The AFF module can manage the workflow and access for three different kinds of users: funders, applicants and reviewers.Each of these users has their own user account, complete with a username and secure password, that they create themselves. This allows applicants and reviewers access to the AFF database so they can complete applications or submit reviews.Your AFF database should already have a framework in place that allows applicants and reviewers to access it for the first time and create their own login credentials. Any number of new applicants and new reviewers can be added to the system without changing this underlying framework. However, if you find that you need to add a new *type* of user (for example, if your AFF database was set up without a framework for using reviewers), you will need to create a new \"sample\" user in the system.1. Click the Administrator tab.2. Select User/Group Profiles in the left hand menu.3. Select \"User Profiles\" in the right hand menu.4. Select \"New Users.\"1. Add an email address for the sample user. Every user in the Apricot database must be associated with a unique email address, but no one will actually be using this email address to log into the system (AFF users will create and manage their own login information), so you may use a fake email address here if you wish.2. Add a password. Again, a password is required for each Apricot user, but because this is a sample user account, you can add something simple here.3. Add a name that will identify this user account as the sample guest user account.4. Under \"User Type,\" select \"Guest.\"5. Save record.6. When the record has been saved, select \"Go To Search.\"1. Once you have returned to the search menu, select \"Group Profiles.\"2. Select \"New Groups.\"1. Give this group a name that will identify it as a sample guest user group.2. If desired, add a description.3. Save record.1. Once the record has been saved, select \"View Folder.\"1. Hover your mouse over the Actions tab.2. Select \"Create new.\"1. Name the permission set.2. Under \"Assigned Users,\" click the \"Add\" button.3. Add a search field if necessary and search for the name of the sample guest user you created.4. Select the row of data that contains the sample guest user.5. Close the window.6. Save the record.1. Scroll down to the Permissions section and find the name of your AFF forms.2. Grant appropriate access.- Because this is a sample reviewer, we are granting the same permissions we would like extended to every reviewer.- These users will be able to search for and view all the forms associated with an applicant profile and the grant invitation \"Application Intake for Open Grant.\" We have checked the boxes under \"Group RLA Applied\" for these forms; \"Group RLA\" means that we can assign applications and/or applicants to groups, perhaps based on what programs they are seeking funding for, and then we can split our reviewers into group according to their fields of expertise.- These users will be able to search for and view, as well as create and edit all the forms associated with the reviewer profile and the review scorecard. We have checked the boxes under \"User RLA Applied\" for these forms; \"User RLA\" means that reviewers will only ever be able to access their own records that they themselves have created. records they themselves have created.Repeat the steps to set up a sample user for every type of user you need to create in your AFF database.","title":"AFF: Applicants and Reviewers as Users","url":"https://apricot-articles.socialsolutions.com/en/articles/2571235-aff-applicants-and-reviewers-as-users"}