{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.AFF Grant Administrators can access a Grant Dashboard to see a range of details about any of their grants in the system. Use this dashboard as a tool to follow the status of incoming applications and to view problems with user access.1. To access the Grant Dashboard, you must view your AFF site under the Administrator view.2. Click the My Apricot tab at the top of the page.3. In the left hand menu, select Grant Dashboard.4. Select one or more grants from this list of active grants.5. You may also view inactive grants by selecting the Show/Hide Inactive Grants button.1. Information in the top left hand corner will display a Grant Summary with details about this grant as they are set in the Grant Tool.2. A graph will display how many applications are currently in each phase.3. A phase table next to the graph will display the names, start and end dates for each phase associated with this grant.* If these phases or dates are incorrect, please access the grant tool to make corrections.4. If a grant has many phases, you can search the table by typing into the phase search bar.5. Each row in the applications table will display the Quick View fields from the Application Intake form in your AFF system as well as columns for the current Grant Phase, the Completion Status, and the Access that has been assigned to each application.- You can access each application by clicking on the row. Once you have opened an application, an AFF Administrator may make changes to the application records themselves if corrections are needed.6. If a grant has many applications, you can search the table by typing into the application search bar.7. Under the Access column, click the View button to see which users and groups have access to view or create new applications.1. Click the View button and a popup window will display the permissions that have been applied to this application.2. Under \"Current Phase,\" you will see what phase this application is currently in. In the example above, the application has been completed and submitted for review, and is now in the \"Review\" phase.3. Under \"Group Owners,\" you will see the name of any groups of users who have been assigned access to this application.4. Under Grant Application Permissions, you will see which actions can be completed by each group.4. In the example above, users in the Reviewers group can view this application, while users in the Staff and Applicant Users groups can view the record, search for the record, create new records, and edit the record.5. Use the scroll bar on the right side to access more features below.*If there are errors or incorrect application of user permissions on this page, please access the Users/Groups portal under the Administrator tab to make adjustments.1. If specific permissions are granted only during certain phases, those details will appear under \"Assigned Phase Permissions.\"2. \"Record Owner Permission Sets for Grant Application\" lists the name of any permissions sets that govern this application intake form.3. \"Record Owner Permissions\" displays the actions that can be taken by the owner of this application. In the example above, the user who can access this application can view it, search for it, create new records of this form, and edit existing records of this form.*If there are errors or incorrect application of user permissions on this page, please access the Users/Groups portal under the Administrator tab to make adjustments.","title":"AFF: Grant Dashboard for Administrators","url":"https://apricot-articles.socialsolutions.com/en/articles/2571550-aff-grant-dashboard-for-administrators"}