{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.\n\nReviewers AFF is built to manage the workflow and access of three key types of users: Funders, Applicants and Reviewers. Each of these types of users will have a different level of access to the information in an AFF database.A reviewer is a member of the staff or community who reads completed applications that have been submitted by Applicants and makes comments on them to the Funder. A reviewer might be a member of the funder's staff, a volunteer, a board member, a member of the community or an expert in a specific field. They should be people who are qualified to judge applications for funding.Reviewers will be accessing a Reviewer Profile form to set up their contact information. After a funder or administrator assigns applications to them, reviewers will view completed applications and then fill out a Review Scorecard form.Because reviewers will be accessing the AFF database to enter data and submit information to the Funder, they will be added to the AFF database as users. They will have access to their own login information and permission to access specific forms for entering required data and completing their review scorecard records.The AFF database restricts which forms and what kinds of information a reviewer can access, see and edit.If you are setting up a new grant, you may need to create a new \"sample\" agency user in the database where you can outline what forms an applying agency can or cannot see. When a new agency fills out an Applicant Profile form and sets themselves up as a new user, their access will be copied from this sample user.1. To create a new sample user, click the Administrator tab at the top of the page.2. In the left hand menu, select User/Group Profiles.3. Select User Profiles.4. Select New Users.\n1. Create a username and a password for the sample user. You will not really be using this information to log into the AFF database, so you do not need to remember the password.2. Name your sample user. It is best to use a name that will describe what kind of access this sample user will have. When you need to choose a sample user later in the process, this will make it easier to remember.3. Under \"User Type,\" select Guest.4. Save Record. After you save the record, click \"continue\" to stay on the same page and scroll down the page to a section called Assigned Permission Sets.\nNow that we have named our sample user, we need to outline what forms it can access.1. Scrolling down the same page, you will see a section called Assigned Permission Sets.2. Select Add.3. The \"Name\" column will list the groups that have already been created in your database. You may already have a group for applicants.4. To the left of it, select new. This will allow you to create a new permission set for this new sample user you are creating.1. Name your permission set.2. Under \"Permissions,\" you will see a list of all the forms that have been created and published in your AFF database. If you need to allow access to a form that is not listed here, double check that the form has been published.3. At the top, you will see a list of the kinds of access available. A reviewer should *only* have access to view applications and edit review scorecards. There may be several forms for both of these processes depending on what your organization requires from applicants and reviewers. The forms in the example above have been labeled simply as the kinds of AFF forms they represent; your forms may have more specific names according to the needs of your organization.4. When you have finished outlining the permissions, scroll to the top of the page and save your changes.Most organizations who use AFF have their reviewers access the database for the first time with a Secure Web Form.A Secure Web Form is a way to access one blank record in the database via a hyperlink that can be distributed to likely reviewers. When you add a User Creation Field to a Secure Web Form, then anyone who accesses the form can enter their email address and name to create their own login credentials for the AFF database.You will need a separate Secure Web Form for each kind of user you plan to give this level of access to. For example, if you will have applicants and reviewers accessing the database to create their own login credentials, then you will need two separate Secure Web Forms, one for each group.1. To create a new Secure Web Form, click the Administrator tab at the top of the page.2. In the left hand menu, select Secure Web Forms.3. Select New Secure Web Form.1. Name your Secure Web Form.2. Select a form. When you distribute the hyperlink to this Secure Web Form, it will open a blank record of the form you choose here.- If you want a reviewer to use this Secure Web Form to create their own login credentials, the form you choose here must contain a User Creation Field.3. Select a User. Select the sample user you just created.4. Permissions. Once you have selected a form and a user, the system will double check that the user has permissions to see the form you selected. If it does, you will see the text: \"This user can: view, search, create, delete.\" If it does not, you will see the text: :This user does not have permission to view.\" If that is the case, then select the \"Modify User Profile\" text and it will open a window to the user's permission set where it can be edited.5. Save Record.6. Under URLs, you will see two URLs that can be copied and pasted into an email or displayed on a website or otherwise distributed to potential applicants.Reviewers will follow the hyperlink to access a blank record in the AFF database where they can enter their own username and password. Once they save the record, they will be added as guest users with limited access. They will be able to log in to the system and will have access to their specific materials. ","title":"Reviewers","url":"https://apricot-articles.socialsolutions.com/en/articles/2572135-reviewers"}