{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.\n\nAFF's Grant module (see article: Grant) manages the workflow around several key forms (see article: Required AFF Forms) . These forms can be turned on or turned off during specific time periods in a particular funding cycle. Forms that are turned on will be accessible for users to create, edit, and complete.The Applicant Profile form is a Tier 1 form to be completed once by each applying agency or individual applicant (see article: User Applying Agency or Individual Applicant), usually the first time they apply for funding. This form is filled out only one time even if the applicant plans to apply for funding for more than one year or for more than one program. It is similar to a client face sheet or an intake profile in that it contains basic data about the applying agency, like contact information.An Applicant Profile form is required and must be created for the grant tool to operate properly.When creating an Applicant Profile form, include basic information that is not expected to change from year to year or that applies to the agency overall, as opposed to details about a specific program. This could include contact information for the applying agency staff, for example, or general demographic information on the population the applying agency serves.In subsequent years or funding cycles, the information included in the applicant profile form will remain in the AFF system and will not need to be re-entered. It can be updated if necessary, but should not contain any information that is expected to change between one funding application and another or information that should be tracked historically.Other common names for an Applicant Profile type form include: Organization Profile, Agency Intake, Individual Profile, etc.1. When creating a new Applicant Profile form, click the top gear box to open the form properties window.2. Under \"Apricot for Funders Form Type,\" select Applicant Profile.3. Apply.Because the Applicant Profile form is accessed at a particular point in a grant funding cycle, it must contain specific fields before the AFF database will allow it to be published.The Applicant Profile form must contain a User Creation field (see article: Fields: User Creation Field). This field will allow an applying agency or individual applicant to create their own username and login credentials at the time they fill out the form. Once they have done this, they will be able to log in to the AFF database to enter information into their funding application and complete any other required documents.Before an Applicant Profile form can be published, the user creation field will need to be configured. You will need to have a guest user with the same permissions you would like to give your applicants already set up in the system. For more information on this, please see the Help Center section on User: Applying Agency or Individual Applicant.","title":"Form Applicant Profile","url":"https://apricot-articles.socialsolutions.com/en/articles/2576830-form-applicant-profile"}