{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.\n\nError messages that appear on the Application Overview page can be fixed by an Administrator by adjusting phase dates or times, adjusting user access, and manually moving applications from one phase to another. See below for details on each error message and the steps to take to fix it.Every grant application must be connected to a Tier 1 \"profile\" form. More information on how profile forms are used in AFF can be found here.If a user has not created a profile form yet, an Administrator can direct the user to the appropriate form and help them create a new record. For instructions on how to find which form in your AFF database has been labelled a \"profile\" or \"applicant profile\" form, please click here.Generally, the workflow for most AFF applicant users will be that they create their profile from a secure web form which automatically links their profile record to their user record (via the User Creation Field). If you, an Administrator, manually creates their user record and they create their profile form after logging in you will need to manually link their profile to their user. For instructions on how to use link fields in AFF, click here.AFF Administrators can indicate that some grants may be applied once per applicant or applying agency. This error message appears when a grant has been created and the applicant cannot create or submit any additional applications.An Administrator can adjust a grant to allow multiple applications per applicant or applying agency. This is managed through the Grant Tool. For more information on how to use the Grant Tool, click here.Grant applications can be submitted only during an \"open\" phase. This message appears outside of the open phase for a grant.The days and times that manage when a phase is open are controlled by the Grant Tool. For more information on how to use the Grant Tool, click here.When a grant requires an invitation, it is considered a \"restricted\" grant. Grant invitations are Tier 2 forms under an applicant Tier 1.For more information on how to create a grant invitation or remove an invitation from an application workflow, or on how to identify which forms in your AFF has been labeled as a \"grant invitation,\" please click here.This message appears when no applications have been created for an existing grant. If you would like to create a new application for a grant, there are several possible solutions:If the grant is no longer accepting new application, you may need to adjust the phase dates in the Grant Tool. For information on how to use the Grant Tool, click here.If the applicant would like to create a new grant, but they do not have access to it, you may need to adjust user access. For more information on how to adjust user access in AFF, click here (applying agencies).\nThis message generally appears when access to a form needs to be adjusted.\nThis can also happen if the profile record is not linked to the user record (please see title \"A profile form must be completed for this user to access the grants.\" section above for more details)","title":"AFF Application Overview Error Messages","url":"https://apricot-articles.socialsolutions.com/en/articles/2576826-aff-application-overview-error-messages"}