{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.User: Applying Agency or Individual ApplicantApplying agencies or individual applicants exist outside of the funding organization and will be applying for grant funding through the AFF database. \nAn applying agency might be a non-profit organization that is seeking funding. An applying direct service agency may apply for one grant several times or apply for more than one grant at the same time. They will be accessing an Applicant Profile form to set up their contact information and at least one Application Intake form to apply for grant funding.An individual applicant is an individual seeking funding, much in the same way an applying direct service agency might. It could be a person seeking an educational or research scholarship. This person, like an applying direct service agency, will be accessing an Applicant Profile form to set up their contact information and at least one Application Intake form to apply for individual funding.Because applying agencies and individual applicants will be accessing the AFF database to enter data and submit information to the funding organization, they will be added to the AFF database as users. They will have access to their own login information and permission to access specific forms for entering required data and completing their application for funding. They may also need access to the same or additional forms after they have received funding, either to report on how their funds are being used or to apply for the next round of funding.The AFF database restricts which forms and what kinds of information an applying agency can access, see, create, and edit.Applying agencies and individual applicants will access the AFF database for the first time using a secure web form with a user creation field that will create their own login credentials.Once they have done this and logged back into the system for the first time, their access to forms in the database will be restricted so that they will only be able to access the appropriate forms that have been turned on for the current time period in the grant funding cycle, and they will only be able to see what they themselves have created. They will not be able to apply for funding outside of application deadlines or for grants they have not been invited to apply for, and they will not have access to data entered by other agencies or other individual applicants or reviewers. For more information on how to set up access for applying agencies and individuals, see the Help Center section on AFF: Form Structure (see article: Required AFF Forms) and AFF: Managing Users (see article: What is AFF?).","title":"User: Applying Agency or Individual Applicant","url":"https://apricot-articles.socialsolutions.com/en/articles/2576969-user-applying-agency-or-individual-applicant"}