{"content":"Note:Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.In AFF, we use the term \"grant\" to talk about any cyclical funding process. It could be an annual grant, a scholarship, or something else where funds are applied for and distributed on a set schedule.An AFF Grant can have several working parts:An invitation to apply, sent to outside organizations or individuals.An application for funding to be filled out by an outside organization or individual.A reviewer application, where outside members of the community or experts in a field can sign up to review funding applications.AFF uses a specially configured feature called the Grant Tool to manage each part of the grant funding process - when outside organizations or reviewers have access to forms/data collection for each step in the process, what information is collected at different points in the process, and how key persons are kept informed of deadlines and/or submissions of required data/information.When a form or a series of forms has been made required by the Grant Tool - specifically Tier 2 forms that have been created under an Application Intake Tier 1 form - users will be able to fill out and save these forms without necessarily completing every required field on each of the forms.But the Application Intake form and it's associated Tier 2 forms will not be eligible to \"submit\" or perform any of the other Actions governed by the Grant Tool until all the required fields have been completed and saved.As with a traditional Apricot form, you can make fields required. When a field is required on a traditional form, it must be completed before a record can be saved.In AFF, instead of having to fill out every required field before a record can be saved, an applicant must fill out all required fields in an application before the entire application can be submitted or can be eligible to perform any further actions as governed by the Grant Tool.This allows users or applicants to begin an application intake and it's associated Tier 2 records before they have gathered every required piece of information they need to submit the application. They can save an incomplete application and return to it later to add in information at a later date.In the example above, the Date field is required. As in a traditional Apricot form, you can tell it is required because it is marked with an * and there is red text beneath it saying it is required; the Record Save Checklist also indicates that this field is required. But the system will still allow you to save the record without filling out the required fields. The only forms that can be required under the AFF Grant Tool are the Tier 2 records under Application Intake Tier 1 form. When an Applicant looks at their application document folder, like in the example above, required fields will be marked with a red X until they have been filled in by the applicant   2. To complete a required form, you will need edit the form and fill in all \"required\"           fields. In the example above, all the required checks have been completed, meaning that all required fields in all the Tier 2 forms have been successfully completed and saved.   2. The Application Intake may now be submitted.","title":"Grant","url":"https://apricot-articles.socialsolutions.com/en/articles/2576844-grant"}