{"content":"Note:Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.An AFF Funder is an organization that distributes grant funds. It can also be the word used to describe the person who is the administrator of the AFF database who manages user access, grant applications, grant reporting deadlines, and reviewer assignments.Funders, as administrators of the database, do not need to be created as users, like applying direct service agencies and reviewers do. Administrators (see related article: Administrator (User)) already exist in the AFF database as users and already have access to all parts of the database and the The Grant Tool.Managing GrantsA Funder has access to most parts of the AFF database. A Funder can create new grants, as well as add phases and actions to manage access during different parts of a grant cycle.Managing Forms and Records\nA Funder can create forms to serve as applications, user intake forms (like Applicant Profile and Review Profile forms), and review forms (like Review Scorecard). This setting is chosen in the form properties for each form. Forms cannot be chosen for the grant until this property is set. Managing UsersA Funder can manage access for other users, like Applicants and Reviewers. Access for these users is controlled in two places. First, each user is linked to one or more permission set(s), this will outline their available access in the site. Next, the Funder will assign their access in the grant phases and actions, this will control their actual access during the various phases.","title":"User: Funder","url":"https://apricot-articles.socialsolutions.com/en/articles/2577576-user-funder"}