{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.The Grant Tool serves as a hub where Administrators can control when forms are turned on and off within the database, who can access these forms, and the general workflow of each funding application.Every Grant will have at least one \"phase\" and one \"action\" to govern access.Phases outline a period of time, with start and end dates, when different forms are turned \"on\" (can be viewed or created/edited by selected groups of users) or \"off\" (inaccessible to certain groups of users)Actions will determine how sets of forms move from phase to phase.Before accessing the grant tool to create grants, all users, groups, permission sets, and form that will feed into the grant application must be created.1. To access the Grant Tool, click on the Administrator tab.2. On the left hand menu, select Workflow Station, then select Grants.3. Here you can see any grants you have already created.4. You can also access the AFF-specific forms you have created. The Tier 1 forms will be listed; to see the Tier 2 forms, expand the black arrow next to the name of a Tier 1 form.5. To create a new grant in an existing category, select \"Create New Grant.\"6. To create a new category of grants, select \"Create New Category.\"The grant tool is a central place where the forms, access and workflow associated with a particular grant are managed.1. General Info.Name: The name of your grant.Active: Old grants that are no longer being used by your organization should be marked \"inactive\" instead of deleted.Application Intake Form: If you are managing more than one grant, you will indicate which Application Intake form is to be associated with this grant.Allow Multiple Applications per Applicant: Allows applicants to apply more than one time for this grant. An applying agency may be applying for grants under two different programs, for example, or may apply in subsequent years.Applicant Profile Form: Indicates which Applicant Profile type form will be associated with this grant.Grant Type: A restricted grant requires an agency to be invited to apply before they can access the application intake form.Initial Phase: Determines which Phase should start the workflow (this is typically \"open\" or \"application in progress,\" but may be set to something else if the online grant process is launched mid-way through an application cycle).Description: If you are managing more than one grant, it may be useful to include a description.2. Phases: Phases are periods of time when different forms are available for agencies and/or reviewers to access and complete.3. Actions: At the end of each phase, your users can move an application to the next phase by completing an action. An action could be an Applicant \"submitting\" their completed application or an Funder \"re-opening\" an application that has been \"submitted\" by mistake.4. Grant Options: When you are done making changes, you can:Save the grant.Delete the grant. (Only delete grants that have been created by mistake. Grants you are no longer using should be marked \"inactive\".)Copy the grant. This can be useful if you have a similar grant process and want to copy and make modifications to a grant you have already created.Return to the grant list.Phases govern which forms will be available during a time period in a grant funding cycle and which groups of users have access to those forms.1. To add a new phase, select \"Add.\"2. Name the phase.3. Anything typed in the Instructions text box will appear to users as a banner message across the top of the grant application overview folder.4. Set up start and end dates. A phase does not require an end date if you are unsure when a phase should end or if you only want a phase to end when an Action has been completed.5. Select the forms and the access that will available during this phase.Only Tier 2 forms under the Application Intake Tier 1 form will be listed here.6. Select the + sign to add \"Allowed Groups.\" These groups of users will have the access listed above.Administrators always have access during every phase.7. Select an action. An action is taken to move an application from one phase to another. For example, if application materials completed by applying agencies during an \"open\" phase, then they will complete an action like \"submit\" when they are finished filling out the appropriate forms.*There can be more than one action per phase. For example, in the \"review\" phase, there may be actions like \"approved,\" \"declined,\" and \"re-open\" available to the Administrator.Actions are completed by Applicants and the Funder when they have finished any work that is required to be completed during a phase.1. To add a new action, select the Add button.2. Name your action.3. Select a \"new phase.\" When this action is completed, an application will be moved into the phase selected here. An action can only move an application to one phase. If there are multiple phases an application can to go at this point, create multiple actions and add these actions to the phase.4. Message: Anything typed in this text box will appear to the users in a popup window after the action has been completed.5. If certain forms should be required to be completed before this action is taken, or should be locked or unlocked by this action, indicate that using the check-boxes. Keep in mind that these rules will apply to all applications and are not conditional. If they should be conditional, it may indicate that you need to create separate grants.6. Select groups that will be allowed to complete this action. Administrators always have access to all phases and actions. In most cases, only Administrators and applicants will have actions assigned to them.","title":"The Grant Tool","url":"https://apricot-articles.socialsolutions.com/en/articles/2577037-the-grant-tool"}