{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.\n\nAFF's grant module manages the workflow around several key forms. To ensure that the appropriate forms can be accessed by the appropriate users, the grant module interacts with specific fields on each of the key forms used in the AFF workflow.The User Creation field allows people from outside a Funder's organization to add themselves as users to the AFF database.The User Creation field allows the person filling out the record to create a new AFF user account for themselves. The information entered into this field will be added to the list of users who have access to information in the AFF database.This field will need to be configured before the forms that contain it can be published and made available to users. To do this, you need to have at least one sample guest user already set up in the system. The users created with this field will always copy permissions associated with this sample guest user.The User Creation field is required when creating the Applicant Profile form and Reviewer Profile form. This will allow people from outside your organization to choose their own username and password and also give them access to the site and application forms.When an agency creates their Applicant Profile, or when a reviewer creates their Reviewer Profile, they will be required to fill in an email address, which will become their username, and to create a password.Once the record has been saved, this information is added to the list of users who have access to the AFF database and the user will be able to log in to AFF and access their own set of records.\n\nPlease note that this field will only generate a username and password upon record creation, NOT record modification. In other words, if you have already clicked \"Save Record\" without entering a username and password into this field, you will need to archive that record and create a brand new one in order to generate a username and password successfully.","title":"Fields: User Creation Field","url":"https://apricot-articles.socialsolutions.com/en/articles/2577004-fields-user-creation-field"}