{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.AFF stands for \"Apricot for Funders.\" It is a specially configured module within an Apricot database for managing grants, scholarships, or other types of cyclical funding applications. It combines the features available in Apricot for data collection with a grant management tool.The Review Assignments page allows reviewers easier access to their application assignments and also allows AFF Administrators to view and fix problems with access for specific grants or specific reviewers.1. If you are an AFF Administrator, you will need to change your User View to access the Review Assignments page. To do this; hover your mouse over the user badge in the upper right hand corner and select the name of the reviewer whose assignments you would like to see on the Review Assignments page.2. Click the My Apricot tab.3. On the left hand menu, select Review Assignments.4. Under Review Summary, the number of grants and applications that have been assigned to this reviewer will be displayed. If any of these are inaccessible to the user you have chosen, they will be detailed in parentheses.The reviewer in the example above has been assigned one application to review.1. Each large banner displays information about a different grant. Each item under the large banner represents information about one application.2. This information comes from the Quick View marked fields on the Application Intake form.3. To view the entire application, and any reviews that have been filled out, there is an orange \"View\" view button to click.4. The reviewer in the example above has filled out one review for this application. To see and/or edit this review the reviewer can click the row in the table.\n\n5. To see additional administrator details about the access provided to this reviewer, select \"Show Access Details\".1. These links will take you to see Help Center documentation with details on any error messages you might see on this page.- This documentation can also be access by clicking here.2. Information about grants and applications now includes more details about grants that are \"inaccessible\".","title":"AFF: Review Assignments","url":"https://apricot-articles.socialsolutions.com/en/articles/2579627-aff-review-assignments"}