{"content":"For sites where the Apricot Settings page has been configured to Canada format, the fields listed below will appear as part of the Field Choices palette in Form Designer.Open the Form you want to edit in Form Designer.In the Field Choices palette on the right hand side, find the field you want to add to your form.Click and hold on the name of the field, then drag it into the main body of your Form.The Address Lookup field permits the user to enter in part of the address and see a search return possible matches that will fill in the remainder of the Address Lookup fields with correct information and displaying a map of the area. This field has been specially configured to show Canadian address fields.Special Properties:Show Neighborhood: Will show the neighborhood associated with the address entered.Show Country: Will show the country where the address is located.Show Coordinates: Will show longitude and latitude coordinates.Map Options:Default Zoom Level: By increasing the zoom level, you can have the map highlight a very small localized area.Hide Map: Hides the map feature.This field can be made Required, Searchable, Hidden, and Quick View.When you begin typing into an Address Lookup Field, the system will provide you with valid addresses based on what you have entered.You can select a red line of text to fill in the remaining address fields.Once you have finished entering an address, a map of your location will appear. You can turn off the map feature by selecting \"Hide Map\" in the Field properties.This field is used to indicate the postal codes used in Canada. The field consists of two separate text boxes for three letters or numbers each.This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View and as Duplicate Check.This field provides a drop-down menu that displays the names of every Province in Canada for selection. This field can be made Required, Hidden, Searchable, and Locked. It can be used in Quick View and as Duplicate Check.This field is used to collect the Canadian Social Insurance Number. The field consists of three textboxes to be filled with 3 digits each.This field can be made Required, Searchable, Hidden, and Locked. It can be used in Quick View and as Duplicate Check.","title":"Canada: Special Fields for Canadian Apricot Organizations","url":"https://apricot-articles.socialsolutions.com/en/articles/2666773-canada-special-fields-for-canadian-apricot-organizations"}