{"content":"System Fields automatically generate information for each record in Apricot. This data can be helpful for users to search for particular records and allows Administrators the ability to run reports based on unique identifiers. There is a System Fields section on every form in Apricot.The values in these fields are automatically generated when a record is created (some are updated upon record updates). They are housed in a special \"System Fields\" section at the bottom of the form. This section can be moved to a different area of the form and the fields within it can be moved to other sections, but the fields themselves cannot be re-named.The Record ID is a unique number generated automatically by your Apricot system for every record created in the database. These numbers are automatically generated and cannot be changed. This field can be made Quick View, Duplicate Check, Searchable and Hidden.Note: Every record, regardless of form, will have a unique Record ID (it is not possible, for example, for a Client Profile record to have the same Record ID as a Service form).The Modification Date field displays the date and time at which the record was last modified. This updates after every time the record is saved (including updates via imports).This field can be made Quick View, Duplicate Check, Searchable and Hidden.The Modified By field displays the name of the person who last modified the record. This updates after every time the record is saved (including updates via imports).This field can be made Quick View, Searchable and Hidden.The Creation Date field displays the date and time at which the record was originally created.This field can be made Quick View, Searchable, or Hidden.The Created By field displays the name of the person who originally created the record.This field can be made Quick View, Searchable or Hidden.The Assigned Programs field displays the programs that have been assigned to the record.This field can be made Quick View, Searchable, or Hidden.","title":"System Fields","url":"https://apricot-articles.socialsolutions.com/en/articles/2666699-system-fields"}