{"content":"Auto Populate is a Linking field type which enables you to pull data from an originating record onto a different record. Please note that Auto Populate fields require a linking field to work and is an \"action based\" field. For example, an Auto Populate field will not work until you use the linking field to establish the link (you need to tell it which specific record to pull the data from). Just loading a record will not cause the Auto Populate field to populate with data.There are certain scenarios when we would advise to use the Auto Populate feature:You need to create a calculation on one form based on data from a different form and need to see it on a record, not just a reportYou want to physically have data on one form that is also on another formPlease use sparingly as this will cause data-redundancy in your databasePlease reach out to the Customer Support team if you have any questions if the auto populate field is a good choice for your scenarioThe reasoning behind this is because you can use Quick View fields to see the data from the Tier 1 form instead. Additionally, Tier 1 records are directly related to their Tier 2 records and since auto populate fields require a linking field we are creating an additional relationship between the two forms which can make reporting more difficult.Before proceeding we need to discuss linking. Linking creates a relationship between two otherwise unrelated forms. In our screenshot above we see two Tier 2 forms (Dog and Foster). In this scenario we know we will want to populate data from the Dog form onto the Foster formThis tells us we need to create the linking field on the Foster form.This means that the Foster Profile form is the \"Base\" form and the \"Base\" link will be created here\"Target Form\" means this is the form data will be pulled fromNote: While it may be possible in some scenarios to populate data onto a form that does not have the base link we cannot advise this setup and cannot guarantee it will always work.To add a link field to the base form (the form you want to populate data onto), open the form for editing and expand the \"Linking\" option under the Field Choices palette.Drag a Linking field onto the formClick the gear for the linking form. We suggest giving it a specific display name!There will be a dropdown to choose what (target) form you want to link toThe first dropdown there will be a \"1\" in it, we want this to stay 1The dropdown next to it will also have a \"1\" in it, but we want to change it to \"Many\" (This means that 1 Food Record can be linked to Many Order records) Note: 1 to Many is the only option that will work with Auto Populate fields. As you can see above, the linking field will be locked for Auto Populate once published.Click Apply and Publish the form when you're doneNote: If you are linking two Tier 2 records that live under the same Tier 1 we advise to check the Same Folder Linking option in the Special Properties. This means that users will only be able to link within the same Tier 1, for example: a user won't be able to mistakenly auto populate information from Client B into Client A. To add an auto populate field to the base form, open the form for editing. In the field choices palette, expand the black arrow next to \"Linking\" and drag the auto populate field into your form:Click the gear for the newly added auto populate fieldName the fieldChoose the linking field that we previously created.Then, choose the field that you want to pull data fromAuto Update. This is optional and may not always need to be checked. For example, if you always want the auto populate field to show the newest information from the target record you should check this. If you want it to always stay what it originally was, leave it unchecked.Click Apply.Publish.Standard Properties:Auto populate fields can be made Required, Duplicate Check, Locked (read only), Quick View, Searchable, Hidden, and Clear on Copy.Note:  After selecting the Linking Field and Field, Duplicate Check will not be able to be selected until the field is published.Once an auto populate field has been configured and the form has been published, the link between forms cannot be changed. If you need to change the relationship, deactivate this auto populate field, add a new auto populate field, and configure it.If auto populate is no longer desired and you would like to change this field to a static place to collect data, select \"Convert to Static Field.\" The data that has been automatically populated will remain as a static selection, but new data will not be automatically populated from a different form. Note: Careful! Once it has been made static this cannot be undone!If the auto populate field pulled data from a name field, the new static field will become a regular name field. If the auto populate field pulled information from an email field, the new static field will become a regular email field.Auto Update: Select this is you would like the auto populate field to update itself when information in the base form has been changed. Note: The data will refresh and update itself only when a record is opened and saved (if you do not save the record after you open it that newly auto updated value does not stick).Click the \"Add\" option that comes from the Linking fieldA pop up shows up that shows available records to auto populate from. Pick the one you needYou'll notice in this screenshot we have a \"Link Added...\" message. This shows that the link was created successfullyYou'll also see at this time the auto populate fields have been saved inAt this point, you may click the X in the \"Link Added...\" message as well as the search pop upMake sure to click Save Record to save any changesIf you don't want your users to be able to change the values that auto populate into the field, you can Lock the field. It will still auto populate/updateWhen you create the link on the Base form it creates a link on the Target form as well. We advise to Edit the Target form and make the target link Hidden (you can hide the entire section).In order to reference numeric fields which auto populate from another form, bear in mind that they must be fully published before appearing as an option within your calculation fieldWizard Link Warning: You cannot auto populate onto a Wizard Linked form as it contains a target link.Important: At this time auto-populated date fields do not filter correctly if you filter on them as a \"Searchable Field,\" please add the column directly to the report and filter on the column itself within the report.When archiving linked records, Auto Populate fields will retain their values if Auto Update is disabled.Secure fields cannot be used with Auto Populate fields.Related Search Terms: Autopopulate, Auto-Populate, Autopop","title":"Auto Populate","url":"https://apricot-articles.socialsolutions.com/en/articles/2669678-auto-populate"}