{"content":"Sites are a tool in Apricot that is used to separate your Programs (groups of users) into different sites/locations. The most common application for this tool is when an organization has multiple sites/locations accessing the same database.\n\nIn most cases, separating the users from each site will be helpful for keeping the appropriate data available to the appropriate groups of users. Every database in Apricot starts with one site by standard, titled \"Default.\"\n\nMulti-site is only available for Apricot Core and Apricot 360. Please reach out to your Account Manager if you're interested in upgrading!\nNOTE: You cannot delete a Site once created, but you can make it inactive by marking every program within the site as inactive. You can also rename the Site or repurpose the Site later on. If all programs within a Site are inactive, the Site will no longer appear within the Program Badge at the top of your Apricot page. Navigate to the Administrator tab, at the top of your Apricot windowClick the \"Access Control\" drop-down arrow to reveal this category's optionsChoose \"Sites & Programs\" to navigate to your current list of existing sites along with their contained programsClick the green \"New +\" button to create a new site        OR   5. Click the \"eye\" symbol on the right side of the site that you would like to modifyWhen modifying or creating a new site, you will be presented with a page in Apricot that has 4 sections/elements: The Site Details section is where you will list the Name and an optional description for your site.\nThe \"Default\" site that is standard in your database cannot have its name modified.\nYou can modify this section in an existing site by clicking the \"Update\" button to make the fields editable.The Site Location section contains the address look-up field for your site's physical location. When entering an address, the right pane/square will provide a Google Maps view of the address. This entire section is optional. You can modify this section in an existing site by clicking the \"Update\" button to make the fields editable.When you modify a Site, the Programs section is where you can add/remove programs within that site. This is how you will designate which groups of your users belong to your site.\nYou have the ability to add programs to your site using the list in this pane.\nYou also have the options to create a new program (using the green \"New +\" button) or modify your existing programs (using the \"eye\" button next to the program name) from this pane.\nLastly, you can move or copy programs from one site to another using the 3 dots on the right side of each program name in this list.\n","title":"Multi-Site Functionality","url":"https://apricot-articles.socialsolutions.com/en/articles/2670685-multi-site-functionality"}