{"content":"Apricot establishes access to records through Programs and Permission Sets (You can learn more about Programs and Permission Sets in our article Limiting or Granting User Access). The way that Apricot assigns programs for records of a form can be adjusted in the form properties. This article will explain these settings in detail.This setting will enforce that each time a record is saved, the user will be prompted to select which programs are assigned to new records.Click the Administrator tab.Open standard forms and edit the form which needs to be updated. Click into the forms main property gear. In the Program Assignment Type dropdown select the 'User selects program assignment' - this will pop up a window each time a new record is saved that prompts the user to pick a program. Apply the changes.Publish the form.This setting will apply program assignment based on the Form Permissions. Any programs with access to at least view and search records of the form will be assigned to each newly created record.Note: The form will need to have, at minimum, view permissions assigned via a permission set from a program in order to be able to assign it to that program, regardless of the program assignment setting.Note: After record creation, program assignment cannot be changed by updating form permissions and re-saving the record. Program assignment will have to be manually adjusted via the Program Access button on the right side.This setting will assign records of the form based on the User's active programs. This means that the linked permissions of the User determine which programs are assigned upon record creation. If a user saving a record is linked to a permission set in each program in your Apricot, the record will be assigned to all programs. When saving records as an Administrator using this setting and working in the \"All Programs\" view, records will be assigned to all programs. If this occurs in error, a site Administrator will need to adjust the program assignment for any impacted records. Please see the next section to understand how this can be corrected. This scenario is explored in more detail in our article Creating Records as an Administrator.In some cases Administrators will need to adjust access to records. One example is that if the form is set to assign records to the user's active programs and an Administrator saves a record while working in the \"All Programs\" view, the Administrator may want to then remove some of those program assignments.1. Click the My Apricot tab.2. On the left hand menu, select the form you would like to use.3. Expand the black arrow to select a search field. Your goal at this point is to narrow down your search results to exactly the records you would like to assign so pick a value that will indicate to you which program the record should be assigned to.1. When you have narrowed your search results so that the page only shows those records you want to assign,2. Select Program Access.1. Select the program(s) to which you would like these record(s) to be assigned. Please Note: For tier 2 records you will see a dropdown in this popup which allows you to select any tier 2 forms that have been used as search fields in your records search. You must choose the specific form you are adjusting access for.2. Owner: This field will establish access restrictions based on the feature User Record Level Access. If you do not use this level of access restriction, you can ignore this field. To find out more, take a look at our article on User Record Level Access (User RLA)3. Click Add4. Click Apply.\n\nYou can also update program assignment at the record level: To update Program access for an individual record, this can be done from the record itself:1. Open the record that needs to be updated and click the Program Access button in the 'Assigned Programs' menu on the right.2. From the Assigned Program popup window, add or remove Programs as needed. 3. Click Apply and save the record.","title":"Program Assignment Settings","url":"https://apricot-articles.socialsolutions.com/en/articles/2694975-program-assignment-settings"}