{"content":"This guide will walk you through how to use the Apricot Workflows module.\n\nThis functionality is designed to assist with user navigation. Workflows will guide your users from one task to the next as they fill out records. New buttons and navigation palettes will be displayed on records and provide information about which task a user is completing, if the task is required or optional, and how to get to the next task.\n\nThe Workflow Builder allows an Administrator to create a customized list of tasks for users to follow. You will be able to use Apricot’s drag-and-drop function to add new tasks and reorder the list. Once a new workflow is published, it will be available for users to follow when they enter data.\n\nThis tool helps your users with data accuracy and will provide an easier way to understand how to get around in Apricot.To find published workflows that can be used to enter data, navigate to the My Apricot tab and select My Workflows.Note: The starting step to a Workflow should not be utilized in a navigation bulletin. This causes a workflow to be unable to function. Workflows should always be started from the My Workflows link under the My Apricot Tools dropdown.Expand a Category and Select Start from the Actions tab.\nYou will be taken to the first task in the workflow you have selected.\n\nSometimes this is a new Tier 1 record.Sometimes the first task will be searching for an existing record.Once a record has been filled out, new navigation options include a “Save and Next” button to take you to the next task in the workflow.Or select save and see a new popup message. “Continue” will reload the page if further edits need to be made; “My Workflows” will allow you to save your progress and select a new workflow to follow from the My Workflows page; “Next” will take you to the next task.A new palette on the record will also show you how many steps you have completed. Tasks with a * are required and must be completed in the correct order. Optional tasks can be skipped and filled out later, as needed.\nTasks with a green check-mark indicate that they have been completed.If you have left an incomplete workflow, you can continue your progress by selecting it from the Workflow History table.\nClick on My Apricot tab, then click My Workflows, and select Workflow History. You can search the list by Workflow Name, User name, Date or Status. To select a workflow instance, click a row in the table and you will be taken to the last task that was completed.A workflow is considered “complete” when all the required tasks have been saved.\nThe last popup message will show you that you have finished the workflow and give you options of returning to the Workflows list to select another.Administrators can create their own new workflows with the Workflow Builder.\n\nNavigate to the Administrator tab and select Workflow Builder.\nIf you don't already have a Category in your Workflows, you will need to create one. You will be able to create a new Workflow once you have at least one Category.Create a new Workflow and give it a name.The right-hand palette will show you a list of available forms that can be added to a workflow. All published forms can be added to a workflow.Drag and drop the form into the workflow to make it into a task for a user to complete.\n\nThe first task must always be a Tier 1 form, and the Record Action must include \"Create\". Tier 2 forms can be added to a workflow after their parent Tier 1 form has been added. Other forms can be added if they are linked to each other from the Form Designer.\nKeep in mind that you may only create 20 tasks per workflow. If you attempt to add an additional task after 20, Apricot will give you an error and not allow that task to be created. Make Tasks Required or Optional\n\nTasks can be required or optional. Required tasks must be completed in the prescribed order for them to be counted in your workflow progress. Optional tasks can be skipped or completed out of sequence.\n\nClick the gear box to open the Task options.\nYou can add notes to each task. Notes will appear for users during data entry at the top of a record. Notes can be used to include instructions for when a task in a workflow should be filled out, when it can be skipped, or why a user is filling out this record.You have the option to require your users to create a new record on a workflow task. This is helpful if you are creating a workflow for new clients or to record new services.\n\nTasks can also prompt a user to edit existing records. When you set a task to “edit existing record,” the task will become optional.\n\nTasks can also be marked as “create or edit” records. This will allow your users to search for an existing record to edit, but allow them to create a new record if one does not already exist.When you have created a workflow in the right order, publish the workflow. This will make it available to users for data entry.Sometimes a user will begin their data entry the old way – by navigating to the record they want to fill out. When this record is the first task in a workflow, Apricot will prompt the user to join a workflow once the record has been saved.\nWorkflow and Referrals\n\nWhen a site has enabled Referral tools, a referral can be added to a workflow as a task. When a workflow contains a referral task, the user will be prompted to refer the record they are working on at a certain point in a workflow. Workflows are considered “in progress” until a referral has been accepted.\n\nFor more information on Referrals, please view our article on the topic, Referrals*IMPORTANT NOTE*After a workflow has been published the order of steps listed can be changed.  These can be changed at any point even after the workflow has already been used.If these steps are changed, and the workflow is republished, then any prior workflow marked as  \"In Progress\" will be marked as \"Invalid,\" and can no longer be completed.  Any workflow marked as \"Completed\" will be marked as \"Completed and Invalid.\"You do not need to worry about the data within these workflows, as it is still intact, but none of these invalid workflows can be completed.  A new workflow will have to be started.","title":"Workflows","url":"https://apricot-articles.socialsolutions.com/en/articles/2700505-workflows"}