{"content":"Note:Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.\nIntake allows an administrator to reference specific fields from a Tier 1 Form and an associated Tier 2 form in order to create a limited-access version of the form(s) that can be filled out by those without Apricot log-in credentials. This allows for multiple intake applications to be created from the same form(s) by including only the fields relevant to the intended audience for the application (i.e. child intake versus adult intake could have different questions).In order to create an Intake Form, you will first need to choose a Tier 1 Standard Form in your database that you plan to reference. If you do not already have a Tier 1 Standard Form created to capture the desired information, you should first create the standard Tier 1 form. For more details about standard forms, click here.Some fields are not yet supported, for a list of these items please review our article Apricot Connect: Supported FieldsYour Standard Form's properties must have a Program Assignment Type of either \"User selects program assignment\" or \"Assign records to user's active programs\" to work properly as an Intake FormSelect the Administrator tabClick the \"External Access\" drop-down. If you do not have this drop-down or the \"Intake Forms\" option is missing, you may need to contact your account manager to discuss whether or not this feature is available for your organizationChoose \"Intake Forms\" to be brought to the Intake Forms listHere, you will see a list of any Intake Forms you've already created and/or publishedYou can use the \"Create New Form\" button to create a new Intake Form from the existing Standard Forms in your databaseThe options in this box accomplish the following tasks (from left to right)Link: show the link that can be used to fill out this Intake Form - this is the link you will provide to any applicants/participants completing this formRetract: this is where an administrator can make this form no longer valid to be completed via the link provided. This can be used to make modifications to the form or simply stop it from being used by any participants who have received a link to complete this formPreview: you can preview the Intake Form in the format which those completing it will seeEdit: modify the Intake FormDelete: delete the Intake FormOnce you've chosen \"Create New Form\" from the Intake Forms list (as seen in the above steps), you will be presented with the following prompt\nIn this window, you can name your Intake Form and choose which Tier 1 Standard Form it will initially reference for its fields. Both of these fields are required in order to move forward.\n1. The largest section of this page shows the form's title (as visible to those completing this form), a description, and all of the fields currently in this form. It's important to note that your Intake Form will automatically include all of the fields that are required in your Standard Form(s) being used. The appearance and order of these fields can be modified via this section.2. The Program Enrollment drop-down is where you will choose the program into which records of this form will be saved. There are 2 important notes for program enrollment: If you do not choose a program here, records created via this form will only be visible to administratorsIf you choose a program that is not valid for the Tier 1 (and associated tier 2 forms) referenced in this Intake Form, form submission will failIf your Standard Form does not use a supported Program Assignment Type you will see this error under Program Enrollment:Change your Standard Form's assignment type to either \"User selects program assignment\" or \"Assign records to user's active programs\" and publish the form to fix this error.3. Form Designer Choices: this is where you can choose additional fields from the referenced standard form(s). These fields can be added by dragging them into the form section on the left, in the location/order of your choice\n\n4. From this bar, you can cancel your changes, preview the form with your changes, or save the changes you've made so far5. Attach Tier 2 Form: from here, you can attach an associated Tier 2 form that is nested beneath the Tier 1 Standard Form you've chosen to start this Intake Form. This will allow you to add fields to this Intake Form from the one of the Tier 2 Standard Forms in order to simultaneously create a Tier 2 record along with the Tier 1 record created by those completing this form. If you add a Tier 2 Standard Form, you can add fields from the Tier 2 by choosing \"Tier 2 Form\" in the drop-down below \"Form Designer Choices.\" This will reveal all field choices from the Tier 2 form you've attached, and the fields from the Tier 1 will not be shown in the list unless you switch the drop-down back.Your tier 1 form fields and and tier 2 form fields cannot be mixed together. The Intake designer will only allow you to put tier 1 fields in the first part (top) of the page and tier 2 fields can only be placed below those.In order to modify a field in your Intake form, you can hover over the field to reveal a pencil symbol in the top-right corner of the field. If you click on this, you can then make modifications to the field using the edit field pane on the right side of the page. You cannot type straight into the form fields in the left section of this editor.Alright! You've added your desired fields, titled your new Intake Form, and you've saved! Time to take the final steps to start using it.\nYour form must be saved before it can be published. If you haven't saved it, the \"publish\" button will not be clickableJust like any Standard Form in Apricot, your Intake Form needs to be published before the changes will be live in the client-facing version of the form. Make sure it's in working order before publishing!Once you choose publish, you'll be presented with this message which provides the URL which you can distribute to anyone who needs to complete this form!\nAs mentioned in the message, you can display it on a kiosk, email the link to potential participants, or place the link on your website!\nIf you need to find this link again after publishing, you can click the \"form URL\" button on the Intake Form editor page.If you need to make any changes to your live/published Intake Form, these changes will immediately take effect in the same URL as soon as you hit save!'Choosing to retract the form will make the form no longer available for clients to complete, but the form will still be available for an admin to edit and republishDeleting the form will remove the Intake form completely from both the URL you've distributed and the editor. Records previously created by this Intake Form will still remain intact in your databaseNote: Intake Forms will not enforce the inactivity timeout setting that you have applied to your Apricot site.","title":"Apricot Connect: Intake Forms","url":"https://apricot-articles.socialsolutions.com/en/articles/2736307-apricot-connect-intake-forms"}