{"content":"Apricot provides the ability to create different sets of users who have access to different kinds of forms and records. A user can belong to more than one Program. Below, we will walk you through the steps to switch a user's view from one Program to another.A \"program\" in Apricot is a collection of users who serve the same or similar functions in an agency. A program might be all the users who have Administrator privileges, for example, or all the teachers or volunteers. Or it might be all the employees or users who work at the same location. When we create a \"program\" of users in Apricot, we can customize what those users can see or what kinds of information they can access in the database. Maybe you have a set of teachers who should have access to information about children being served in a funding program - but only those children who are enrolled in one teacher's particular class. Or you have a team of volunteers who are assigned to work with only clients enrolled in one specific location.By restricting access allowed for certain \"programs\" of users, we can simplify the amount of information that shows up - perhaps fewer clients or fewer forms will be available to one program, which can streamline their workflow.Information about \"programs\" can be accessed at the top of any page in Apricot by clicking on the grey pencil (CHANGE) next to the user badge at the top of your Apricot screen. 1. To change to a different program, click on the grey pencil icon next to the user profile picture at the top of any Apricot page.2. All the sites and programs you have access to will be listed here. We will switch to the Program A.Now we have switched to the Housing Program and we can see that our access has changed.We no longer can see the Apricot Bulletins that were available before.If you do not have access to a part of the Apricot database that you believe you should have access to, double check that you are currently in the right program.For more information on adding or adjusting access for users and/or programs, please see the Help Center section on Managing-Users-and-Access.","title":"Viewing Records by Program","url":"https://apricot-articles.socialsolutions.com/en/articles/2742035-viewing-records-by-program"}