{"content":"An Apricot database is equipped with security measures to stop users from entering the exact same information in two different places. This is called \"duplicate check,\" because the system automatically checks the information that has already been entered to find any duplicate entries. More information on duplicate check can be found here.1. When you begin to fill out a record with information that already exists in the database, a warning message will appear. This means that the database has recognized the information you are entering into the record already exists in the system.2. If you would like to add information to the record that has already been created in the database, right-click on the green text in the columns to open the existing record in a separate tab.3. If you believe you are entering unique information that should be added to the database, select Alter Current Record.This will allow you to return to the record and change the information in the fields that have been marked as \"duplicate check.\"1. Duplicate check fields are identified by a small double square icon to the right of the field name.2. Once you have made corrections to the information so that it is unique, you will be allowed to save the record.Name fields check the First, Middle, and Last portions of the field. Therefore, Johnny Joe Smith is not the same as Johnny Smith. This will not trigger the duplicate check warning.If you have multiple duplicate check fields on the form, they will work together. For example, let's say you have 3 duplicate check fields and enter the following information into a record: Name: Jack Smith Date of Birth: 06/10/1995 Phone: 555-555-5555Now, lets say you try to enter the following information into a separate record: Name: Jack Smith Date of Birth: 06/10/1995 Phone: 555-333-3333The Duplicate Warning will not go off because the phone number is different. All 3 duplicate check fields would need to match in order for the warning to appear. Some fields may not be a good fit for duplicate check fields.Duplicate Check fields can be placed on Tier 1 and Tier 2 formsIf you Allow Copies, Duplicate Check fields will always clear upon copy","title":"Troubleshooting: Duplicate Record Warning","url":"https://apricot-articles.socialsolutions.com/en/articles/2742018-troubleshooting-duplicate-record-warning"}