{"content":"Archiving removes records from your Apricot database. The data in archived records will no longer be accessible to users or show up in reports or search results. Records that have been archived in error can be permanently deleted or restored by an Administrator.Archiving and restoring records works differently for Tier 1 and Tier 2 Records.First locate the record you would like to archive. To locate a Tier 1 record,1. Open the My Apricot tab.2. Click on Search Records on the left hand menu to expand.3. Select the form from the left hand menu.4. Add a search field, if necessary, to locate the record you want to archive.5. Type into the search field to narrow your search results.\n\n6. When you have located the row of data that contains your Tier 1 record, click on the green text to access the Tier 1 directly.1. Once you are in the record you would like to archive, click \"Archive Record\" in the right hand menu.2. Confirm.\n\n**When archiving a Tier 1 record, ALL of its associated Tier 2 records will be archived along with it**-If you have duplicate Tier 1 records and would like to avoid this, we suggest using the Document Folder Merge Tool to bring all Tier 2 records under one of the remaining Tier 1 records.***Only Apricot Administrators may archive Tier 1 records.***To locate a Tier 2 record,Open the My Apricot tab.Click on \"Search Records\" on the left side menu to expand.Select the form from the left hand menu.Add a search field, if necessary.Type into the search field to narrow your search results.When you have located the correct row of data, click the gray text to open the Document Folder.In the Document Folder,1. Expand the plus icon next to the name of the form to see the available records that have been filled out.2. Select a record and click on it.1. Select \"Archive Record\" in the right hand menu.2. Confirm.For instructions on deleting a record entirely from your archives, click here.","title":"Archiving Records","url":"https://apricot-articles.socialsolutions.com/en/articles/2742050-archiving-records"}