{"content":"When a report is built, it may include filters to refine or narrow down what data is pulled from the database. Depending on how they have been added to the report, some filters can be edited by users when the report is run.A filter is what the Apricot Report Builder uses to restrict or reduce the amount of data pulled from the database. If you have records for thousands of clients but only want to see people who came in for services in the last week, you need to filter your data to remove the clients who did not come in for services last week.The example above has a filter for \"Gender\". By applying the filter, we restrict how many records we are looking at in our report. Filters can be locked or left open for editing when the report is built. A filter with a pencil icon next to it is available to be edited. To edit a filter, click the pencil icon next to the filter you would like to edit. Under \"Rule,\" the first drop-down menu will give you a list of all the columns that have been pulled into the report. The filter will look at all the data in this column when it is applied to your report. Select a column to apply a filter.The second drop-down menu will give you the list of ways to filter the data. If you select \"Equals\", values must be spelled exactly as found in the form. If you do not know the exact data you want to filter, as in a drop-down with many options, you can use \"Matches Any Option,\" which will give you a list of values, or \"Contains\" which will give you broader options.1. Once you have set up the rule for the filter, you can add a value. In this example, we have chosen the \"Status\" column to \"match any option.\" Below the filter, options that are available in the \"Status\" column are displayed. Select an option (in this case, Active or Inactive.)2. Click Apply.1. To add a new filter, click the \"+\" sign to the right of the filters list.2. Filters can be deleted if they have been added by a user when a report is run.Note: Filters cannot be deleted if they have been added by the Administrator when the report was built.Like a Filter, Global Values can be locked or left open for editing when the Report is built.To edit a Global Value when you run the Report, click inside the box and enter new parameters.Once you have changed this Value, it will update any Filters that reference it.1. To use a Global Value, it must be added to a filter. Administrators may have already added a Global Value to a filter during report design. Users can also add a Global Value to a filter at run time. Open a filter for editing and under Options, select \"Global.\"2. Now, instead of giving you the option to enter your own values, the filter will ask you which Global Values you would like to reference.3. When you are finished, click \"Apply.\"4. Filters that reference Global Values always have brackets or [ ] around their values so they can be identified. For more information on creating reports in Apricot, please see the Help Center section on Building-Reports","title":"Filtering Reports at Run Time","url":"https://apricot-articles.socialsolutions.com/en/articles/2742072-filtering-reports-at-run-time"}