{"content":"Training VideoTurning on MFA: Navigate to Apricot settings – this feature is located at the bottom of the Security sectionAdmin activates for the sitePlease note 30 days is the minimum that can be set for \"Days Before User Must Reauthenticate Remembered Device\"Once activated, all users (including guest users) will be prompted upon login to set up their MFA settings User Setup:\nFrom the User badge in the top right, click User PreferencesAuthentication options are located in the Multifactor Authentication sectionUser can verify by either text or emailUser will be prompted to verify their account as seen belowRemembered Device: Apricot will only remember one deviceWhen a user first logs in OR the user logs in from an unknown device, they will be asked if they would like to update their remembered device after verifying the accountAuthenticating the account:User will be prompted to authenticate their account when they either login from an unknown device or when the number of days have passed as set by the site's \"Days Before User Must Reauthenticate\" settingValidation code will expire in 30 mins but can be resent as needed with the “Resend code” option We use a 3rd party integration to send emails (not texts) through Apricot on your behalf called SendGrid. Customer Support can check to see if an email was sent, but SendGrid only saves email logs for 7 calendar days so you must contact us within that time for us to check. We cannot provide direct access to SendGrid. You may need to inform your recipients that they might need to whitelist the following email address if the emails are going to their spam folder: noreply@socialsolutions.comNOTE: This functionality is currently only available to US clientsYou are entitled to 2500 authentications (via SMS or email) per month at no additional charge. Authentications must be used within the month provided - no rollover will be permitted. Additional message packs may be purchased at any time. If you exceed the allotted number of messages in one month, the minimum available additional message pack(s) necessary to cover the overage will be added to your account and you will be invoiced in arrears. You acknowledge that the carriers or service providers for message recipients may charge fees for data usage or messaging.","title":"Multifactor Authentication","url":"https://apricot-articles.socialsolutions.com/en/articles/2751161-multifactor-authentication"}