{"content":"Apricot's Report Builder offers a wealth of report features and functions to support sophisticated reporting needs. Combining complex funder reporting requirements with sophisticated reporting features may lead to large reports with many sections and levels of analysis, all of which can impact how much time it takes for a report to load.There are several ways to accommodate the need for comprehensive reports while providing a positive experience for those running or modifying the report.Consider your audience and tailor the level of detail accordingly. Only show what is necessary.Open the section gear box.Adjust settings under Display Style:Hidden will hide the section of the report when it is run. If the section is only providing information for a summary section, hiding it is a way to hide the work going on in the background.Graph Only will display only a graph and not any of the rows of data.Totals will display only the results for columns that have been set to a summary style like Total or Average. Individual rows of data or records will no longer appear. Click the gear for the sectionChoose \"No\" for \"Auto Run (Edit Mode)\"Choose \"No for \"Auto Run (Run Mode)\"Choose ApplyYou can apply this setting for the full report using the report properties at the very top of the page: Exporting a report instead of running it can be a good option for users on a less than optimal internet connection or on an older computer. This allows the user to work with the information in Excel or Open Office rather than their web browser.Limit the size of a report to around ten sections.\nNote:  If you are using limits or aliases then you are adding one additional section to the report in the background per limit/aliasGood:The above screenshot is a good example of a report configured in a streamlined way. Each form is linked (as indicated by the fact that each is indented), and each is set to be \"Always\" required. Bad:The above screenshot shows a report that is trying to pull in too much unrelated data. This report will more than likely time out. Since the tier 2 forms are not linked, the rows for that data will be duplicated. Since each form is set to sometimes, the report will include a row for that client whether or not they have information saved into each tier 2.Instead, reports on unrelated data should be built into separate sections, or if data is related but not actively being linked, links should be added to the forms.","title":"Strategies for Success With Large Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/2882987-strategies-for-success-with-large-reports"}