{"content":"Red error messages like the one in the example above can appear when you are building a report. Your report cannot be edited, published or run until you remove this error message. One of the most common reasons for an error message is a \"broken filter.\"Filters are added to reports to narrow down the data that is displayed in the report. More information on report filters can be found here: Filtering-Reports.If the last thing you did in the report builder was try to add or adjust a filter, then it is likely that this is why you are seeing a red error message. Removing a filter can sometimes fix the problem.To remove a filter, click the green text of your filter.When the window opens, select \"Delete.\" Another reason for an error message is broken filter logic.Filter logic tells the report how to run the filters you have added. Filter logic only appears when more than one filter has been added to a report section. More information about filter logic can be found here.If the last thing you did in the report builder was try to adjust the filter logic, then it is likely that this is why you are seeing a red error message. To fix the filter logic, remove the last filter you added and then re-add it to the report section.Click the green text of the filter.When the window opens, select Delete. Red error messages can appear for other reasons. Common problems and solutions are:Your report was built with information from a form that was changed - most commonly this is because a field on a form has been removed or deactivated. When a report depends on a field in a form for the data represented in the report, removing the field will create an error message. Please read your error message carefully - in most cases, you can republish your report and it will automatically remove the column related to the field that was removed from the system. In some cases, however, republishing may wipe out the rest of the information in the report and you will have to start rebuilding it from scratch.You added a custom expression to a column in your report. To fix this problem, open properties by clicking the gear box on the column where you added the custom expression and delete the custom expression. This usually means that the syntax of your custom expression was typed incorrectly into the text box and will need to be corrected or re-written.You deleted a Limit or Alias section. Although the system allows you to delete these sections directly from the section they should be removed be removing them from the Form Properties of the report builder. Do not directly delete them as you would a normal report section. This can also result in a \"GUID\" error. For more information about Limits, click hereIn the event you have gone through all the above steps and still cannot determine the source of the error message, please attempt to Revert the report. Reverting will cause the report to return to it's most recently published state and any changes or edits that have been made to the report will be lost. If the error is still occurring after attempting to Revert, please reach out to Support. It is important to note that in many cases attempting to Revert will be one of the first steps taken by Support. ","title":"Red Error Message When Editing Report","url":"https://apricot-articles.socialsolutions.com/en/articles/2883044-red-error-message-when-editing-report"}