{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for data entry, allowing you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations who provide services to survivors of domestic violence.These instructions outline the process for entering information about a new client who is coming in for services for the first time. You will search the database to make sure your client has not already been entered into the system, create a new Client Profile record for your client, then enroll your client in services by filling out a Program Enrollment record, then detail what specific program or service your client is receiving today.Go to https://apricot.socialsolutions.com1. Enter your username.2. Type password.3. Login to Apricot.To enter information on a new client, you will need to find and open a new \"client profile\" record. Each AVS database has a form that is dedicated to collecting demographic or \"face sheet\" information about each client receiving services. The name of your forms may be different than what is being shown in the example above; if you do not have a form called \"Client Profile,\" please ask your database Administrator the name of the form that collects this kind of data.1. One way to find your client profile records is to click the button under \"Welcome to AVS\" called \"Client Profile Search.\"2. Another way is to look on the left hand menu and click on the client profile form.Both of these options will take you to the same place.This is the Client Profile search page. From here, you can search for an existing Client Profile record or create a new Client Profile record.Before you create a new record, you should search the database to make sure a record has not already been created for the person who is coming in for services.1. To search the Client Profile records that have already been saved in the system, expand the black arrow next to \"Add a Search Field.\"2. Select an option from the drop down menu. If you know the client's name, it is probably easiest to add the Name field, but you can add any field listed here and you can also add more than one field if you think that would be helpful.1. Type in the name of the client. As you type, the database will return relevant results.2. In this case, none of the records in the database match the name of our client. This means she has not been entered into the system before and a client profile record must be created for her.3. On the right hand menu, select \"New Client Profile.\"Every client in the system must have a client profile record; this is how the database keeps track of the people who have been enrolled in a program or who are receiving services. A client profile record is like a face-sheet - it collects demographic and similar kinds of data that are unlikely to change over time: name, date of birth, social security number, gender, race, etc. After it has been saved, it can be updated if your client changes their name or provides new information they did not have when they initially came in for services.1. Some fields on this form are marked with a double apricot icon. This indicates the field is a \"duplicate check\" field - the database will automatically take the information you enter into these areas and match it against other records that have already been created. If you are trying to create a record for someone who already exists in the system, you will be notified and directed to the previous record. You will not be able to save this record until it contains unique information in each of the duplicate check fields.2. Some fields on this form are marked with an asterisk *. This indicates the field is \"required.\" Required fields must be completed before you will be allowed to save the record. These fields have been marked as required because they are necessary pieces of information to collect on every client who comes in for services.3. On the right hand menu, you will see a list in red text showing the remaining required fields that still need to be filled out. You can click on these and the screen will scroll down to the required fields.4. When you have finished entering information, click Save.Once a record has been successfully saved, a pop- up window will give you the options to:- Continue: You will remain on the same page. If you have additional information to add to this record or need to correct an error, select Continue.- View Folder: You will be taken to this client's document folder. If you are satisfied with the information that has been entered into this client profile record and would like to move on to enroll this client into services, select View Folder.- Go to Search: You will return to the Client Profile search page. If you have more client profile records to complete for more new clients, select Go to Search and repeat the previous steps to search the database and create another new client profile record.For our purposes, we will select View Folder where we can enroll this new client into specific services.This is the default view of the Document Folder for our new client. . You can see the tier 1 form's Quickview data in the left panel in the Overview tab.Every client in the system has a document folder just like this where you can see at a glance what services or programs they have participated in.In the Quickview panel in the \"Overview\" tab, you can see the client's name. Click the + icon to expand \"Quick View Information\" and see a sampling of data that was entered into the client profile record we filled out for her.Click the \"Document Folder\" tab to see a list of all the additional forms we can fill out for our client. (The screen shot below may not accurately reflect the actual forms in your site.)Each form in the Document Folder serves a different purpose and collects a different kind of information. Many of these forms were carried over directly from an older software called Alice and may not be part of the standard workflow for your organization - your site Administrator can remove these from the database so they no longer show up if that is the case. The most commonly used forms, and the forms that you should retain, are: Program Enrollment, Services and Bed Enrollment.The Program Enrollment form should be filled out each time a client returns to enroll in a new program. If she is coming in today to stay in the shelter, she should have a Program Enrollment record filled out for her today to indicate what her current needs are. If she returns in a month looking for counseling, then a new Program Enrollment record should be filled out for her then. Each Program Enrollment record allows you to indicate what immediate needs she has or why she is seeking services at this particular time.The Bed Enrollment form is filled out one time for each continuous shelter stay. If a client is coming in to stay in the shelter, you will fill out a new Program Enrollment record first, followed by a Bed Enrollment record. When she leaves the shelter, you will edit the existing Bed Enrollment record and fill in her exit date.The Services form collects data on other services you provide to clients. The names and types of services were brought over from Alice and might be unique to your organization. If a client is coming in for group therapy or another service recorded on the Services form, you will fill out a Program Enrollment record first, followed by a Services record.3. To create a new record, hover your mouse over the Actions tab and select Create New.\nWhile the client profile form collects data that is unlikely to change much over time, the information collected in the program enrollment form is more like a current snapshot of what is going on with your client today. This information might and probably will change between visits or over the course of time.1. Like the Client Profile form, this form also has \"required\" fields indicated by an asterisk *. Notice that the Service Start Date field is required but the Service End Date field is not - when a client comes in for services, enter their start date, but not their exit date. When they leave services, you will open this record again and record their exit date at that time.2. This form will change what kinds of information are required depending on the answers you fill in. Under \"Program Type,\" if you select Residential, the form will ask you for pertinent information for clients who require a stay in the shelter. If you select \"Hotline,\" the form will instead ask for information relevant for persons calling in on the hotline.3. When you have completed this record, select Save Record. In the pop-up window, select View Folder.\n1. If your organization collects HMIS or HUD data, scroll down to the bottom of the page to the section labeled HMIS Background.2. Click the \"New\" button.This will open a new HMIS Background form that will need to be filled out.1. Fill out today's date.2. FIll out the \"Status\" field.- Entry should be marked if the client is entering services at this time.- Update should be marked if the client has already been in services for some time and is continuing to receive services.- Exit should be marked if the client is completing or leaving services at this time.3. Enter information for all required HMIS fields. These fields will be noted with an asterisk *.4. When you have finished entering new information, select \"Store Linked Record.\" This will save the information in Apricot and return you to the program enrollment record you have been filling out.\n1. Scroll down to the bottom of the page to the section labeled HMIS Income.2. Click the \"New\" button.\nThis will open a new HMIS Income form that will need to be filled out.1. Fill out today's date.2. FIll out the \"Status\" field.- Entry should be marked if the client is entering services at this time.- Update should be marked if the client has already been in services for some time and is continuing to receive services.- Exit should be marked if the client is completing or leaving services at this time.3. Enter information for all required HMIS fields. These fields will be noted with an asterisk *.4. When you have finished entering new information, select \"Store Linked Record.\" This will save the information in Apricot and return you to the program enrollment record you have been filling out.\n1. When the HMIS Background and HMIS Income forms have been completed, you will be returned to your program enrollment record. Select Save Record.2. Once the record has been saved, you will be given the option to Continue, View Folder or Go to Search.- Continue: You will remain on the same page. If you need to correct any of the information on the Program Enrollment, select Continue.- View Folder: This will take you to the client's document folder where you can fill out records about specific services.- Go to Search: This will take you back to the Client Profile search page. If you have more new clients to enter into the system, select Go to Search.For our purposes, we will select View Folder and continue to fill out records with information on specific services.After saving our information in the Program Enrollment record, we returned to the client's document folder.1. Now Program Enrollment says \"1 record\" because we created and saved one new Program Enrollment record. Click on the green plus icon and information about that Program Enrollment record will be displayed.2. Because this client has requested residential services, next we are going to create a Bed Enrollment record. Click on the gray plus icon to the right of Bed Enrollment to enter the Bed Enrollment form.This is a Bed Enrollment record for our client. One Bed Enrollment should be completed for each shelter stay (as opposed to one record for each night of shelter).1. You will be asked to select a \"Program Enrollment\" for each Bed Enrollment record you create. This will connect your Bed Enrollment record to the Program Enrollment record you previously created. Make sure you select the correct date from this drop down menu - in this case and possibly in most cases, we are filling out this Bed Enrollment record on the same day we created the Program Enrollment record, so you will be looking for today's date or the date they most recently came in for services.2. Fill out Check-In Date but leave Check-Out Date blank until the client has left the shelter. At that time, you will open this record again and fill in their Check-Out Date.3. When you have completed the relevant information, select Save Record. In the pop-up message that appears, select View Folder.After saving our information in the Bed Enrollment record, we return to the client's document folder.1. In addition to one Program Enrollment record, you can now see that we have one Bed Enrollment record.2. If your organization also asks you to fill out a new Services record - or any other form under the \"Additional Documents\" section - you can do that next. Click on the gray plus icon to the right of the relevant form and to create a new form.3. Otherwise, you are finished creating a new enrollment for a new client in the system. From here, you may use the top menu to:- Edit the Client Profile: You can enter or update information on the Client Profile record that has been created for this client.- Return to Search: Return to the Client Profile Search page to create a new Client Profile record for another new client or search for the records of a different existing client.- Print Records: A print screen will appear according to the browser protocols for your internet browser. It will allow you to print this page or to export this information into a .pdf document.- Copy Records: If you need to create another client profile record with similar information to this client (perhaps for members of her family), you can create a copy.Record History: This will display any edits or changes that have been made to the records belonging to this client.","title":"Entering a New Client in AVS","url":"https://apricot-articles.socialsolutions.com/en/articles/2913476-entering-a-new-client-in-avs"}