{"content":"One of the functions of an Apricot Administrator is to design or maintain the forms used for collecting information in the Apricot database.The information below is a general overview of the form design elements available to an Apricot Administrator. For more detailed information on how to create a new form or how to configure it for your specific needs, please see the Help Center section How to Design Forms: Table of Contents.The Apricot database is built on a tiered framework.Tier 1 is the word used to describe a \"primary\" or \"parent\" level form. Every Apricot database has a collection of Tier 1 forms used to collect information.Examples of Tier 1 forms might be client facesheets, student intake forms, volunteer contact information, donor records, etc. Tier 1 forms are listed on the left hand menu under the My Apricot tab where they can be accessed by users.Tier 2 is the word used to describe a \"secondary\" or \"child\" level form. Most Tier 1 forms have accompanying secondary or Tier 2 forms.Examples of Tier 2 forms might be details about services delivered to clients, forms regarding a particular class a student is registered for, a list of events a volunteer has assisted with, records of any thank you notes or gifts sent to a particular donor. Tier 2 forms can be found by opening the document folder for the related Tier 1 form.Fields are added to forms to create places in the database to collect particular kinds of data. Apricot has a menu of different kinds of fields, many of which are specially designed to collect a specific kind of information.Settings can be adjusted on each of the fields added to a form in Apricot. When a field is set to be \"required,\" that means information must be entered into this field before the record can be saved.Making important fields required can help guarantee that your users are always recording the information you need in the database.\nDuplicate check is a way to ensure your users are creating unique records when required and not duplicating data that has already been entered into the system.When a field is set to \"duplicate check,\" the database will double check all other entries in the same field on the same form to make sure that your users are not re-creating a record that already exists. In most cases, when a record does not pass the \"duplicate check\" test, the users should be instructed to edit the existing record rather than to create a duplicate in the system.More information on duplicate check fields can be found in the Help Center section on Duplicate Check.Each Tier 1 form in Apricot is connected to a search page, allowing users to search the existing records before they select one to edit or create a new one.Fields that have been set to \"searchable\" are available on the search page. Users can type criteria into a search field and the database will return any matching search results.On each Tier 1 search page, available records are represented by rows of data in a table. The columns that appear in these tables are determined by the fields on the form that have been set to \"quick view.\"When the most relevant fields have been set to quick view, they can make finding the right records on the search page an easier process. Tier 2 Quick ViewTier 2 forms will display the first 6 quick view fields in the document folder.  Click the green plus icon to reveal the tier 2 records and the values in their quick view fields.\n","title":"Design Forms","url":"https://apricot-articles.socialsolutions.com/en/articles/2915548-design-forms"}