{"content":"Duplicate Check is an optional setting for data entry fields. Fields marked as \"duplicate check\" will be compared across the system when a record is filled out and saved, to ensure that duplicate records are not created. Records that are identified as duplicates of existing records cannot be saved until the information on the new record or the existing record is changed to be unique.Duplicate Check used to be reserved for Tier 1 forms and records, but with the Apricot 6.4 release, Administrators also have the ability to set fields on Tier 2 records as duplicate check as well. When a Tier 2 form contains duplicate check fields, records will be checked against all other records of the same form within the same Tier 1 document folder. 1. To access duplicate check on a Tier 2 form, open the green gear on a field.\n2. Select duplicate check.\n3. Every field selected as duplicate check will also automatically have \"Clear on Copy\" checked.\n4. Apply.\n5. Each field marked as Duplicate Check will be marked with a double square icon.6. Note: If the Duplicate Check is gray and not available to select, be sure Allow Copies is unchecked on the Tier 2 form's Form Properties. 1. When a duplicate check field is filled out with data that is not unique, a Duplicate Record Warning will appear.\n2. The warning will display the other record with the same information in the duplicate check fields.\n3. Users have the choice to click the link to the existing record or alter the values in the current record.If a form contains more than one duplicate check field, information will need to be unique in the combination of all duplicate check fields on the form.Best practice is to have no more than two or three fields set to Duplicate Check on any one form.Duplicate Check on a Tier 2 form is compatible with the following fields:addresscurrencydatedecimaldropdowndropdown datedynamic checkboxesdynamic dropdowndynamic numberdynamic textemaillikert scalemasked dropdownmasked radio buttonmilestones/goalsnamenumericphoneradio buttonsocial security numberstatetexttimewebsitezipRecord CopyBatch Record CreationRegistration GridAuto populate fields","title":"Duplicate Check on Tier 2 Records","url":"https://apricot-articles.socialsolutions.com/en/articles/2915814-duplicate-check-on-tier-2-records"}