{"content":"Apricot's Report Filter is designed to generate customized results to fulfill a variety of reporting needs. When more than one filter has been added to a report section, you will have the option to modify how and when those filters are run.1. Clicking into the box below \"Filter Logic\" allows you to customize how the filters run.In the default setting, the Filter Logic is set to run all the filters on all the data - it will only show results that qualify after all the filters have been run on the data.The default in filter logic is \"1 and 2 and 3 and....\" applying all filters onto the report. This means that all three conditions must be met for a record to show up on the report.Changing \"and\" to \"or\" will mean that the report will show results that have at least one of the filtered answers you are looking for. Parentheses clarify the \"or\" condition between the filters to create more complex conditions.2. Once your filters have been set, publish your report.This report on client demographics is being filtered in three ways:Gender Identity Matches Any Option FemaleRace Does Not Match Any Of CaucasianAge is Greater Than 10Let's Walk Through Some Examples\nIf we set the filter logic as \"(1 or 2) and 3\", the conditions that need to be met are:\n1 and 3: Female AND over 10\nor\n2 and 3: Nonwhite AND over 10\nSo the filter logic here essentially asks the report to show all females over 10 and all nonwhite clients over 10. If we set the filter logic to \"1 or (2 and 3)\", the conditions that need to be met are:\n1: Female\nor\n2 and 3: Nonwhite AND Over 10\nSo the filter logic here essentially asks the report to show all females and any nonwhite client over the age of 10. \nIt is important to consider the conditions you set in you filter logic to make sure the report generates the information you need it to. \nFor more information on Reporting in Apricot, please see the Help Center section on Building Reports.","title":"Filter Logic (Reporting)","url":"https://apricot-articles.socialsolutions.com/en/articles/2933691-filter-logic-reporting"}