{"content":"When creating new forms it is often difficult to determine the best form structure. This article will teach you best practices and contains some commonly asked questions. Tier 1 forms are primary or parent forms. A Tier 1 form might be an intake form, client cover sheet, organization profile, or staff profile. The purpose of Tier 1 forms is to collect data that is not expected to change over time or to collect data that only needs to be kept up to date, such as names, emails, phone numbers, etc. Each entity will have only one Tier 1 record; this will serve as their document folder which will hold all the Tier 2 records. Tier 2 forms are secondary or child forms that live under a Tier 1 form. They capture data likely to be filled out multiple times for individuals or to maintain historical data. A Tier 2 form might be used to track program enrollment and exit, maintenance requests, case notes, or goals - it is a place to put data that shows a snapshot of a situation that might happen several times, change, or need to be updated over time.Should the address be tracked on the Tier 1 record?In most cases the address will be tracked on the Tier 1; however, if you will need to access historical address information in reports, this should be tracked as a Tier 2 under the Tier 1 form. If you do not need to report on the data, you can track this on the Tier 1 form and view the historical data through the 'view history' record option. Should programs be tracked on their own Tier 1 form or should they be tracked on an Enrollment Tier 2 form under the Intake Tier 1?If you need to track data on the program as an entity, such as site locations, it should be given its own Tier 1 form that links to the Enrollment form. If you only need some data points, such as the program name, this is best tracked on the Tier 2 Enrollment in a dropdown field.Can I change a form from a Tier 1 to a Tier 2 or vice versa?No, forms cannot be updated in this way. You can request that the support team make a copy of the form but some fields, such as links, will need to have their properties re-set, and no records will be transferred over.For more information specific to form creation, check out our article titled Creating Forms.","title":"Tier 1 Forms versus Tier 2 Forms","url":"https://apricot-articles.socialsolutions.com/en/articles/2939742-tier-1-forms-versus-tier-2-forms"}