{"content":"The Apricot Secure Web Form tool allows Administrators to create a direct URL, or web address, that bypasses the standard login and allows a user to directly access a Tier 1 form for data entry. Secure Web Forms allow individuals such as potential volunteers, donors, or service recipients to submit a request for more information or to complete an application directly in Apricot without having to log into Apricot or requiring that an application be manually entered into the database. For information on how to create a new Secure Web Form, click here.To test your secure web form you should completely log out of Apricot first. Then, you should test it in an \"Incognito window\" (CTRL+SHIFT+N in Chrome) or \"Private Window\" (CTRL+SHIFT+P in Firefox) as well. If you do not, you may run into some errors where you will no longer be able to test it or you may even be locked out of your Apricot. To fix this, you'll just have to clear your browser's browsing data (cookies, cache, temporary files, etc):Click the Chrome Menu button in the upper right hand cornerChoose \"Settings\"On the settings page click on \"Show advanced settings...\"1. Click the \"Clear Browsing Data\" button2. You can choose any option in this dropdown as long as it covers the time period for when you tested the secure web form. If you are unsure, you can choose \"the beginning of time\"3. At the minimum you will need to check the following boxes:-Cookies and other site and plugin data-Cached images and files-All others are optional and can be tailored to your needs. If you only select the 2 minimum required than you will also retain your browsing history, saved passwords, etc.4. Choose \"Clear browsing dataClick the Firefox Menu buttonChoose \"Options\"Click on the \"Privacy\" buttonClick the text that says \"Clear your recent history\"1. You can choose any option in this dropdown as long as it covers the time period for when you tested the secure web form. If you are unsure, you can choose \"Everything\"2. You may need to click the Details button to see more if you cannot see what's in the following step (some may not need to click on this)3. At the minimum you will need to check the following boxes:-Cookies-Cache-All others are optional and can be tailored to your needs. If you only select the 2 minimum required than you will also retain your browsing history, saved passwords, etc.4. Click on \"Clear Now\"","title":"Cannot Load Secure Web Form","url":"https://apricot-articles.socialsolutions.com/en/articles/2939773-cannot-load-secure-web-form"}