{"content":"Hovering the mouse pointer over an Actions tab reveals links which can be used to create new records, edit existing reports, or create new forms. A Dropdown Actions Palette option has been added to the document folder to allow easier access for users with screen readers or who navigate pages by the tab key.The Palette Dropdown is available outside the document folder and applies to the Administrator features as well as the My Apricot areas of Apricot.1. Select the Administrator tab at the top of the page.2. On the left navigation panel, select Apricot Settings from the Workflow Station.3. Scroll down to the Accessibility section, find the \"Actions Menu Dropdown\" and select \"Palette Dropdown.\"4. Save settings.1. Hover over the user badge in the upper right hand corner.2. Select User Preferences.3. Under \"Actions Menu Options\", select \"Palette Dropdown.\" Save settings.To edit a Tier 1 form with the Form Designer using the Palette Dropdown1. Select the Administrator tab at the top of the page.2. In the left navigation panel, select Standard Forms under Form Designer.3. Select a Tier 1 form from the Modify Forms panel on the right side of the page.4. Leave the \"Tier 2\" dropdown blank.5. Select \"Edit Tier 1.\"This will open the Tier 1 form you have selected for editing.To edit a Tier 2 form with the Form Designer using the Palette Dropdown,1. Select the Administrator tab at the top of the page.2. In the left hand menu, select Standard Forms under Form Designer.3. Select a Tier 1 form from the Modify Forms panel on the right side of the page.4. Select a Tier 2 form from the \"Tier 2\" dropdown.5. Select \"Edit Tier 2.\"This will open the Tier 2 form you have selected for editing.To edit a report with the Report Builder using the Palette Dropdown1. Select the Administrator tab at the top of the page.2. In the left navigation panel, select Reports under Report Center.3. Select a category from the Category dropdown in the Modify Reports panel on the right side of the page.4. Select a report from the Report dropdown in the Modify Reports panel on the right side of the page.5. Select \"Edit.\"This will open the report you have selected for editing.To run a report from My Reports using the Palette Dropdown1. Select the My Apricot tab at the top of the page.2. In the left navigation panel, select My Reports.3. Select a category from the Category dropdown in the Access Reports panel on the right side of the page.4. Select a report from the Report dropdown in the Access Reports panel on the right side of the page.5. Make your selection from the following:Run: This will run your report.Print: This will open your report in Print mode.Export: This will take you to a page where you can make export selections.Edit: If you have access to the Report Builder, this will open the report for editing.","title":"Accessibility Actions Menu","url":"https://apricot-articles.socialsolutions.com/en/articles/2965805-accessibility-actions-menu"}