{"content":"Apricot Core and Apricot 360 Administrators now have the ability to register and unregister their program participants through the use of Connect capabilities within Apricot. Participants of an Organization’s Program now have the ability to manage their demographics though Connect.Connect Includes on the Administrator's Side:Participant Type ManagementParticipant Account ManagementParticipant PermissionsTier 2 capabilities Multiple participant typesConnect Includes on the Participant Side:Email notifications upon registrationLog in credentials to the PortalAbility to update demographicsTier 2 capabilitiesConnect is a mobile-friendly, easy-to-access feature that allows participants to apply for services, view and make updates to select information and gain a deeper understanding of their progress through the organization’s programs. This feature is designed to alleviate some of the administrative workload from day-to-day operations and give participants increased access to services and insight into their progress and achievements.Using Connect's Administrator FeaturesParticipant Type: This is a high-level view of the participant type and the registered/unregistered participants in Connect within that Tier 1. NOTE: When you create a new Participant Type, you will not be able to change which Tier 1 form is assigned to that Participant Type retroactively, nor will you be able to archive or delete the Participant Type. It can, however, be renamed and repurposed. The fields used to map names and emails must be in unhidden sections.Registered Participants: This view shows which participants within that Tier 1 are registered. This view also shows which of these registered participants are enabled and disabled.Unregistered Participants: This view will show you which participants are currently unregistered.Enabled: This will display the number of participant spots you have used. There is no limit to the number of Participants you can enable in a Participant Type.Edit Permissions: Admin ability to change participant view/edit settings. Clicking the Edit Permissions button will allow you to configure the permissions for your participants.Age Restriction: Notification for potential underage participantsNote: When registering or enabling participants in Connect, please limit to 1,000 at a time (subject to change). If exceeded, it may constitute email abuse by Amazon Web Services and may result in not all registered/enabled participants receiving welcome emails.Apricot Connect | PermissionsPersonal Info: Here is where admins can adjust permissions for what participants can view and/or edit.View/Edit: Admins have the ability to mass select view and edit options as well as individually adjust settings for detailsForm Permissions: Admins have the ability to mass select view and edit options as well as individually adjust settings for tier 2 formsUpload Logo: Admins have the ability to upload a logo for their organizationParticipant’s View URL: The URL to provide Participants to log in to Connect Using Connect as a ParticipantOnce an Apricot user has enabled your Participant account, click the link in the email to be registered in Connect.Note: Connect Invites are only valid for 30 days\nLogin Screen: Participants will now see an updated look when they go to login to their Connect account \nAvailable Forms: Participants will be able to quickly see what forms they have available to them.\nAccount Information Page: Participants will see the above UI updates. These fields are dynamic, so if a participant does not have access to update Personal Information that section will not appear and the Account Password box will adjust to fill in that space. Connect pages become inaccessible to Apricot users.Administrators or Standard Users given Connect Admin Role will not see Connect in the left side nav in the Admin Tab. Note: Connect will not become read only. All pages will be removed from the interface.Intake forms inaccessible to participants. Error shown.Connect accounts inaccessible to participants.Participants can still access login page; but cannot access account. Error shown.Any forms attached to a Direct Message inaccessible to participants. Error shown.What Happens when Connect Access is restored?Apricot Support will re-enable Connect for the organization.Administrators or Standard Users given Connect Admin Role will see all Connect pages in the interface.Connect URLs are live for participant action including: Intake forms, Connect accounts, Previously sent, incomplete forms attached to DMsAbility to create accounts, publish intakes, send DMsNote: Connect will log participants out due to inactivity after 1 hour.Some fields are not yet supported, for a list of these items please review our article Apricot Connect: Supported Fields","title":"Apricot Connect","url":"https://apricot-articles.socialsolutions.com/en/articles/2992543-apricot-connect"}