{"content":"An Apricot Administrator user can specify how long a Standard user can be logged into a session in the Apricot database and how long it will remain open before the system logs out a user.An Apricot database is a secure place to store data; it is protected by several layers of security - for example, requiring users to have an account and a password set up in the system before they are allowed to access any of the information contained within it. However, if a user logs in and then leaves their computer unattended, that can increase vulnerability.By defining the length of time a session can be open but inactive before a user is automatically logged out, you can increase the system's security.\n\nPlease note that activity is defined in a very specific way by the system - keystrokes do not count as activity. If you are entering data into something like a case notes form which requires spending a lot of time on large text entries, it is best practice to click \"Save Record\" periodically during this time.1. To access the System Inactivity Timeout controls, click the Administrator tab.2. In the left hand menu, select Apricot Settings.3. Under Security, find System Inactivity Timeout. This cannot be set any lower than 15 minutes.There is no upper limit to what an Administrator can type into this box, but if your Internet browser has its own timeout limit, that limit will override anything indicated within Apricot. Google Chrome, for example, has a session timeout of 120 minutes; even if you type 150 minutes into this box, your users will be logged out after 120 minutes.4. When you are finished, select Save Settings. The above message appears if a session has been left inactive longer than the defined System Inactivity Timeout limit.If the logged-in user returns to the computer and wants to return to their Apricot session, they can enter their password and click the Continue button. They will be returned to the last Apricot page they had visited and will be allowed to save any work that had been entered prior to the timeout.If a different user would like to log in with a different username and password than the user who is currently logged in, they can click Return to Login Page to login.*Note: If this happens, any form with non-saved data will be lost and you will not have the option to save the record. ","title":"System Inactivity Timeout","url":"https://apricot-articles.socialsolutions.com/en/articles/2992299-system-inactivity-timeout"}