{"content":"Training videoDocument Folder - This tab will display all the associated tier 2 records that have been createdTip: Hold down the CTRL key on your keyboard when clicking on records in the document folder to open them in a new tab!Links - This tab details any links to the tier 1 record (Does not include links to tier 2 records within the folder)Quick View Information - Expand to see any additional quick view information that has been set within the tier 1 form\nAppointments - This will allow you to see any appointments that have been set up for the client using the Apricot Schedule featurePrint -Clicking this button will allow printing of the full document folder or any subset of records thereinMore Options -Click here to find the options to create a referral (Only available to Core and Apricot360), copy records, or check the Record Audit details specific to the client.Create Referral - Clicking here allows users to refer clients to additional programs within your ApricotCopying Records from the Document Folder- Records from one Document Folder can be copied to another Document Folder through the Copy Records tool. This is useful for records that might apply to Tier 1 records, but weren't created through the Batch Record tool. Or it can be used when records need to be moved from the Tier 1 record they were associated with at the  time of creation to a different Tier 1 record. Note: \"Allow Copies\" must be checked on the Form Properties if you want to be able to copy the records of a form. It is important to note that the Copy Records tool only creates a copy of a record; it does not remove the original record. Within the Document Folder you wish to copy records from, click on the ellipses in the upper right corner of the page to view options, andSelect \"Copy Records\"This will pull up a Client Profile Search which will allow you to select the other client folders you want the records to be copied to. Click on the name (or the grey plus sign) of the clients whose folders you wish to copy records to.You can verify your selection by checking the names are correct under the \"Selected Tier 1 Records\" section to the right of the page. Select the drop down of records you wish to view in order to copy.Click the copy icon to the left of the record you wish to copy.Confirm that you wish to copy the Tier 1 records to the associated programs. After you confirm, a \"Records Copied\" message will appear, detailing which records were copied into which Document Folders.\n\nNote: If any fields on these forms were marked \"Clear on Copy,\" those fields will be copied as blank. Duplicate Check fields will also be cleared out. Important: It is possible to create records via copy that have no data in them at all. For example, if you have \"Clear on Copy\" set for every single field on a form (which is possible) and then a user uses the copy record function, that record will have no data in it at all. We highly advise that you instruct all users who will use the Copy Record function to always check all copied records after they were copied to ensure no \"Clear on Copy\" fields that should have data in them are blank.","title":"Document Folder","url":"https://apricot-articles.socialsolutions.com/en/articles/3021520-document-folder"}