{"content":"If you would like to print a Tier 1 record and all of its associated Tier 2 records instead, that function can be accessed from the Document Folder.To access a Document Folder, click the My Apricot tab at the top of the page.Click on \"Search Records\" in the left hand menu.Select the name of the Tier 1 form you would like to access. This will open the search page associated with the form.If necessary, expand the black arrow to the right of Add Search Field to search these records.Click the row of the record you would like to open*Note: If you add search criteria and click on the green font, it will open the Tier 1 record instead of it's Document Folder. 1. This Document Folder contains an overview of the Tier 1 record...2. ...and access to all of the associated Tier 2 records.3. To print the Tier 1 record and all of its associated Tier 2 records, select Print from the upper right corner.Print options are available for both the Tier 1 record and each of the Tier 2 records.1. Expand the dropdown to select how much of the Tier 1 record to print.- All Client Profile Info: will print the entire Tier 1 record.- Just Quick View: will only print the fields of the record that have been set to Quick View.- No Client Profile Info: will not print any information from the Tier 1 record.2. Expand the green \"+\" next to the name of the Tier 2 form to access options.3. Print all of the records associated with a form, or...4. ...select which records to print.5. Select Print.Note: The identifying field listed under the Tier 2 forms when you are choosing records to print will reflect the field that was chosen as the Record Name Field in that Tier 2's Form Properties menu.If you choose to print only the quick view fields from the Tier 1 record, this is what will appear in the print view.Information listed under \"Quick View Information\" will be taken from the fields on the Tier 1 form that have been set to quick view. They are in order according to their placement on the form.Instructions for changing the fields that have been set to quick view can be found here: Standard Properties for FieldsOnce the print view has opened, select print options.- Show Empty Values: will print fields that have not been filled in on the record.- Enable Record Page breaks: will print each record on a separate page.- Enable Section Page breaks: will print each section on a separate page.- Shrink to Fit: will shrink field width to allow them to fit onto a printed page.- Expand All: will expand all sections of a record so that none are collapsed.Your record will open in a print view according to your internet browser protocols.","title":"Print Records From Document Folder (New Doc. Folder UI Update)","url":"https://apricot-articles.socialsolutions.com/en/articles/3040290-print-records-from-document-folder-new-doc-folder-ui-update"}