{"content":"Social Solutions Global, Inc. (“SSG”) takes comprehensive measures to ensure that data is kept safe, confidential and recoverable in the case of a disaster. Social Solutions’ office sits behind a firewall which extensively controls, tracks, and reports access to our internal infrastructure. Our software meets current HUD Domestic Violence, HMIS, and Social Security Administration data management and security protocols, as well as minimum required FERPA and HIPAA standards.Apricot® uses usernames and passwords to prevent unauthorized access and torestrict user access within the application. Each unique user account is assigned access to programs and permission sets to restrict access to data and features in the system. Customer data is housed in two locations (U.S. at https://apricot.socialsolutions.com and Canada at https://apricotsoftware.ca) based on the location of the client. Data is stored using redundant AWS hardware technologies, SSG fault tolerant software, and journaling file systems.Social Solutions uses state-of-the-art equipment and technology to safeguard the confidential nature of your data. Your data is automatically encrypted while in transit between your computer and our servers as well as while in the database. Users access Apricot® software web application servers via secure HTTPS connection.Our SOC 2 Type 2 (SSAE18) report is a comprehensive document that describes Social Solutions security controls in the domains of Administrative, Physical, and Technical security. Apricot is certified SOC 2 Type II compliant. SSG security controls are reviewed by independent external auditors during audits for our SOC compliance.Each of our servers is individually governed by a system that is designed to prevent unexpected Internet data from being processed by our server software. IDS, virus scanning, automated system checks, and remote logging guard against unauthorized access. AWS implements electronic surveillance and multi-factor access control systems to secure its data centers. Data centers are staffed 24x7 by trained security guards, and access must be strictly authorized. Multiple availability zones allow Apricot to remain resilient in the face of most failure modes, including natural disasters or system failures. In case of a disaster in our main AWS region, Social Solutions will have Apricot up and running between 24-48 hours in a backup AWS region.24/7/365 monitoring of up-time across the infrastructureRedundant water, power, telecommunications, and internet connectivity to maintain continuous operations Uninterrupted power supply to reduce possible service outagesKeep daily backups for 12 months SOC 2 Type IIHIPAA Assessment Type ISOC 1/SSAE 16/ISAE 3402 (formerly SAS70)SOC 2SOC 3PCI DSS Level 1 ISO 270012More info herecan be set to have a minimum lengthcan be set to contain non-alpha-numeric characterscan be set to expirecan be locked after a set # of invalid login attemptscan be changed by a local administratorare not displayed upon entry and are encrypted","title":"Apricot Security and Hosting","url":"https://apricot-articles.socialsolutions.com/en/articles/3059187-apricot-security-and-hosting"}