{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.The instructions below will outline the different areas of the AVS database and what each is used for.Once you have logged into the AVS database, you will be taken to the main landing page or dashboard. Many parts of the database can be accessed from this page.Across the top of the page are tabs: My Apricot and Administrator. Note: If you are a Standard User (not an Administrator) you will not see \"Administrator\" In the upper right hand corner is the user's identification badge. This identifies the name of the person who is logged into the system as well as their current group.Under \"Search Records\" on the left hand menu, you will see a list of the main forms used for collecting data. If you need to find someone who has been entered into the system or you need to add more information to the database, you will do it here.Under \"My Apricot Tools\" are links to reports, bulletins, shared files and aggregate reports.The center of the page is devoted to \"bulletins\" or announcements from your Apricot site administrator. The standard AVS database provides a bulletin with buttons for common data entry points. These bulletins can be customized by your site administrator and yours may contain information unique to your organization.\n\nNote: depending on how your Administrator has customized your AVS, it might look different. Please contact your organization's Administrator for any clarification. Clicking the My Apricot tab at the top of the page will return you to this landing page from any point in the database.Administrator tabClicking the Administrator tab at the top of the page will open design elements and site controls for Administrators. If your user account does not provide you access to these controls, you will see a message informing you that you do not have the required access. Or if you have limited administrator access, you may see a few of the options in the example above, depending on your access.Your user identification badge will remain the same as it appears on the My Apricot tab.The left hand menu lists Administrator functions, such as form design elements, report building capabilities, user management, etc.Special Administrator bulletins are available under the Administrator tab. These are published by the Apricot Customer Care team and often offer details about upcoming or ongoing training opportunities. Clicking the Customer Care or Help Center tabs will take you to the Apricot Support Portal. Here you can access a variety of resources for Apricot. User Badge1. Your user identification badge resides in the upper right hand corner of the screen. It shows:- The name of your organization.- Your user name.- The name of an access group, if applicable.- Your picture (optional - set by your Administrator).Hover your mouse over the gray arrow to reveal available options.2. If you are a site Administrator, you can switch to a different user account view. This can be helpful to check access available to other users.Note: No matter which user view you switch to, the system will continue recording information about data entered into the system as accomplished by you with your own name and user login information. Switching to a different user view will not change who is logged in to the system.3. Access User Preferences.4. You may change or update your password.5. You may log out of the database. User Preferences Adjust your time zone. This will affect the system fields on each record, like \"Creation Date and Time\" or \"Modification Date and Time.\"Expand the black arrow on one of the drop down menus to access the available color options.Note: anything marked \"Site Setting\" will have the appearance chosen by the Administrator for the entire Apricot site.Only users with access to some of the features on the Administrator tab will see options for changing the appearance under the Administrator tab.Once you have made your selections, click Save User Preferences. Under \"Search Records,\" you will find a list of the main forms used for collecting information in the AVS database. A standard AVS database has the forms as listed in the example above; your database may have different forms listed here.Clicking on the form names will take you to the search page for that form.Here you can search the database for any records that have been created of this particular form.You may also create new records of this particular form.*More information on searching for records can be found in the Help Center section AVS: Searching for Records.   1. Under My Apricot Tools, you will find links to:- My Reports: A list of reports that have already been built. Reports pull information out of the database.- My Bulletins: A list of bulletins as they appear on the landing page or dashboard.- My Shared Files (optional): If your site Administrator has enabled the process to share downloadable files, these can be accessed here.- My Aggregate Reports: Like the list under \"My Reports,\" My Aggregate Report shows a list of aggregated reports that have already been built.2. If you click the My Reports link, you will be taken to the My Reports list. These are all the reports that have been built and published in your system.3. Expand a black arrow next to a heading to see the available reports. Some reports have a \"lock\" icon next to them, meaning that they can be run and viewed, but the data that feeds into them cannot be edited or changed.4. When you find a report you want to run, hover over the Actions tab to the right of the report name.5. You can select:- Run: Your report will run and show you results as they have been built into the report.- Print: You can print the report or export the report as a .pdf file.- Export: You can export the results into an excel spreadsheet.- Edit: If you have access to edit a report and it has not been locked with a \"lock\" icon, you can edit what information is being pulled from the database to create the report. The main area of the dashboard or landing page in Apricot is devoted to bulletins. These are announcements that can be created by your site Administrator to distribute important information.Standard AVS bulletins include this section \"Welcome to AVS!\". It includes buttons that link to common areas of the database.Some bulletins may be \"collapsed.\" To expand a bulletin, click the white arrow to the right of the bulletin heading.\n","title":"Walking Through AVS for New Users","url":"https://apricot-articles.socialsolutions.com/en/articles/3082665-walking-through-avs-for-new-users"}