{"content":"The Apricot Imports tool allows information pertaining to multiple records to be entered and saved at one data entry point, eliminating the need to manually create individual records. It can be used to transfer data from Excel files or from a historic database into Apricot.After you have completed an import, you can \"revert,\" or undo, it and remove the records or links you have imported.To access the Imports tool, click the Administrator tab at the top of the page.In the left hand menu, select Imports.This will display all the forms that have been used in an import. Expand the black arrow next to the form name to see all the imports that have been started or completed.Hover over the Actions menu and select open to view the Import Overview page of the import you want to revert.Optional: If this list is too long, it can be filtered by dateOptional: It can also be filtered by how far along in the import process it was when it was stopped. Import IconsAn import that has been successfully completed - meaning that rows were inserted into the database - will be marked with a green success arrow.An import that failed - usually because of errors in the uploaded .csv file - will be marked with a red x.An import that was reverted will be marked with a z icon.An import that was uploaded but never taken through any of the import progress steps will be marked with a red icon.An import that was uploaded and walked through some but not all of the import progress steps will be marked with a pencil icon.This yellow alert icon means that some rows in the .csv file contained errors and were not imported.Note: Only imports that have been successfully completed - meaning that at least some of the rows in the .csv file were imported - can be reverted. Periodically, Apricot archives information pertaining to old imports to reduce the storage space required. Any import that has been completed using the Imports tool can be restored from archive. It will be automatically re-archived again at a point in the future.Before you can view any details pertaining to an import, you must restore it from the archives. Select the \"Restore\" button. When the import has been restored (or you access the Import Overview without restoring it), you will be able to view information on the Import Overview page. This includes:The name of the import.The name of the file that was uploaded using the Imports tool and a button to download a copy of this file.The name of the user who completed the import.The date and time that the import was completed.Each step in the Import Progress palette that was completed. In the example above, we are looking at an import that was successfully completed. If you would like to see the actual .csv file of the rows that were imported, scroll down to the Imported section of the page and select \"Get CSV.\"When you are ready to revert the import, select the Revert button.You will receive a warning message about reverting your import.When an import is reverted, all records that were imported will be removed from your database. They will no longer appear in search or in reports. If you need to find these records in the future, they will be in Archived Records with other records that have been archived from your database.Note: if you were updating via import the changes are undone when doing a revert.There are two cases when reverting an import will not remove a record from your database:If you are reverting an import of records that have been modified and re-saved, those records will remain in your database and will need to be archived individually.Tier 1 records that have been imported and include additional tier 2 records that have been added since the time of the import will not be reverted. You may need to contact the Ongoing Support team for assistance with this.When you are ready to revert the import, click Confirm.You will get a message when your import has been reverted.","title":"Revert an Import","url":"https://apricot-articles.socialsolutions.com/en/articles/3085115-revert-an-import"}