{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.The AVS (Apricot for Violence Survivors) database is set up to collect demographic information on all clients who come in for services - including name, date of birth, social security number, address, etc. Some organizations also serve clients who remain anonymous - these clients do not provide this demographic information and the organizations do not collect it.The instructions below follow the steps to enter enrollment information for an anonymous client.There are two ways to create a record for an anonymous client.1. One way is to select the Anonymous Victim Hotline Call button under the AVS Bulletins.*Note: this button opens a blank Program Enrollment record for an anonymous client and will work to enroll an anonymous client in any services, even if this client is not necessarily a \"hotline\" caller. The other way to create a record for an anonymous client is to search the Client Profile records for the anonymous client record and add a new enrollment.1. Click the My Apricot tab.2. Select Client Profile records under the Record Search menu.3. Expand the black arrow next to \"Add Search Field\" to add a name field to available search fields.4. Type \"anonymous\" into the first or last name position.5. One anonymous record should appear. Click the row of data to the right of the name and you will taken to this client's document folder.*Note: Anonymous clients have already been set up in the system with one client profile record that does not include identifying data like date of birth or social security number. This client has the name \"Anonymous Anonymous\". When more than one anonymous clients are entered into the system, they are counted by the number of program enrollment records that exist under this one client profile record. Create a New Program Enrollment RecordOnce you have opened the Anonymous client's document folder, scroll down to the Additional Documents section.2. Find the Program Enrollment row.3. Hover the mouse over the Actions tab and select Create New. No matter which way you choose to find an Anonymous client Program Enrollment record, you will end up here: a new Program Enrollment record for an anonymous client.1. Fill out the Program Enrollment as you would for any client.2. Save the record.","title":"Enter a New Anonymous Client","url":"https://apricot-articles.socialsolutions.com/en/articles/3087751-enter-a-new-anonymous-client"}