{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.Staff, volunteers, interns and board members are considered supporters in the AVS database. They provide some kind of service to clients.Adding new supporters to an AVS database is a two step process. The first step is to fill out a Supporter record for each new service provider so users can indicate on the client records which supporter interacted with a client. The second step (which may not apply to every supporter) is to add the supporter to the list of users who have access to enter data into the AVS database.AVS tracks clients as they move through intake, are enrolled in a program and are provided with services or activities. By adding supporters to the database, you can track who provided services, who interacted with a client, or who was assigned to their case. Tracking supporters is optional and if it does not fit your workflow, you do not need to track it. Note: if you choose not to track Supporter's you forfeit the right to track data in the \"Staff\" dropdown found on most AVS forms. Please contact the Customer Care team if you have any questions on this.To add a new supporter to the database, you will fill out a new supporter record.Click the My Apricot tab.In the left hand menu, select the Supporter form.Now you are on the Supporter search page. Before adding a new supporter record, you should search the supporters that have already been entered in the database. Expand the black arrow next to \"Add Search Field\" to add a search field to the page. In the example above, we have added the Name field.Type information, like a supporter's name, into the search field. As you type, the database will return relevant results.If your supporter has not already been entered into the database, select New Supporter in the right hand menu.We will want to enter in their Name and Date of Birth fields first.The Type of Supporter field should be checked for Staff.After you check \"Staff\" another section will show up titled Staff Details.In the Staff Details section you will find an Employee Status field. Click \"Active.\"If you would like your Staff dropdown to include Interns, for example, or any other options please contact the Ongoing Support team. They will not be able to adjust what the Staff dropdown shows (First Name and Last Name).To remove staff from the Staff dropdown just Edit a current supporter record and change the Employee Status field from \"Active\" to Inactive. Please contact the Ongoing Support if this is not working.Save Record. At this point, you have added your supporter to the database so you can track their client interactions, but they do not yet have access to log in to the AVS database or enter client information themselves. For that kind of access, they need to be added as a user.To add a new user, click the Administrator tab.In the left hand menu, select User/Group Profiles.You will be taken to the Users page. Select User Profiles in the right hand menu.Again, as when you added a new Supporter record, you need to search the database to make sure your new user has not already been entered into the system. Expand the black arrow next to the \"Add Search Field\" and add something like a name field.Type information into the search field. As you type, the database will return relevant results. In the example above, there are no matches for our new user.Select New User from the right hand menu.Fill out the username. This is what the user will type into the login screen when they want to log in to the database.Fill out a password. This can be something simple and temporary. Your new user will have the options to change their password to something else after they have logged in for the first time.Make note of what you enter in these two fields because they are necessary for your user to access the database.Type in the user's name. This is what the database will record in the system fields of every record they create or edit. Directly below the name ensure \"Standard\" is selected for the User type unless you are creating an Administrator user.Save record.Note: our process isn't done (unless you just created an Administrator account). After you complete this step it only allows them to login. To grant them permission to navigate AVS please see the next section.Once a Standard User has been saved we will not need to grant them permission to navigate certain areas of AVS. For these purposes AVS has some pre-built Groups and Permission Sets that you may use. Generally, most organizations will find that the Basic Group with the Basic Permission set will be all they will need. To apply this setting (which will need to be done on every new user) please follow the steps below:Click the \"Add\" button located in the \"Assigned Permission Sets\" section.A \"Permission Sets Search\" popup will appear. Click the triangle for the row with \"Basic\" in the Name column.A related permission set will expand below it. Click on the word \"Basic\" to add that permission set to the user.If it added without error you will see \"Link Added (Basic - Basic)\" you may close this message.Close out the Permission Sets Search.Save Record.Note: your organization may need further customization of your groups and permission sets. This can be very complicated (especially if you have been using the database for a while); for more information please read the following article before proceeding:User Record Level Access (User RLA)","title":"Adding New Staff, Volunteers, Interns, Board Members","url":"https://apricot-articles.socialsolutions.com/en/articles/3087874-adding-new-staff-volunteers-interns-board-members"}