{"content":"Apricot is a web-based database. To access Apricot, you need a computer with internet access and an up-to-date internet browser. To ensure that you are able to access Apricot optimally, it is recommended that you use a network with an internet service that provides at least 17 Mbps of download, and 15 Mbps of upload speed.Data can be entered from mobile devices like Apple iPads, some Android tablets and some smartphones. These devices can be used to collect data, but cannot access any of the Administrator functions or design elements.\nNote: We recommend installing a mobile version of Google Chrome or Mozilla Firefox from your mobile device's official store where apps are downloaded. We recommend using the latest versions of Google Chrome or Mozilla Firefox.\nNote: Other browser's might be compatible for data entry only but full functionality is not guaranteed. Google Chrome can be downloaded for free by clicking this link. Mozilla Firefox can be downloaded for free by clicking this link.Click Chrome's Menu buttonHove over \"Help\"Click \"About Google Chrome\"You will automatically be taken to a page that has this on it. If it is up-to-date you will see \"Google Chrome is up to date\" but if you do not, it will automatically begin downloading the update. Once it has finished downloading the update you will need to relaunch Google Chrome for the update to take affect (all browser windows and tabs will be closed).Click on the Firefox's Menu buttonClick the Help Menu buttonClick on \"About Firefox\"You will automatically be taken to the above page. If it is up-to-date you will see \"Firefox is up to date\" but if not, the update will begin downloading automatically. Once it has finished downloading the update you will need to restart Mozilla Firefox for the update to take affect (all browser windows and tabs will be closed).","title":"Equipment Needed to Access Apricot","url":"https://apricot-articles.socialsolutions.com/en/articles/3088209-equipment-needed-to-access-apricot"}