{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.The instructions below outline how to search the database for information that has already been entered into the system.Click the My Apricot tab at the top of the page.From here, you can see a list of the main Form-States used to collect data in the system. Each of these forms collects its own specific kind of data.If you want to look for information collected about a client, you need to search the Client Profile records. If you want to look for information collected about an event, you need to search the Event records.You must first choose a form to search. You cannot search the entire database for the name of a person without first choosing a form. Once you have chosen a form to search,You will be taken to the Search page for that form.Expand the black arrow next to \"Add Search Field.\"You can choose a search field to add from the drop down list. It is organized by which form collects the data. Because the Client Profile form, the Program Enrollment form and the Services form, etc. are connected, you can use a search field from any of them. You can use the \"Add Search Field\" menu to add more than one search field. If you are not exactly sure which record you need to find (perhaps you only know part of a client's name), it can be useful to add more than one search field and enter partial information.When you add more than one search field, the database will only show you results for those records that include information in both of those search fields. In the example above, we are searching using the name field, as it is recorded on the Client Profile record, and the Program Type as it is recorded on the Program Enrollment record. Even before we enter information into these search fields, the database will only show us results for people who have both a Client Profile record and a Program Enrollment record. People with only a Client Profile but no Program Enrollment will not be included in our search results.Each main row of data represents one Client Profile record. Expand the gray arrow next to a row of data and you can access the associated Program Enrollment records as well.Clicking on the green text will open a record to view and edit.If you find you have selected too many search fields, you can remove them from the search page by selecting the \"x\" in the corner. You can also select \"Clear Search History\" in the right hand menu.\n\nNote: Adding search fields can cause the search to function differently. For example, let's say we have client Suzy Smith. We know Suzy Smith has a Client Profile but no other records. If you have a search field from the Client Profile and Program Enrollment, Suzy won't show up. Each search field from a form must have at least 1 record from the corresponding client. Additionally, the search feature does not support linking (this means that if you narrow the results for Suzy and only want to see services attached to the Residential Program Enrollment this cannot be done in a search. You will get results for all services, please run a report to get this information instead. In Apricot, the % symbol serves as a \"wildcard\" value. You can use it to search for any value.In the example above, searching for \"a%\" in the first name field will return any results that begin with an \"a\" no matter what other letters come after it.If we searched for \"%a,\" the database would return results with first names that ended in \"a\" no matter what comes before them. If we searched for %a%, the database would search for results that contained an \"a\" anywhere in that field.","title":"Searching for Records","url":"https://apricot-articles.socialsolutions.com/en/articles/3092532-searching-for-records"}