{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.The AVS database has been set up with data collection fields and pre-built reports, some of which are marked as \"restricted.\" A restricted field or report is essentially locked - a user or a site Administrator may not change the details of these fields or reports. The instructions below detail what an Administrator may do with a restricted field or report and how to contact the Customer Care team to un-restrict or unlock them which will require a waiver to be signed and may prevent your site from receiving any future HUD/HMIS related upgrades.A field is the term used for a \"blank\" or a space in a form that collects data. Some example of fields may be:A \"Name\" field on a Client Profile form.A \"Date of Service\" field on a Services form.In most cases, a site Administrator can edit or change the details of these fields. For example, an Administrator may want to change a field so that it is no longer required to be filled out before a new record can be saved or they may want to alter what the field is called or they may want to change the options that are available in a drop-down menu.When a field has been marked as \"restricted,\" these details can no longer be changed by an Administrator. Fields may be restricted for a variety of reasons, but the most common reason is because a state or federal report requires specific data to be collected. A good example of this is the \"Gender\" field on the Client Profile form. Federal reporting standard require that:this information is collected on every client who is served by an organization receiving federal grant fundingthat the options used to collect information in the menu looks exactly like the example above. Because this field needs to collect information in a standard way, it has been restricted so Administrators cannot change it. Other Options for Restricted FieldsIf you find a place in the AVS database where a field has been restricted and you would like to collect a different kind of information - but where you also need to collect information according to the government standards, you may consider adding a field next to the restricted one to collect the information you want.An example of this would be adding a secondary \"Ethnicity\"-type field next to the one that already exists. The federal government only counts \"Hispanic\" and \"Non-Hispanic\" as ethnicity choices. But you may want to collect information on additional cultural groups.To add an additional field, find an option field in the Field Options palette on the right hand side of the screen and drag it into the main body of your form.Click the green gear box in the upper right hand corner of the field to access the form properties.Change the name of your field.Add options by clicking the + sign.Type in your menu choices as you would like to them to appear in the field.Click Apply.Publish your form to save changes and allow your users to see the updates. Reports pull information out of the database. Reports can be accessed either by clicking the My Reports link on the landing page or by clicking the Report Builder link under the Administrator tab.The AVS database has a number of pre-built reports that pull out different kinds of data from the database. In some cases, an Administrator can edit or change the details of these reports. For example, a report may be set up to pull out data about \"residential\" clients, but an Administrator may want to pull out information on \"non-residential\" client or all clients.When a report has been marked as \"restricted,\" these details can not be changed by an Administrator. Reports may be restricted for a variety of reasons, but the most common reason is because there is a state or federal report that requires a certain kind of data to be pulled out in a certain way. Other Options for Restricted ReportsAnother option for dealing with a restricted report is to copy the report and make changes to the copy. Any report that has been marked as restricted can still be copied.To copy a report, open the report for editing. In the right hand menu, select Copy Report.You will be asked to save your report elsewhere on the reports page.Re-name your report.Select Create. Once a report has been copied, you will be taken to the copy of the report where you can edit it as needed. If you would like to unrestrict a field or report please contact the Ongoing Support team to find out about the risks involved as well as the potential next steps.","title":"Managing Restricted Fields and Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/3092595-managing-restricted-fields-and-reports"}