{"content":"This article will cover the process of replacing one field with a field of a different type. For example, let's say you have been saving data into a Drop-down field, but you'd prefer to start using a Radio Button field instead. In Apricot, you cannot adjust the field type from 'Drop-down' to 'Radio Button', so you will need to add a brand new field and then migrate the data. NOTE: This process will require the Import Tool - while it is possible to re-create the records manually, the Import Tool makes this process quick and easy. Some things to keep in mind before you decide to add a replacement field and then migrate the data:You are creating a brand new field so any reports that need to reference this field will need to be updated (including filters)Following this guide requires that you migrate data using the Import ToolOptions in the new field must match the old field exactly, including formattingChanging a multi-select Checkbox field into a single-select Drop-down field will require extra manual data cleanup, which we will not cover in this articleThe first step is to create the new field, making sure that it's options match up exactly with the original field's options on the form. While you can technically choose \"Allow Other\" to allow for different options in both fields, we are assuming that you just wanted to change the field type. In order to assure the options match correctly, you can click 'Bulk Entry', select all, copy, then paste into the new field in the same way.Publish the form once the new field with all options is available on the form.Notice that we will only be using the form which contains the field, we will not need to include the Tier 1 form if we are working with a Tier 2 and vice versa.The report must include the Record ID from the System Fields section of the form which contains the new field.The report should also contain the original field.Do not include any fields aside from those listed in steps 2 and 3.Click on Export under 'Report Actions'.Then, click the Export button in the pop up - save the file in a place that you will remember, this is the data we will migrate into the new field.Click on the Administrator tab.Click on Imports.Choose Prepare For Import.Pick the form.For Record Action, make sure it is set to Update Existing.In the Column Selection section make sure that only the new field and record ID are selected - and nothing else. Please note: including any other field will result in importing blank values, in other words, wiping those fields.Download CSV File when ready.Now, open up both the exported Excel file (left side of above screenshot) and the CSV Template (right side of above screenshot). Copy/paste the Record ID and Original Field values from the original export into the CSV Template.Save the CSV Template.Once the CSV File is saved with the data for the new field it is time to import it back into Apricot.\nHead into the Administrator tab.Click on Imports.Upload File.Click on the Choose File button. Then, use your operating system's/browser's file picker to locate the CSV file and select it.Click on Upload.Click on Assign Access to start the step-by-step process. ORClick Run All to let the system run through all steps quickly.Once everything has imported, we can go back to any of our original records to verify that the New Field is no longer empty\nWe can see here that our \"New Field\" has the same option selected as our \"Original Field\", success!If you go back to a record and notice that it is completely wrong you can \"Revert\" the import by going back into the Import Overview and clicking \"Revert\". This should be done as soon as you realize the mistake and we highly advise checking records for verification upon importing data. Alternatively, build a quick report to compare the new field with the original field.You may also do a \"trial run\" import by only updating a handful of records.It is also possible to replace an old field with a new field that contains different options. For example, you might want the new field to read \"Option ABC\" when the old field read \"Option 123\". This will require some Excel manipulation. Export the old data first. Then, you'll need to use Excel's \"Find and Replace\" feature (this may be located in different locations depending on the Excel version you use - please see our screenshot below for an example):","title":"How To Replace a Field with a Different Field Type","url":"https://apricot-articles.socialsolutions.com/en/articles/3093235-how-to-replace-a-field-with-a-different-field-type"}