{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.The AVS (Apricot for Violence Survivors) database is set up to collect demographic information on all clients who come in for services - for some organizations, this can include collecting information on abusers as well as survivors of abuse.The instructions below provide steps for entering information about batterers or abusers into the AVS database.Entering information on a batterer or abuser is similar to entering information on a new client. Each AVS database has a form that is dedicated to collecting demographic or \"face sheet\" information about each person who comes in for services - this can include abusers. The name of your forms may be different than what is being shown in the example above; if you do not have a form called \"Client Profile,\" please ask your database Administrator the name of the form that collects this kind of data.One way to find your client profile records is to click the button under \"Welcome to AVS\" called \"Client Profile Search.\"Another way is to look on the left hand menu and click on the Client Profile form.Both of these options will take you to the same place. This is the Client Profile search page. From here, you can search for an existing Client Profile record or create a new Client Profile record.Before you create a new record, you should search the database to make sure a record has not already been created for the person who is coming in for services.To search the Client Profile records that have already been saved in the system, expand the black arrow next to \"Add a Search Field.\"Select an option from the drop down menu. If you know the client's name, it is probably easiest to add the Name field, but you can add any field listed here and you can also add more than one field if you think that would be helpful.Type in the name of the client. As you type, the database will return relevant results.In this case, none of the records in the database match the name of our abuser. This means she has not been entered into the system before and a client profile record must be created for her.On the right hand menu, select \"New Client Profile.\" Enter the abuser's name and any other relevant data you have.If you do not know some information, select \"Client Refused.\"Under \"Batterer,\" select \"Yes.\"Scroll down to the Batterer section and fill out relevant information.Select \"Save Record.\"Once a record has been successfully saved, a pop up window will give you the options to: Continue: You will remain on the same page. If you have additional information to add to this record or need to correct an error, select Continue.\nView Folder: You will be taken to this client's document folder. If you are satisfied with the information that has been entered into this client profile record and would like to move on to enroll this client into services, select View Folder. \nGo to Search: You will return to the Client Profile search page. If you have more client profile records to complete for more new clients, select Go to Search and repeat the previous steps to search the database and create another new client profile record.","title":"Enter Batterer Information","url":"https://apricot-articles.socialsolutions.com/en/articles/3094107-enter-batterer-information"}