{"content":"AVS (Apricot for Violence Survivors) comes with several pre-built reports for grants from VOCA, VAWA, VSSR, SASP and OVW, among others. These grants provide standard lists of services to which you must match your agency's list of services provided.\n\nThe steps of this process include:Edit your service option.Pick the equivalent service option from the list for each grant for which you will be reporting your service activities.Save the record. Note: VOCA will have its own process. The following process is for all others. VOCA will be over-viewed at the very end of this article.From the My Apricot tab, locate the form named \"Category\" in the navigation panel on the left side of the page. You may need to click the \"Hidden Records\" tab to find it.Once you have located Category, click it. This will bring you to the Category record search. Click the \"Browse All\" button next to the drop-down named \"Add a Search Field\". This clears any previous search terms so that you get the most accurate search results.Select the search field \"Type of Category\" from the search field drop-down.In the \"Type of Category\" drop-down, select \"Service\". This brings the Service Category records into the search.Add the \"Option\" search field from the search field drop-down.Leave the Option search field blank. This brings the Service Option records into the search results. You will be editing the Service Option records.Expand the grey arrow at the left of each result row. This expands the Service Category to show all the Service Option records in that category.Click into a Service Option record.Locate the section(s) named for the grant(s) you get funding from. In each section, select the grant Service Type from the list which correlates to your Service option. In this example, we are matching the \"Church Group Presentation\" option to the VAWA grant's \"Victim/Survivor Advocacy\" Service Type. Notice that there are multiple grant service types and state service types represented on this form:VAWA Service TypeSASP Service TypeOWV Service TypeNote: VOCA Service Type is no longer used, for VOCA Service Type information please see the next section of this article.Choose the correlating Service Type of Victim/Survivor Advocacy.Save Record.VOCA Service Types do not require much updating on your end beyond a few additional steps while creating Services records like you normally do. However, we highly advise to make sure you have the VOCA Form/Fields in your site which is also required for the VOCA reporting. \nOpen the client's Document Folder.Click on page icon to create a new Services record.You will fill out the Service form as usual (not shown here) but there additional steps, required for VOCA reporting, and you'll start by scrolling down to the \"VOCA Direct Services\" section of the form. Then:Click on the drop-down for \"Direct Service Categories\".Choose 1 of the 5 options: Information and Referral, Personal Advocacy/Accompaniment, Emotional Support or Safety Services, Shelter/Housing Services, Criminal Justice System Assistance.Depending on the option you select for \"Direct Service Categories\" Apricot will trigger Form Logic to display the next field to choose. In our scenario it is \"Personal Advocacy/Accompaniment\" but will depend on what you choose. Save the record when complete.","title":"AVS: How to Connect Services to Service Types for Grant Funding","url":"https://apricot-articles.socialsolutions.com/en/articles/3101073-avs-how-to-connect-services-to-service-types-for-grant-funding"}