{"content":"Your AVS site is up to date with FY 2022 HMIS specifications. This update requires that a few preliminary records be made or edited prior to running the 2022 HUD APR and 2022 ESG CAPER federal funding reports for the first time. In your forms, there are a few new fields which need to be populated in order to submit your HUD APR or ESG CAPER report to Sage:\nYou only need one Organization record, so this is a quick once-only task. Make an Organization record if you don't have one already. If you already have an Organization record, edit it and populate the field named \"Victim Service Provider\" and save the record.\nIn the My Apricot tab, locate the \"Hidden Records\" category in the left-side navigation panel. Expand \"Hidden Records\"Click \"Organization\" to go to the Organization Search pageEdit the existing Organization record if you have itMake an Organization record if you don't already have one. Click \"New Organization\" in the Search Actions panel on the right side of the page At the bottom of Service Site records, you'll find a new section containing the new fields:Link to Organization recordContinuum Project?CoC CodeGeocodeYou'll need to make or edit a Service Site record for each location you want to include in your HUD APR or ESG CAPER results. In the My Apricot tab, locate \"Hidden Records\" in the left-side navigation panel. Expand \"Hidden Records\"Click \"Category\" to go to the Category SearchNarrow the Category Search using the \"Type of Category\" Search Field from the \"Add Search Field\" dropdown, orIf you already have \"Type of Category\" in your search, select the option \"Service Site\"If you already have Service Site records, they will show in the search results. Edit the Service Sites records you want to include in your HUD APR or ESG CAPER resultsIf you do not have any Service Site records, click \"New Category\" in the Search Actions panel on the right side of the page.Enter the name of the Service Site in the \"Category\" fieldSelect \"Service Site\" in the \"Type of Category\" fieldClick \"Add\" to link this Service Site to your Organization recordPick \"Yes\" or \"No\" in the \"Continuum Project?\" dropdownIf you picked \"Yes\" in the \"Continuum Project?\" field, enter your CoC CodeEnter your GeoCode. Don't know your GeoCode? Find your region's GeoCode here.Once you've created an Organization record and a Service Site record, you have completed the preliminary tasks required to populate the 2022 Q4a. \n\n","title":"AVS | 2022","url":"https://apricot-articles.socialsolutions.com/en/articles/3461391-avs-2022"}