{"content":"An issue or defect is an error, flaw, mistake, or failure in the software. If the user is experiencing something that they believe to be an issue in the software, the user should contact Customer Support and provide detailed instructions on how to reproduce the problem. A representative will log in as/with the user to diagnose the issue and determine if it is a defect. \nThere are four levels of severity for defects. Each defect is prioritized based on its severity level. These targeted resolution times only apply to core functionality, except if the functionality affected is completely hindering a user’s ability to work and use the software. The Bonterra Development Team typically deploys three to four major updates/releases to the software per year.Customers are given advanced notification of maintenance periods and upcoming updates on the login page and via an e-newsletter.\n\nA major functionality issue that prevents customer from being able to use software.The Development Team works to resolve these issues immediately with a target resolution of two business days or less.Customer Support will provide daily updates of the status until the issue is resolved. Escalation of the issue to the COO will occur if issue is not resolved within the target resolution time.\nA major functionality issue which does not have a work around that is key to performance and causes major impact to customer’s ability to operate their organization.\n\nThe Development Team works to resolve these issues immediately with a target resolution of 10 business days.\n\nCustomers may elect to have Customer Support provide updates on a daily basis, every other day, or whenever there is an update in the defect’s remediation. Escalation of the issue to the COO will occur if the issue is not resolved within the target resolution time.\nA major function does not work in a core area of the product, but there may be a workaround that is time consuming, or the issue may not prevent general operations from proceeding as normal.\n\nThe Development Team will fix within its normal release cycle. The target is to fix these issues within 30-120 days.\n\nCustomers will receive an automated update when the issue resolution is scheduled to be deployed.\nA minor functionality less key to the product is not working or there is functionality that is not working and there is an easy workaround. These issues will addressed when there is work being done in the functional area that contains the defect. The issue can be categorized as a higher priority if it is affecting a large number of customers. Status will be provided via the customer portal and customers will receive an automated update when their solution is scheduled to be deployed.\nA cosmetic issue or inconsistencies that do not affect functionality in any significant way. These issues will be addressed when there is work being done in the functional area that contains the defect. Status will be provided via customer portal and customers will receive an automated update when the resolution is scheduled to be deployed.\nA defect does not need to be marked as a Severity 1 for our internal team to mark it as a P1, which stands for Priority 1. A Priority 1 is defined as an issue that is being escalated and requires attention outside of our standard triage process but does not meet traditional S1 criteria. This is an avenue to bring awareness to high priority issues and make a case to quickly resolve the problem. If you have a defect that you believe should be re-prioritized, you can contact your Client Success Manager at CM-clientsuccess@bonterratech.com. ","title":"Defect Resolution Time Frame","url":"https://apricot-articles.socialsolutions.com/en/articles/3478820-defect-resolution-time-frame"}