{"content":"Overview This document covers the Insights Attendance Dashboard.Configuring the Dashboard\nClass Form - Pick the \"Class\" form related to the registration grid that you use to track attendances. Important Note: You will only be able to reference one form, so please pick carefully. If you use more than one form to track attendances using multiple registration grids in your Apricot instance, you will need to decide which one is most important to associate with your dashboard.Location Field (Optional) - If you use an address lookup field on the class form in your registration grid, you can reference the mapped address within your dashboard. Pick the Address Lookup field that best represents the location of the class.Viewable Classes - Allows multiple responses. This will indicate the classes for which you'd like dashboards to be made available. The list of classes will populate from the values saved into the record name field on your Class form. Default Class - Default class will determine which class's dashboard appears by default.Name Field - Pick the field you use to track your participants' names.Location Field - Pick the Address Lookup field that best represents the participant's address.Display Distribution Map - Toggle on to display a distribution map for the participants of each class.Attendance Field - Pick the field that you use to track attendance statuses like \"Attended\", \"Tardy\", \"Absent\", etc.Positive Values - Pick the values that represent that a participant was present. For example, \"Tardy\" would generally be a positive value because it represents that the participant was present.ValuePerformance enhancements: Improved load times and data quality of dashboard Better data visualizationsAllow for Admin users to configure/set up their own dashboardEnhancements or Changes over Previous Iterations of the DashboardUpdated card view – Consolidated enrollment and attendance information, removed participant trend totals card and data, added attendance record countChanged Bar Chart to Line Chart for all time span filter options, added animation to the display and a dashed line to show incomplete time.Now honors Apricot permission sets, users will only see data within their assigned programs populate on the dashboard.Time span filter: 3 Months changed to 12 weeks New Features Admin setup/configuration page Map your data Choose classes for the class dropdown Select a default class Ability to turn off Geographic Distribution MapAdditional InformationClients are able to configure a dashboard for one form per site, Admins cannot configure dashboards across multiple forms.Time span filter does not allow for custom date ranges.Nightly import for new attendance events, users will see new attendance records populate on their dashboard the following day.Initial dashboard configuration can take some time to populate data (based on volume of records).","title":"Attendance Dashboard","url":"https://apricot-articles.socialsolutions.com/en/articles/3527889-attendance-dashboard"}