{"content":"The registration grid is a premium feature in Apricot that allows a user to create multiple Tier 2 records for multiple Tier 1 records at the same time, using a grid that can be easily and quickly completed.Basic Registration Grid set up allows for a user to fill out records according to a Monday-Friday schedule or an every day schedule. Advanced registration grid set up allows a user to create a custom schedule of dates (for example, every other day or just on the 5th day of every month). Only continue if you have an advanced need for custom dates. Otherwise please see the Basic Registration Grid Setup.One Tier 1 form to track the \"registrants\" or people who are attending the event or class containing the registration grid. You will be linking or \"registering\" these people for class attendance. One Tier 2 form under the registrant Tier 1 form to record details of attendance or participation. You will be creating multiple of these records every time you fill out a registration grid. One Tier 1 form to track information about the class or event that the registrants will be attending. You will open a record of this form to access the grid itself.One Tier 1 form to hold the custom date schedule you want to use in the grid.First we need to create the Tier 1 form that will record details about the registrants or  people who will be attending the class or event contained in the registration grid.Click on the Administrator tab. Select Standard Forms in the left hand menu.Select a Tier 1 form and hover over the Actions tab.Select \"Edit\"Or, create a new form by selecting \"Tier 1 From Scratch\".Find one or two fields that can be used to identify the person these records will be created for, like a name field.Open the name field gear box.Set it to Quick View.Publish your form.Now that you have created and configured your registrant Tier 1 form, you can create and configure the Tier 2 form that will track attendance for each of the registrants.Click the Administrator tab.Select Standard Forms in the left hand menu.Select a Tier 1 form and hover over the Actions tab.Select \"New Tier 2 From Scratch\"The registration grid will be creating multiple copies of this form for each of the registrant Tier 1 records. It needs to contain all the data we want to record in the registration grid - so add all the fields pertaining to attendance that need to be recorded for each of the registrants. The registration grid will only display fields that have been set to Quick View.Open the field gear box.Set the field to Quick View.Click Apply.Publish.Notes:One of these Quick View fields MUST BE a date field.Keep in mind that the registration grid can become unwieldy and hard to read if there are too many fields on it; choose your fields wisely and limit how many of them you use.To create the custom date Tier 1 form, select the Administrator tab.Click on Standard Forms.Select Tier 1 From Scratch.This form only needs to have one thing on it: a duplicate check date field. When it has been added, publish the form.Now that you have created your registrant Tier 1 form and your attendance Tier 2 form, you can create or configure your class or event Tier 1 form.Click the Administrator tab.Select Standard Forms from the left hand menu.Create a new form by selecting \"Tier 1 From Scratch\".You will be opening a specific record of this class form to access the registration grid itself. Now we need to use link fields to connect this Tier 1 form to the other forms we have already created. Expand the black arrow next to the Linking category in the Field Choices panel. Drag the link field into the main body of your form (repeat this two more times). Open the green gear box in the first of the link fields.Rename the field (it can be named anything but we advise to name it \"Registrants\" or something similar).Under the \"Linked To\" select the registrant Tier 1 form you already created. In the second and third drop down menus, select Many both times. This will allow many registrant records to be connected to each class/event form.Click Apply.You will be opening a specific record of this class form to access the registration grid itself. Now we need to use linking fields to connect this Tier 1 form to the other forms we have already created.Open the green gear box in the second of the link fields.Rename the field. We advise to name it something to the degree of \"Attendance\"Under \"Linked To\" select the attendance Tier 2 form you already created.In the second and third drop down menus, select Many both times. This will allow many attendance records to be connected to each class/event form. Click Apply.Now we need to use linking fields to connect this tier 1 form to the custom date Tier 1 form we have already created. Open the green gear box in the third linking fields.Rename the field. We advise to something like, \"Custom Dates\"Under the \"Linked To\" select the custom date Tier 1 form you already created.In the second and third drop down menus, select Many both times.Click Apply. On the right hand menu, click \"Registration\". This will add the registration grid field to your form. Open the gear box in the registration field. Update the name if necessary.Under, \"Schedule\", select Custom.under, \"Schedule Link\" select the linking field that corresponds with the custom dates. Under, \"Schedule Date Field\", select the date field from your Custom Dates form.Under, \"Registrant Link\", select your registrant Tier 1 form. Under, \"Registration Entry Form\" select your Tier 2 Attendance form. Under, \"Registration Date Field\" select the Date field from the Tier 2 Attendance form.Click Apply.Publish the form.Now you have finished creating the form structure needed to support the use of the registration grid feature.\nYour next step is to enter a date for all of the Tier 1 forms you created. Select My ApricotSelect the registrant Tier 1.Create at least one record. Note: If you want to add dates for the entire year, semester, etc - this can be done in bulk using the Imports Tool. Read more about importing tier 1 records here. In order for the registration grid to work, you must already have registrants entered into the system. This is where you will create the dates in which the registration grid will read from. If the date doesn't exist, then they cannot create a record for that date. These dates will need to be kept up-to-date.\n\n1. Click on My Apricot\n2. Under Search Record, click on the Custom Dates Tier 1\n3. Create at least 1 record. In order for the registration grid to work, you must already have at least one class entered in the system.Click on My ApricotUnder Search Record, click on the Class Tier 1.Create at least 1 record.Edit the Class record and click on \"Add\" next to the registrant linking field. Select the registrants you wish to add to the class/event.Save record.Edit the Class record and click on \"Add\" next to the Custom Dates link.Click on the dates you wish to associate with this class.Save Record.Note: If you want to link Custom Dates in bulk, we recommend using the Imports Tool. Learn more about importing links here. Open the Document Folder for the Class you wish to record attendance form, click on the vertical ellipses.Select \"New Registration Section\"The name of the class. The records you create will record information about this class for the people you select. Registration: A date field that shows the starting date for your grid of classes. The number here will be the first date your selected from your custom date records.Shows how many days are being included in your registration grid.If you make any adjustments to 2 or 3, click the reload button to reload the registration grid with new dates.This column shows the names of the registrants This row shows the datesThe gray row at the top is a short cut; anything you fill out in this gray row will be filled out for the entire column. Similar to the gray row at the top, the gray column to the right is a short cut to apply changes to the entire row. The small trash can icon in the box allows you to delete this record from the registration grid if it was added in error. The small document icon in the box takes you to that attendance record (in a new tab).When you have entered the data necessary, select Save Records.You have just created a unique attendance record for each of the registrants using the registration grid. The registration grid does not have any data validation (for example if doesn't enforce required fields or minimum on numeric fields).The following fields can be added to a form but cannot be added to a reg grid:Attach docAuto PopulateCalculation (+) AddCalculation (-) SubtractCalculation (x) MultiplyCalculation (/) DivideCalculation RoundCalculation Date AfterCalculation Date BeforeCalculation Date DifferenceCalculation Time DifferenceDynamic CheckboxDynamic DropdownDynamic NumberDynamic TextGrantGrant InvitationLinkRecord LockSchedulerSignature","title":"Registration Grid - Custom Dates","url":"https://apricot-articles.socialsolutions.com/en/articles/3560815-registration-grid-custom-dates"}