{"content":"This is the preferred method of contacting Apricot Support and will usually result in a much quicker resolution. This is because if you use this method we receive all of the relevant information related to your issue and your account, such as: Organization Name, Contact for Case, the Email Address, and your Apricot database name. You can learn more about contacting Support via the Help Center here. This method should be used if Apricot is completely down, if you are unable to access the Help Center for any reason, or if you are forwarding important context from previous emails. We only receive an email address and the information within the e-mail, so this method has a higher risk of us having to have more back-and-forth to investigate the issue. It's extremely important to include the following:Your Apricot Username (if different from the email you sent from)Your Organization's full legal nameYour full NameThe URL to the record or report with the issueReport and/or form nameReproduction Steps so we may reproduce the issueScreenshots if available (please include the entire Apricot screen, do not send just a clipping of the error message)We will be assuming that you are submitting a case via the Help Center and will not be listing items that are automatically provided to us using this method (such as Organization Name).URL: This is what you find in the address bar of the browser. This will lead us to exactly where you are in the system. You may provide us with as many URLs as are relevant to the issue. The URL will always start with \"https://apricot.socialsolutions.com/\" and you should always copy/paste the entire URL.2. Screenshot: Screenshots allow us to see what you see and should be included whenever possible. If it is a screenshot of an error we do require that the entire Apricot screen is visible (this includes the URL/address bar of the browser as well). If there is sensitive client information and you absolutely cannot provide a screenshot we do understand. You can \"blank\" out the information by using photo editing software or by inserting a \"Shape\" over parts of the image if you are using a word processing program, for example.\n\n3. Reproduction Steps: this is extremely important. Even if we have a screenshot and the URL, it is not always enough information for us to reproduce the issue. In many cases the error only happens after a specific set of actions. Included in these steps should also be the expected result of those actions. Below is an example of how to submit reproduction steps:Head to https://apricot.socialsolutions.com/document/edit/id/116Choose \"Option 1\" within \"Field A\"Save RecordNotice an error pops upWe should see the \"Record Saved\" popup4. Deadline: It is also helpful for us to understand if you have a pertinent deadline. For example, \"this is due in exactly 1 week on this date.\"URLScreenshot (whenever possible)Every filter value being used (if it is different from what originally loads with the report)A description of why the report is wrongIf a result is missing from the report we will need the URL to the record that is missingAny pertinent reporting deadlineBelow is an example of what should be included:This is the report: https://apricot.socialsolutions.com/report/run/report_id/8No screenshot, sensitive informationFilters I'm usingStart Date = 01/01/2018End Date = 01/30/2018Program = AThe report is wrong because there are clients missingThis is the URL to a client's Program Enrollment record that is missing from the report: https://apricot.socialsolutions.com/document/edit/id/126/parent_id/114Deadline: this is due in exactly 1 week on 02/02/2018You cannot attach a Screenshot to a Case via the Help Center upon creation but you can after you click \"Save\"Hover over \"Attachments\"Click \"Attach File\"Familiarize yourself with Apricot's Glossary of TermsBe aware of deadlines! We advise to submit Cases as soon as possible to ensure there is enough time to resolve. For example, if you have a report due on February 20, 2018 we advise to run the report at least one week in advance to ensure it runs properly and the results are correct. That way, if they are not, we will have enough time to better assist in advance of your deadline.","title":"Apricot Support | Best practices for contacting support","url":"https://apricot-articles.socialsolutions.com/en/articles/3596328-apricot-support-best-practices-for-contacting-support"}