{"content":"There are multiple options for how programs get assigned to records, but a common option is \"Assign Records to User's Active Programs. In that case, when you create a record it is assigned to your \"current\" program as displayed in your User Badge. If you are an Administrator or a Standard user that is associated with more than one Program you will notice that there is an option in the program dropdown called \"All Programs\", and when saving from this view you may be providing more access than you expect. This article will show you what to look out for and how to avoid this issue.Let's say we have a client named Ken Dahl. He currently has a Services tier 2 record that states he is in the Adult Case Management program. There are no other Services records in his document folder.In this scenario, Ken's tier 1 is also only assigned to the program Adult Case Management.Now, let's pretend we are an Administrator (or a Standard User that is associated with multiple programs). We want to create a Service record and our User Badge shows that we are working in the view \"All Programs\"We can see our Program Badge is set to all sites and all programsWe can see in the Assigned Programs box it is going to add many programsWe don't want that; this client is only enrolled in the Adult Case Management program. If we save this record as is, it will not only assign these programs to the Service record, that access will also roll up to Ken's tier 1 record. In Apricot, any Tier 1 must be associated with every program a Tier 2 is associated with (this is because you can only navigate to a tier 2 record for which you have access to the tier 1 as well). So, how do we prevent this?Click the Program BadgeIn the Sites & Programs popup, click the Adult Case Management programNote: If you switch your Program view after completing the record you will be notified that you must \"leave\" the page, please do so. You will need to fill the record out again but it's better to catch it now than try to adjust incorrectly applied Programs later.There is one alternative to this but it will require just a few extra clicks when saving each record. You will need to adjust the Form Property on all Tier 1 and Tier 2 forms within your site. This setting may also be used if your users need the ability to assign more than one, but not all, programs to a record. Apply the below settings to each form:Click the gear icon for the formChoose \"User selects program assignment\" from the dropdownClick apply and publish the formNote: The highlighted option you see in the dropdown is what most forms are set to in Apricot.Glad you asked! Below is a screenshot showing how Apricot will function when saving records using this setting.After you click \"Save Record\" for the first time you will get this pop-up. Click the Program(s) which this record/client should be assigned to.Click AddClick ApplyDon't forget to click Save Record, the record is not saved until you see the record saved confirmationNotice: In the Program Badge area our user is set to All Programs, but Apricot asked which Program(s) should be assigned because of the form's program assignment setting. While it might require more clicks, this is the safest way to ensure all records are being assigned correctly.","title":"Best Practices: Record Creation and Program Assignments","url":"https://apricot-articles.socialsolutions.com/en/articles/3598178-best-practices-record-creation-and-program-assignments"}