{"content":"Note: If your screen does not look like this when accessing the Users page, please head here!Permissions and user management is found by clicking on the Account Management link located under the user badge. The Account Management App has different menu options where administrators can set up new users, manage existing users and their permissions, and manage Roles (templatized permissions sets). Currently, standard users cannot access this app, however they can update their User Preferences and change their password if necessary.\n\nAccess to the Account Management App can also be located under Access Control left menu while in the Administrator Tab.\n\nThe following are capabilities of the Account Management app broken down by page:Users PageThe Users Page is where administrators can view all active users in their Apricot. From this page they can create new users and see how many user seats they’ve used and how many they have available.  For information on adding a new user, click here!Search: Admins can use the search bar to find users by name. All Programs Dropdown: Admins can use this dropdown to filter all active users by Program assignment. Admins can select more than one Program to filter by.All Roles Dropdown: Admins can use this dropdown to filter all active users by Role. Admins can filter down by more than one Role.Switching Views: Admin’s can switch the view of this page by selecting one of these two icons. The page defaults to the row view, but users also can view active users in card view format.Roles PageThe Roles page is where Admins can view and manage all Roles that are available to assign to users. What is a Role?Roles are templatized permission sets that, when applied to a program, dictate what access a User has within that Program.Admins can update these templatized permission sets by selecting the pencil icon next to the Role they would like to edit.Roles Details PageThe Roles Details Page is where administrators can manage and build out their Roles.Admins can update the name of the Role as well as add a short description for the Role. \n\nForms: In the Forms section, admins can designate the level of access this Role has for each Tier 1 and Tier 2 form. View access allows users to view records created from the form selected. Search access allows users to use the search functionality to find records created from the form selected. Create access allows users to create new records from the form selected. Edit access allows users to edit existing records from the form selected. Archive access allows users to archive records created from the form selected. Archive access is a very powerful capability and access should be very carefully selected. Click these linked articles to learn more about Caseloads and Secure Fields/Field Level Access. \n\nReports: In the Reports section, admins can designate the level of access this Role has for reports. View access allows users to view the report selected. Edit access allows users to make changes to the report selected.Search: Admins can search for form, reports, programs by name to better locate what their looking for.Role and Program AssignmentManaging access for users is easy. An admin can assign Roles and Programs to users. Users will only have access specified by the Role for the Programs they are assigned.Example: If a user has the Case Management Role in Program A, they will only have access to records and data specified by the Case Management Role within Program A. They will not see records or data from the same forms/reports in Program B. Role and Program assignment is managed two ways:Creating a New UserUser Details Page Access Management for New FormsYou can manage form access for Roles in the Form Designer by selecting Form Permissions from the Form Actions palette. \n After selected, you can assign View, Search, Create, Edit, Archive access for each Role. Use the search bar to find the specific Role you are looking for.\nSites & Programs PageThe Sites & Programs page is where administrators can manage and create new Sites & Programs to coincide with the roles in their database. At the top of the page you have the option to Search for any Site or Program you have currently created, as well as options to Create a New Site and Create a New Program. You can click the \"+\" icon to the left of any Site to see the list of Programs nested underneath it. You can then click the eyeball icon to the right of any of your Sites or programs to view their respective details. Within a Site's details you can update things such as the Description, Location, Contact, and so on. You can also add Site Administrators, as well as additional Programs that you'd like nested under that Site. To the right of each Program you have the option to view that Program's details via the eyeball icon, as well as copy that program via the three-dot icon. Within a Program's details you're able to adjust largely the same suite of options as within a Site, but you're also able to adjust the Status of a Program. The Status of a Program will determine whether or not new records can be assigned to said Program, as well as if new Users can be associated with it through one of their Roles. Alongside the Status, Location, and Contact for that program, you can adjust whether or not you'd like the Program to Send and/or Receive referrals, as well as set an email for notifications of Referrals to go to. Lastly, at the bottom of the page you can view all Assigned Roles & Users that are associated with this program. ","title":"Role Based Permissions","url":"https://apricot-articles.socialsolutions.com/en/articles/3639845-role-based-permissions"}