{"content":"The Social Solutions website has a convenient link to the Apricot login page, but it is not the only way to reach that page.\nThe Apricot login page can be accessed at this link: https://apricot.socialsolutions.comNote: If you plan to bookmark the Apricot login page ensure that you are only bookmarking apricot.socialsolutions.com and nothing more, as this is the only official login URL. Other URLs might not work properly. \nForgot UsernameYour username is always an email address.If you cannot remember your username email address or cannot use it to login, please contact the Customer Care team: apricot@bonterratech.com \nForgot PasswordIf you forget your password, you can reset your password and access your account by selecting the \"Forgot Your Password?\" link on the main login page.You will be directed to enter the email address associated with your Apricot login and a password reset link will be emailed to that address.Once you have successfully logged in, you may change your password to something easier to remember. \nError Message When Logging InIf you login with the correct username and password, but receive an error message, please contact the Customer Care team immediately: apricot@bonterratech.com \nI Can Login But Cannot Access My RecordsIf you have successfully logged in to Apricot, but cannot see any of the records or bulletins you would normally see or believe you should be able to see, there may be an issue with how permissions and user access have been applied in your Apricot database. The Administrator on your staff should be able to solve this problem by looking at your user account and adjusting permissions and access as necessary.Instructions on how to adjust user access can be found here for Legacy Permissions: Adding and Managing Users - Legacy Permissions and here for Role Based Permissions: Adding and Managing Users - Role Based Permissions. \nNew Staff Needs Username and PasswordIf you are a new staff member and need to have a user account created for you in Apricot, the Administrator on your staff should be able to solve this problem by creating a new user account for you. Instructions on how to create a new user account can be found in one of the Adding and Managing Users articles below depending on the permissions in your Apricot instance:Adding and Managing Users - Legacy Permissions\nAdding and Managing Users - Role Based PermissionsIf you are a new staff member and are also the new site Administrator for the Apricot database, please contact the Customer Care team at: apricot@bonterratech.com \nNeed More User SeatsApricot databases have a limited number of available user seats. If you are trying to add a new user but do not have enough user seats, you may need to deactivate a user who is no longer on staff. Instructions on how to deactivate a user can be found here for Legacy Permissions: Adding and Managing Users - Legacy Permissions and here for Role Based Permissions: Adding and Managing Users - Role Based Permissions. If you are working in your Apricot database when something that used to work properly is suddenly not functioning the way it should, please email the Customer Care team immediately at apricot@bonterratech.comWhen describing the problem, it can be very helpful to see the steps you took and what you expected to happen, as well as what actually happened. Best practices for contacting Support are detailed in this article.","title":"Troubleshooting: Accessing Your Apricot Site","url":"https://apricot-articles.socialsolutions.com/en/articles/3654288-troubleshooting-accessing-your-apricot-site"}