{"content":"Additional options are available to create different types of aggregate report grids, to filter results at several levels and to adjust each cell with additional properties.Each aggregate report section can contain one grid. These grids must be identified as one of the following types when they are created:Single Source: allows for one data source, or traditional report, section to provide the data for the entire aggregate report section. Each row, each column and each cell can be filtered individually which will create a simple grid of data.Source Per Row: allows for one data source, or traditional report, section to provide the data for each row of the grid. Each row and each cell can be filtered individually.Source Per Column: allows for one data source, or traditional report, section to provide the data for each column of the grid. Each column and each cell can be filtered individually.Source Per Cell: allows for one data source, or traditional report, section to provide the data for each cell of the grid. Each cell can be filtered individually. A single source aggregate report section draws all of its data from one section in one underlying report.Each column, row and cell can be filtered. The results will always be related to the \"total rows\" from the single report section that has been added to this aggregate report section.\nA source per row aggregate report section can draw data for each row from a different underlying report section.Each row and cell can be filtered, but columns cannot be filtered.In the example above, the aggregate report section is pulling data from two different Tier 2 records in order to find the total number of services as collected across both forms. This type of report would also work well if you need to count services or people served when that information is collected on un-linked or unrelated Tier 1 forms.A source per column aggregate report section can draw data for each column from a different underlying report section.Each column and cell can be filtered, but rows cannot be filtered.In the example above, the aggregate report section is pulling data from two different Tier 2 records in order to find the total number of services as collected across both forms. This type of report would also work well if you need to count services or people served when that information is collected on unlinked or unrelated Tier 1 forms.A source per cell aggregate report section can draw data for each cell from a different underlying report section.Each cell can be filtered, but rows and columns cannot.In the example above, the aggregate report section is pulling data from five different Tier 1 and Tier 2 records in order to find the total number of people served across all forms.Results in an aggregate report can be filtered in several places. Depending on how and where you add filters, the results that are displayed in an aggregate report grid may end up being filtered many times.Whenever a filter is added, it is noted by a ~.Filtering a data source will limit the results that can be used in all sections of the aggregate report. In this way, it is similar to using Global Values in a traditional Apricot report.To filter a data source, expand the white arrow next to Data SourcesClick the green text of the report section you would like to filter.When the pop-up window opens, click the plus sign to the right of Filters.Create a rule.Select Apply.Filters can be applied to an entire column if the aggregate report section is set to \"single source\" or \"source per column.\"To create a column filter, click the column header.When the pop-up window opens, click the plus sign to the right of Filters.Create a rule.Click Apply.Filters can be applied to an entire row if the aggregate report section is set to \"single source\" or \"source per row.\"To create a row filter, click the row header.When the pop-up window opens, click the plus sign to the right of Filters.Create a rule.Click Apply.Filters can be applied to an an individual cell no matter what section type has been selected.To create a cell filter, click into the cell.When the pop-up window opens, click the plus sign to the right of Filters.Create a rule.Click Apply.In addition to filtering results, optional properties are available for individual cells. When you click into a cell and the pop-up window opens, they are listed under \"Type\".\nWhen adjusting a row, column or cell several display and function options are listed under \"type\".Row count is the default setting and will display the data associated with the \"total rows\" from the underlying report.\nDistinct Record Count is available when an aggregate report section pulls data from more than one form in the database. If your underlying report has more than one columns from more than one form, you will be able to choose which records to count.Under Type, select Distinct Record Count.Under Options, select the form you would like to count in this aggregate report section.Click Apply.Section Summary can bring over data from the column summaries from an underlying report - for example, if you have an underlying traditional Apricot report that has calculated average age of attendees as a column summary. In order for these values to appear in an aggregate report, you must have column summaries turned on in an underlying report section and then create an aggregate report section that uses that report section as a data source.To access section summary options, click into a cell.Under Type, select Section Summary.Under Options, select the summary value to be displayed in the cell.Click Apply.Note: For more information on the types of calculations that are available, please see the Knowledge Base article \"Aggregate Report Calculation.\"Calculations can be added to any individual cell in a grid.To access the calculations, click into the cell.When the pop-up window opens, select Calculation under Type.Under Options, select the calculation you would like the cell to display.         Sum: adds the results from the surrounding row or column,\n         Average: averages the results from the surrounding row or column,\n         Minimum: displays the minimum value from the surrounding row or column,\n         Maximum: displays the maximum value from the surrounding row or column,\n         Mode: displays the value that appears the most times from the surrounding row            or column,\n         Standard Deviation: displays the amount of variation within the surrounding row            or column.\n\n  4. Select row, column, or cell.  5. Click apply.\nIf you have static numbers that you would like to use in an aggregate report section - a projected goal or a fixed cost, for example - these can be added to a cell by adding a number.Click into a cell.Under \"Type,\" select Number.Under Options, type in the desired number.Click Apply.Text can be added to a cell to further clarify reported findings.Click into a cell.Under \"Type,\" select Text.Under Options, type text.Click Apply.","title":"Advanced Aggregate Report Options","url":"https://apricot-articles.socialsolutions.com/en/articles/3703420-advanced-aggregate-report-options"}