{"content":"The Apricot Aggregate Report Builder provides the ability to create calculations in any cell in a grid. Calculations can be created for an entire column, an entire row, or for a selected group of individual cells.Calculations in an aggregate report must be set at the cell level and cannot be set at the row or column level. More information about each of these options can be found below.To set up a calculation, click into a cell.Under Type, select Calculation.Under Options, select the type of calculation you would like to perform. Your options are:            Sum,\n            Subtract,\n            Multiply,\n            Divide,\n            Average,\n            Minimum,\n            Maximum,\n            Mode,\n            Standard Deviation.  4. Then select the cells that will be used in your calculation. Your options are:\n           Column: Will use all the numbers in the cells of the column in the calculation.                Row: Will use all the number in the cells of the row in the calculation.\n           Individual Cells: you will identify each individual cell to be used in the                             calculation. The calculation type \"Sum\" will add the numbers in your data set together and display the answer in the cell where you have placed the calculation.Note: As seen in the screenshot we are totaling the columns. 31 + 137 = 168. Please note that the sum can only add up what is above the cell.The calculation type \"Subtract\" will subtract the numbers in your data set in the order they appear. In the example above, the calculation is based on 31-137 = -106.This type of calculation is best used with a data set created from individual cells rather than an entire row or an entire column.Note: Please note that the subtract function must be in a cell below the cells it is referencing. The calculation type \"Multiply\" will multiply the numbers in your data set together and display the answer in the cell where you have placed the calculation. Note: Please note that the multiply can only multiply what is above the cell.The calculation type \"Divide\" will divide the numbers in your data set in the order they appear. In the example above, the calculation is based on 31/137 = .22627737226277.This type of calculation is best used with a data set created from individual cells rather than an entire row or an entire columns. Note: Please note that the divide can only divide what is above the cell.The calculation type \"Average\" will find the average of the numbers in your data set and display the answer in the cell where you have placed the calculation. Note: Please note that the average can only average what is above the cell.The calculation type \"Minimum\" will display the smallest number in your data set. Note: Please note that the minimum can only define the minimum based on what is above the cell.The calculation type \"Maximum\" will display the largest number in your data set. Note: Please note that the maximum can only define the maximum based on what is above the cell.The calculation type \"Mode\" will display the most common or most repeated number in your data set. Note: Please note that the mode can only define the mode based on what is above the cell.The calculation type \"Standard Deviation\" will display the standard deviation for your data set. Note: Please note that the standard deviation can only define the standard deviation by what is above the cell.Creating a calculation across a column, as in the example above, will use all the numbers in the column (aside from this calculation cell) to create the data set for your calculation. Note: Please note that only cells above the calculation within the same grid will be used.Creating a calculation across a row, as in the example above, will use all the numbers in the row (aside from this calculation cell) to create the data set for your calculation. Note: Please note that calculations by row can only be done from left to right. It is very important to keep the calculation cell to the far right of the grid.You can also create a calculation for any selected cells, whether or not they are in the same row or column. This can be useful if you need to create subtotals in a grid that need to be calculated separately from the entire column or row. To create a cell by cell calculation:Click into the cell where you would like the calculated result to appear.Under Type, select Calculation.Under Options, select your calculation type.And then select Cells.Click the plus sign to add a cell to the calculation.In the top drop down, select the column of the cell to be included in the calculation. In the bottom drop down, select the row of the cell to be included in the calculation.             \"Cell Value\" will display the value in the identified cell so you can double                        check that you have identified the correct cell.\n              Repeat steps 5, 6, and 7 for each of the cells to be included in your                                calculation.Click Apply when finished.","title":"Aggregate Report Calculations","url":"https://apricot-articles.socialsolutions.com/en/articles/3705107-aggregate-report-calculations"}