{"content":"The Aggregate Report Builder is a premium add-on tool that allows you to create reports that offer a high-level or summary view of your data. This article provides an overview of the advanced features available in the Aggregate Report Builder. For more detailed information on specific features, please search the Knowledge Base for additional articles about Aggregate Reports.An aggregate report can be made up of one or more grid, or section. You may find it easiest to build one grid and then copy it and change the filters, rather than start from scratch every time you create an aggregate report. An aggregate report section can be copied into the same aggregate report or added to another existing aggregate report.Note: Copying an aggregate report section into another aggregate report will automatically copy the data sources into the destination report. If you have filtered the data sources on the destination report and any of these data sources are shared by the grid you are copying, you may see differences in the reported numbers. You can revert these changes by removing the data source filters on the destination report and re-building them at the row, column, or cell level.To copy an aggregate report section, open the section gear box.Select Copy. In the pop-up window, select the name of the aggregate report you would like to copy your section into. The default selection is always the name of the current aggregate report.Change the name of the section, if necessary.Click Copy.Note: If you copied your aggregate report section into a different report, you will need to return to the main Aggregate Reports List and load that report to see your new section. To copy an entire aggregate report, select Copy Report in the right hand palette.Select the aggregate report category where you would like to copy your aggregate report.Name your new report.Click Create.The page will automatically load the new aggregate report you created. \nAggregate reports can be exported to a spreadsheet. This feature is accessed on the run version of the report.On the run version, select Export from the right hand palette.Select to export:           All Grids\n           One Grid. When you select to export one grid, you have the option to export to             .CSV.   3. Select file format:           .XLS: Your aggregate report will be exported as an Excel 97 - 2003                                  spreadsheet.\n          .XLSX: Your aggregate report will be exported as an Excel 2007 spreadsheet.          .CSV: Your aggregate report section will be exported as a .CSV (comma                           separated value) file. Note: This option is only available when you have opted               to export one grid.","title":"Aggregate Report: Advanced Features","url":"https://apricot-articles.socialsolutions.com/en/articles/3705154-aggregate-report-advanced-features"}