{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.AFF is built to manage the workflow and access of three key types of users: Funders, Applicants and Reviewers. Each of these types of users will have a different level of access to the information in an AFF database.An Applicant is any organization or individual using the AFF database to apply for funding.An applying individual might be a student, artist, or another individual who is seeking funding. An individual might apply for one grant several times or apply for more than one grant at the same time. These users will be accessing an Applicant Profile form to set up their contact information and an Application Intake form every time they apply for grant funding.Because applying individuals will be accessing the AFF database to enter data and submit information to the Funder, they will be added to the AFF database as users. They will have access to their own login information and permission to access specific forms for entering required data and completing their application for funding. They may also need access to the same or additional forms after they have received funding, either to report on how their funds are being used or to apply for the next round of funding.The AFF database restricts which forms and what kinds of information an applying individual can access, see, create, and edit.If you are setting up a new grant, you may need to create a new \"sample\" applicant user in the database where you can outline what forms an applying individual can or cannot see. When a new applicant fills out an Applicant Profile form and sets themselves up as a new user, their access will be copied from this sample user.1. To create a new sample user, click the Administrator tab at the top of the page.2. In the left hand menu, select User/Group Profiles.3. Select User Profiles.4. Select New Users.\nCreate a username and a password for the sample user. You will not really be using this information to log into the AFF database, so you do not need to remember the password.2. Name your sample user. It is best to use a name that will describe what kind of access this sample user will have. When you need to choose a sample user later in the process, this will make it easier to remember.3. Under \"User Type,\" select Guest.4. Save Record. After you save the record, click \"continue\" to stay on the same page and scroll down the page to a section called Assigned Permission Sets.\nNow that we have named our sample user, we need to outline what forms it can access.1. Scrolling down the same page, you will see a section called Assigned Permission Sets.2. Select Add.3. The \"Name\" column will list the groups that have already been created in your database. You may already have a group for individual applicants.4. To the left of it, select new. This will allow you to create a new permission set for this new sample user you are creating.Name your permission set.2. Under \"Permissions,\" you will see a list of all the forms that have been created and published in your AFF database. If you need to allow access to a form that is not listed here, double check that the form has been published.3. At the top, you will see a list of the kinds of access available. An applying individual should *only* have access to view, create, and edit *only* the forms that are necessary to complete an Applicant Profile and an Application Intake. There may be several forms for both of these processes depending on what your organization requires from an applicant. In the example above, the forms in the example above have been labeled simply as the kinds of AFF forms they represent; your forms may have more specific names according to the needs of your organization.4. When creating a new sample applicant user, always mark \"User RLA Applied\" for every form they will be accessing.- User RLA (User Record Level Access) means that a user governed by this set of permissions will only ever be able to see the records they themselves have created. This is necessary because you do not want an applying agency to be able to see an application belonging to a different applying agency.When you have finished outlining the permissions, scroll to the top of the page and save your changes.This article is step 1 of 2-step process. Follow this link to learn how to create Secure Web Forms.","title":"AFF: Setting up Applicants","url":"https://apricot-articles.socialsolutions.com/en/articles/3705848-aff-setting-up-applicants"}