{"content":"The \"Limit\" feature in the Apricot Report Builder can display and compare records based on those that were created earliest (first created) or most recently (last created). If you are unclear about what a limit section or an alias is, more information can be found by clicking here.\nTroubleshooting a report by removing filters from one area of the report and adding them to a different area has the potential to change your report in ways you did not expect. To minimize these changes, copy your report first or publish it so that you can revert to a previously published version. This will allow you to ignore or undo your changes if necessary.Filters in the main section show results that have been filtered *after* the limit has been applied. In the example above, the results were first narrowed according to the limit of \"first created\" and the filter showing service types matching \"Counseling - Individual Session\" was applied second.The example above now shows the filter being applied to the limit section for the previous report. Adding a limit here will apply the filter *before* the limit. Here, the results are first narrowed to service types matching \"Counseling - Individual Session\"  and *then* narrowed to show the first created record.Filters added to an accompanying limit section will be displayed in the original report section as well as in the accompanying limit section, provided the limit section is made visible (Not set to \"hidden\").With the above information in mind, it is clear that the location of the filter has a big impact on the results of reports with limits applied. Depending on your reporting need, it may be necessary to move a filter from the main report section to the limit section.\n\nWhile you can not move filters, you can recreate them in limit sections. To do so, delete it from the main section and add it to the accompanying limit section. You will need to click the gray \"Show\" button for the limit, which will enable you to add filters within in. Please keep in mind that in many cases you will also need to pull the filtered column into the limit section itself. You can add fields to the limit section the same way that you would add fields to a standard report section, which will then enable you to filter on that data point.","title":"Troubleshooting: Report with Limit Section and/or Aliases","url":"https://apricot-articles.socialsolutions.com/en/articles/3711771-troubleshooting-report-with-limit-section-and-or-aliases"}