{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.AFF's Grant Module (see article: Grant) manages the workflow around several key forms (see article: Required AFF Forms) . These forms can be turned on or turned off during specific periods of time in a particular funding cycle. Forms that are turned on will be accessible for users to create, edit, and complete.The Grant Tool manage access to all the Tier 2 Forms that are created under the Tier 1 Form Application Intake. The Tier 1 form can either be accessible at any time for editing or it can be manually locked by the Funder. Because some Funders would rather have access to the grant application to be restricted according to phase or time period, like other Tier 2 forms under the Application Intake form, some agencies choose to create a different workflow with a form called a Grant Cover Sheet.A grant cover sheet form is a Tier 1 form that is created exactly like a Tier 1 Application Intake form. But it collects very little data. Data that would be collected in a grant application is collected instead on a Tier 2 form created under the grant cover sheet form.Creating a Grant Cover SheetWhen creating a grant cover sheet form, include information relevant to a specific grant or funding request. It should be simple information like grant funding year and possibly a brief program description.An applying agency or individual applicant will fill out a new grant cover sheet form for:Each new grantEach new grant funding cycle and/orEach individual prposed program1. When creating a new grant cover sheet form, open the top gear box.2. Under \"Apricot for Funders Form Type,\" select Application Intake.3. Apply. \nAdding a Grant Field and a Link FieldBecause the grant cover sheet form is accessed at a particular point in a grant funding cycle, it must contain certain specific fields before the AFF database will allow it to be published.The grant cover sheet form must contain a grant field (see article: Grant Field) and a link field (see article: Linking Field). These will connect the grant cover sheet form to the grant tool, which will allow an AFF Administrator to turn the form on and off as necessary.Configure the Link FieldThe link field must connect the Application Intake form to the grant cover sheet form.Configure the Grant FieldThe Grant field must be connected to the link field.","title":"AFF Application Intake/Grant Cover sheet","url":"https://apricot-articles.socialsolutions.com/en/articles/3712519-aff-application-intake-grant-cover-sheet"}