{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.AFF's Grant module (see article: Grant) manages the workflow around several key forms (see article: Required AFF Forms). These forms can be turned on or turned off during specific time periods in a particular funding cycle. Forms that are turned on will be accessible for users to create, edit and complete.The Reviewer Profile form is a Tier 1 Form to be completed once by each reviewer (see article: Reviewer) prior to the review part of the funding cycle.When creating a Reviewer Profile form, include basic information that is not expected to change from year to year. This could include contact information for your reviewer, for example, or identifying an area of expertise.In subsequent years or funding cycles, the information included in the Reviewer Profile form will remain in the AFF system and will not need to be re-entered. It can be updated if necessary, but should not contain any information that is expected to change between one funding cycle and another or that needs to be tracked historically.Creating a New Reviewer Profile Form1. When creating a new Reviewer Profile form, click the top gear to access the form properties window.2. Under \"Apricot for Funders Type,\" select Reviewer Profile.3. Apply.\nAdd a User Creation FieldBecause the Reviewer Profile form is accessed at a particular point in a grant funding cycle, it must contain specific fields before the AFF database will allow it to be published.The Reviewer Profile form must contain a User Creation field (see article: Fields-User-Creation-Field) which will allow a reviewer to create their own username and login credentials at the time they fill out the form. Once they have done this, they will be able to log in to the AFF database to view completed applications and reported data, fill out a Review Scorecard record (see article: Form: Review Scorecard), and complete any other required documents.Before a Reviewer Profile can be published, you will need to have a guest user (see article: Guest-User-Access) with the same permissions you would like to give your reviewers already set up in the system. ","title":"Form: Reviewer Profile","url":"https://apricot-articles.socialsolutions.com/en/articles/3712824-form-reviewer-profile"}