{"content":"Note: Social Solutions no longer offers Apricot for Funders, and related features are no longer supported by our Product and Development Teams. For that reason, the information in this article may in some cases not reflect current functionality. Apricot for Funders is still supported by the Apricot Support team for existing clients on the platform. Please reach out to the Apricot Support Team with any questions you may have about Apricot for Funders that are not answered here.AFF's Grant module (see article: Grant) manages the workflow around several key forms (see article: Required AFF Forms). These forms can be turned on or turned off during specific time periods in a particular funding cycle. Forms that are turned on will be accessible for users to create, edit and complete.The Review Scorecard is a Tier 2 Form that lives under the Application Intake Tier 1 form (see article: Form: Application Intake). It is created or started by the AFF funder/administrator (see article: Funder) and completed by a reviewer (see article: Reviewer) during the review period of a funding cycle. At least one Scorecard is completed for each application that has been completed by an applying agency or individual (see article: Applying Agency or Individual Applicant).A Review Scorecard form is required and must be created for the grant tool to operate properly.When creating a Review Scorecard form, include option fields (likert scale or radio button fields, for example) or text fields where reviewers can rate an application with established measures and provide recommendation for funding.At least one Review Scorecard will be completed by each assigned reviewer for each application that has been submitted to the Funder and assigned to the Reviewer. One application could have several Review Scorecard forms. One Reviewer could complete several Review Scorecard forms for different applications. Creating a New Review Scorecard Form1. When creating a new review scorecard form, click the top gear to access the form properties window.2. Under \"Apricot for Funders Form Type,\" select Review Scorecard.3. Apply.\nAdd a Review Assignment FieldBecause the Review Scorecard form is accessed at a particular point in a grant funding cycle, it must contain specific fields before the AFF database will allow it to be published.The Review Scorecard form must contain a Review Assignment field (see article: Form: Review Assignment) and a link field (see article: Linking Fields). These fields connect the form to the Reviewer Profile form.Configure the Link Field\nThe Link field must connect this form to the Reviewer Profile form. This relationship should be set as \"1 to Many\" so that Reviewers can create multiple Scorecard records.Configure the Review Assignment Field\nOnce a link has been established between the Reviewer Profile form and the Review Scorecard form, open the Review Assignment field and connect it to the new link field.","title":"Form: Review Scorecard","url":"https://apricot-articles.socialsolutions.com/en/articles/3712848-form-review-scorecard"}