{"content":"Apricot for Violence Survivors (AVS) is a database that has been set up with a standard process for entering data. It allows you to enter new information about clients who are receiving services from your organization. It was built primarily for organizations that provide services to survivors of domestic violence.AVS has been set up with a series of pre-built reports that pull data from the database. There are two kinds of reports in AVS: standard reports and aggregate reports. These instructions detail how to run and read a standard report. For information on how to run and read an aggregate report, please see the Help Center section on 2020 ESG CAPER and HUD APR Report.To access your reports, click the My Apricot tab at the top of any page.In the left hand menu, select My Reports. Expand a black arrow next to a report category to view the report titles.Some reports are marked with a lock icon. This indicates that the report has been restricted or locked by Social Solutions staff. It can still be run, but it may not be edited. Note: If a report is restricted but you want to adjust it to more closely match your organization's reporting requirements you can make a copy of the report and adjust the copy.Hover your mouse over the Actions tab. You may choose:Run: Shows you the results of the report.Print: Opens your browsers print mode. This is always how you can export a report to a .pdf.Export: Exports the report results into a .XLS, .XLSX, or .CSV spreadsheet.Edit: Opens the report for editing. The title of the report will be listed at the top.  In the example above, the report is counting \"Units of Service.\"Underneath that, you may find a description that details what sections have been built in the report. Not all reports have a description.Global Values is an area where the user who is running the report can enter values to change the results.In the example above, the global values can change the run dates for the report as well as which Funder is being counted.Under Forms, you can see which forms have been pulled into this report. In the example above, our report is looking at data pulled from the Client Profile form and the Services form.Under Filters, you can see how data was filtered to give the results as they are shown. In the example above, our report is looking at records with a date entered into the \"Date of Service\" field on the Services form that falls between the dates 01/01/2015 and 01/31/2015. If we wanted to change these dates to something else, we would adjust the dates in the global filters area from Step 3.Many AVS reports display header rows of data. In the example above, the report is \"grouped\" around the name of different kinds of services that have been provided to clients - Community Outreach, Outreach Advocacy, Outreach/Family Care, Transitional Living, and Women's Shelter.To the right, we can see the \"Services Count.\" The report is giving us data on how many times a particular service has been provided. Community Outreach is a service that has been provided 2 times; Outreach Advocacy has been provided 6 times. To see more details on the data that was collected, we can expand the black arrow next to the header displaying the name of the service.Each column represents a field where data is collected on a form.Each row represents a single record. Clicking on the text in a row will take you to that record. If you see data on a report that seems incorrect, you have the ability to click on the row and open the record to edit and make appropriate changes. In some cases, a pre-built report may return \"No Matching Rows\" or say \"Total Rows 0.\" This means that the report has searched the database for relevant records but found none that matched all of the requirements in the report. If you see this, there are a few things you can change or check to help your report return more results.If your report is using values entered in the Global Values area, you can adjust the date range or whatever has been entered here to provide a larger sample size. In the example above, perhaps these dates are so far in the past that we were not entering much data into the Apricot database during that time.Look at the forms that have been pulled into the report. In the example above, the report is pulling information from two forms: Client Profile, and Program Enrollment. If none of the users have been creating Program Enrollment for our clients, then the report will not find anyone who has all of three of those kinds of records.Look at the filters. In most cases, the filters have been set up to pull very specific kinds of data from the database according to an established reporting standard. But when you look at these filters, you may see a field that is not often filled in by users or a piece of information that is not often tracked by your organization.To edit or make changes to a report, select Edit in the right hand palette. To export a report as an excel spreadsheet, select Export in the right hand menu.Your report will be exported according to your internet browser protocols. Once it has been downloaded, you can open it and view it as a spreadsheet.Note: There are steps in-between 1 and 2 not listed here. For more details on exporting reports please see the article: Exporting Reports","title":"Reading Standard AVS Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/3714994-reading-standard-avs-reports"}