{"content":"A permission set governs which specific forms, reports and bulletins the users of a specified program will be able to access an can be found or created within a program folder.In order to create a new permission set, you'll first need to either create a new program or navigate to one of your existing programs to edit it. In the below example, an existing program is being edited.\nTo edit a program, you can follow these steps:Click on the Administrator tabUnder the category \"Access Control,\" choose the option \"Sites & Programs\"Choose the site that contains your desired program (every organization has at least one site which is named \"Default\")On the right side of the desired program, click on the eye to view/edit the program detailsOnce in the Program profile, you can locate this Permission Sets section (pictured above) where you can either edit an existing permission set or create a new permission set.Name your permission set. Each permission set will outline very specific kinds of access. A program may need to have more than one permission set depending on the different users within a program. For example, volunteers would most likely need a more limited permission set to client records than a case manager. Under Assigned Users, select \"Add.\" This is where you will find and add the users who will be governed by the specific permission set you are creating.Select the user or users you would like to add to this permission set.Close the pop up window.Save your record.Adding Form PermissionsScroll down to the section called \"Permissions.\"1. Across the top, you will see tabs for forms, reports, bulletins and shared files. If not already selected, click on forms. This will allow you to grant access to specific forms.2. On the left hand side of the grid, you will see a list of all the forms that exist in your Apricot. The indented forms titles are Tier 2 forms.3. Across the top of the grid, you will see different kinds of access.View Record. Users can see data that has been entered on any of the records of this form.Search Record. Users can search for any of the records of this form.Create Record. Users can create new records of this form.Edit Record. Users can make changes to data entered on records of this form.Archive Record. Users can archive or delete records from the system. Note: Standard users cannot be granted permission to archive Tier 1 forms.Ignore Program Assignment. Indicates that the form is not program specific. If checked, users in this permission set will have access to all records of this form regardless of program.Apply User RLA Users may only access records that have been created by or assigned to themselves.Create/Edit Forms Users have access to design features and may edit this form. This will only apply to users who also have the role to edit forms.Adding Report Permissions1. Across the top, select reports. This will allow you to grant access to specific reports.2. On the left hand side, you will see a list of all report categories and reports that exist in your Apricot. Each one can be clicked to reveal the reports within.3. On the right hand side, you will see view and edit permissions.If you expand the black arrow next to a report category, it will show all the reports that exist in that category.Granting access to view or edit a report category will automatically grant access to all the reports in that category.Adding Aggregate Reports PermissionsAdministrators cannot adjust Aggregate Report permissions. You will need to submit a support ticket in order to have that permission granted. Create an email case or chat in with:The exact name of the permission set that needs Aggregate Report Access (a direct link is also preferred)The exact names of the Aggregate Reports/ Report Categories support should enable within that permission setAdding Bulletin PermissionsAcross the top, select bulletins. This will allow you to grant access to specific bulletins.On the left hand side, you will see a list of all the bulletins that exist in your Apricot. This includes inactive bulletins.You can grant view access to any of these bulletins. TIP: If you wish to allow access to a Report Bulletin (a Bulletin which contains a report's results) you must give the user access to the report as well as the bulletin.Adding Shared Files Permissions1. Across the top, select shared files. This will allow you to give access to specific shared files that have been uploaded to your Apricot.2. On the left hand side, you will see a list of any shared files that have already been uploaded to your Apricot.3. On the right hand side, you can grant view access. This will also grant access to download the shared files.Scroll back to the top of the page and select Save Record.From an existing program, you can find the Permission Sets panel either on the right or at the bottom of your list (if your browser is too narrow to place it on the right).On the right-hand side of each Permission Set, there is an eye. This is the button to edit this permission set.Once you've entered the Permission Set record, you can archive it using the \"Archive Record\" button in the \"Record Options\" panel.","title":"Permission Sets - Legacy Permissions","url":"https://apricot-articles.socialsolutions.com/en/articles/3746802-permission-sets-legacy-permissions"}