{"content":" This document outlines Mobile Apricot Beta capabilities. Mobile Apricot Beta requires Connect/Intake, and is therefore an opt-in for Administrators of Core/360 databases.  Mobile Apricot streamlines the most utilized capabilities of Apricot – searching, creating and editing records. Mobile Apricot allows users to find and enter data in fewer clicks, and therefore know exactly where they are delivering services.  Why Beta? Beta testing is an opportunity for Apricot users to try new capabilities in their production environments so that development teams can learn more, address issues, and refine the user experience before a full-scale release. During Beta, Bonterra will also be completing the body of work to support Form Logic and Email Triggers in Mobile, Intake, and Connect.  Release Includes: Two opt-in toggles: \"Admins Only\" and \"Standard Users\"Search records View records from the Document Folder View linking relationships Create new Tier 1 & Tier 2 records  Edit existing Tier 1 & Tier 2 records Create Internal & External Referrals Switch between sites & programs Switch Mobile to Desktop  Switch Desktop to Mobile Submit Feedback from Mobile  Known Limitations:The majority of Form Logic conditions & actions are not yet supported. Users are shown a warning on the top of the form if unsupported conditions & actions are present.  Supported conditions: Empty/Not Empty, Condition Logic (and, or). Supported actions: Require Field, Require All Fields Within Section. If a field is unsupported in Connect, it is unsupported in Mobile, please refer to this list for clarification.Calculations will not compute in Mobile. You will need to enter field data in Mobile then switch to Desktop to run calculations. It may take up to 2 minutes for a newly entered record in Mobile to be searchable within Mobile.  To Enable Mobile Apricot: Navigate to the Administrator tabSelect Apricot Settings Under “Beta Features” check the appropriate box to activate Mobile  Users can access Mobile Apricot both at the start and during their session.  Accessing Mobile at session start: A toggle on the login page will appear if we sense you are on a mobile device (768px width, height not a factor). Keep the toggle on to be routed to Mobile. Turn off the toggle and user will be routed to the typical Desktop view.  Accessing Mobile during a session: Users can access Mobile at any time from Desktop by clicking into the user badge and selecting “Switch to Mobile” above Logout in the menu. User will be taken to the corresponding page in Mobile (ie same Document Folder, same Tier 2 form). Note: If user switches to Mobile from an unsupported featured (Intake, Reports etc.), user will be routed to the Mobile homepage.  Mobile Homepage & Side Navigation  If user enters Mobile at the start of the session, taps “Apricot” in the top navigation or “Home” in the side navigation at any time, they will be routed to the Mobile homepage.  \nFrom the Mobile homepage users may:  Search Records - Clicking into the search bar or magnifying glass in the top navigation bar will launch search Switch Between Sites & Programs - Clicking the pencil icon will open the list of Sites & Programs available to the user. Select preferred Site & Program and Mobile will show only the appropriate Forms & Records.  \n3. Create new Tier 1 Records - Users can easily create new Tier 1 records in two clicks. Tap the Tier 1 form name on the Homepage to open the Tier 1 form. If form is not in the first five (respects Desktop order):  4. Show More - Tapping “Show More” will open a scrollable list of all Tier 1s the user has permission to complete.\nThe side navigation bar contains many useful elements including the ability to:  Return to the HomepageSwitch to Desktop View - Note: User will be routed to the corresponding page in Desktop (ie same Document Folder or Form).Create New Tier 1 Records Logout Create New Tier 1Once the user selects the Tier 1 form from the homepage or side navigation, the form will appear for completion.  If the Form has required fields, a red asterisk will appear, and the form cannot be saved until those fields are completed.  User can exit the form anytime by tapping “Cancel”. Note: If there are any unsaved changes, user will be warned. To create a record, tap “Save” when all data is entered.  Searching Records Searching records is easy in Mobile Apricot. Users can search on any field that has been made “Searchable” on a form by their administrator.  Search is accessed by the user clicking the search bar on the homepage or clicking the magnifying glass icon in the top navigation at any time.  To begin a search:  Select the Tier 1 form the record belongs Enter search criteria Tap the green button with the magnifying glass icon   Note: Currently it is not possible to pick which field you want to search on, or search on multiple fields. If this is desired, please submit your thoughts via “Submit an Idea” in the side navigation.  In Results, if searchable fields and quick views fields are not the same, it is possible that search results will appear that do not contain the search term in the record preview. Search Results - Once user taps the green search button, previews of the record will appear in Results. The number of records that match the search term will be populated next to “Results”. The Record preview is comprised of the Record Name in bold and the quick view field that appears first in the form along with the Tier 1 form name. If the first quick view is not filled out in the record, the second quick view will appear in the preview, and so on. Record previews are infinite scroll. If user does not see the record they are looking for, keep scrolling or refine the search term. Tapping on the record preview will open the Document Folder for that record.  Mobile Document Folder The Mobile Document Folder is very similar to the Desktop Document Folder experience.  There are three tabs:  Document Folder Tab - From the Document Folder tab, users can access the All Documents table, where all Tier 2 forms available to the user can be located, and all previously completed Tier 2 records can be accessed.  Overview - From the Overview tab, users can see the Quick View card and Recent Activity taken on the Tier 1 record. Links - From the Links tab, users can see if the Tier 1 record is associated with any other records in the system, ex. enrolled in a class or part of a household.  A user can quickly search for a specific Tier 2 form by entering the form name in the search bar in All Documents.Overview Tab From the Overview tab, users can take several actions in addition to viewing Quick View information and Recent Activity.  1. To take action, user taps the kebab menu to the right of Record Name 2. To edit the Tier 1 record, tap “Edit” (1), make appropriate edits (2) and tap “Save”(3) to finalize edits. 3. To create a new Tier 2 for the record, tap “Create” (1) and select the appropriate Tier 2 form (2). Users can also open a new Tier 2 form from the All Documents table by tapping the plus icon (2). To edit an existing Tier 2 record, select the record underneath the Tier 2 form in the All Documents table (1).  Note: Tier 2 records are sortable by the form’s quick view fields.  4. To create an internal referral, if permissions are configured to handle, or external referral, tap “Create Referral”. The process to create a referral is the same as Desktop.  Select the Program the Tier 1 record will be moved toFrom the dropdown, select the new owner of the Tier 1 record Choose any Tier 2 records beloning to the Tier 1 to move to the new program as well Add any notes for the receiving Program’s usersIf user is making an external referral, to an employer or service provider, tap external referralLinks Tab To see other records associated with the Tier 1 the user is working with, navigate to the Links tab (1).  The Linked to Table shows the records the Tier 1 record you’re working with is linked to, where the base link is on the Tier 1 record you’re working with The Linked from Table shows tier 1 or 2 records linked to the Tier 1 record you’re working with, where the base link is on the linked form Entering Mobile Feedback  To provide feedback on Mobile Apricot, or about any other parts of Apricot, users can access the new Ideas Portal by:Opening the Side NavigationTapping “Submit an Idea” A new tab will open, and user will be routed to their feedback account. To enter feedback, tap “Make a Suggestion” and enter thoughts as prompted. \n","title":"Mobile Apricot Beta","url":"https://apricot-articles.socialsolutions.com/en/articles/3832247-mobile-apricot-beta"}