{"content":"Connect is a tool within Apricot Core and Apricot 360 that allows you to interact and communicate with your participants better than ever before. This functionality can empower your participants by enabling them to edit their own information and monitor their journey through your program. And when you use Connect to allow participants to enroll in services themselves, or to send out mass communications through direct messages, you can also dramatically reduce the amount of data entry and computer time required by your staff. This tool helps drive participant engagement from day one and even after your participants graduate or move on from your services or care.We hosted a webinar to show all the tips and tricks of Connect:We consolidated the most common questions asked during the presentation below:Does Connect work with our forms that have logic/email triggers on them?Most forms with Form Logic are not supported in Connect, meaning you cannot assign those forms for participant completion. Currently, we support two conditions and two actions:Conditions: Empty/Not Empty, Condition Logic (and, or)Actions: Require Field, Require All Within Section However, our development teams are currently working on getting Form Logic as well as Email Triggers supported. We are aiming to finish by summer 2020.2. Is there a voice option to the direct messaging platform?Currently, robo-call/phone tree-like functionality is not something we have on the Connect roadmap. If this is something that would be highly beneficial to your organization, please submit the idea or reach out to the Product Owner at tmoorhead@socialsolutions.com.3. Can a voice recorded message be added to a text or email message?Yes! You can attach an audio file up to 5MB to an email Direct Message.4. What is the difference between Intake and Secure Web Form?Intake and Secure Web Forms are similar in that they allow users to make an Apricot form available for completion by non-Apricot users. Intake is much newer than SWFs and is where we are focusing our development efforts.The benefits of using Intake:Ability to capture Tier 2 informationAbility to name your form and label your fields for public audiencesAbility to add your logoMobile-first design for easy completion on devices The benefit of using a SWF (until summer 2020):Ability for non-Apricot users to complete forms with Form Logic and Email Triggers 5. It would be great if users could send direct messages, not just admins... is this in the works?We totally agree! We are planning to add Connect as a Product Area Role on 4/24. This means Admins will be able to grant Standard Users access to Connect this month! More information and step by step instructions to come.6. I thought Connect was just for existing clients. Did your slide imply that in the Intake, a new client that currently doesn't exist in the database can fill out the intake form?Connect is a suite of capabilities that is meant to engage participants and save your staff time throughout the participant journey. Intake, a part of Connect, allows admins to publish intake forms. When an intake form is submitted, a new Tier 1 record is created in Apricot. One thing to note, Intake respects duplicate check and will not allow existing participants to complete the intake form.7. When a client updates their info, does it send a notification to staff?Currently, when a participant makes a change to their demographics or completes a form in Connect, a notification is not sent to staff.We are working hard to get Email Triggers supported, which would send a notification. In the meantime, I recommend you create reports (or report bulletins) which will show edits made and form completions via Connect. Our Support team would be happy to help!8. What does the initial email say that goes to the client letting them know they need to login to Apricot? Can we add agency-based info to the initial email?The initial email greets the participant, informs them that has granted access to Connect and provides the link with instructions to set a password and link (see screenshot)At this time, you cannot customize this message. However, we’ve added your request to the Connect backlog and will be looking to provide the ability to include custom text soon. If you would like updates, please reach out to the Product Owner at tmoorhead@socialsolutions.com.9. Can you add your own questions / customize intake forms?Yes! You can include, or not include, as many fields from a Tier 1 and a Tier 2 as you would like. You can also choose to label your field names, so they are external facing. Note, required fields in Apricot will still be required in Intake. Our Support team would be happy to help!10. Are we able to select which clients to send the invitation to for them to sign up on connect?Yes! After configuring the Participant Type, all available participants will appear in the Unregistered tab. From there you can select who exactly gets an invitation to Connect.11. How do you filter on clients to develop a participant list? e.g., I want only the Housing clients for a Housing Participant list.Currently, there is not a sophisticated way to filter participants lists. You can restrict the table to show only participants that have been updated in the last year and filter by Site and Program.We have added the ability to filter and/or search participant lists based on a Tier 1 field (ie Inactive/Active, Program Name etc.) to the near term Connect backlog. If you would like updates, please reach out to the Product Owner at tmoorhead@socialsolutions.com.12. How do the participants get access to the portal? Do they need to download an app? Or do we send them a message to go in to update info, request services, etc?Participants do not need to download an application to use Connect. We opted for mobile-responsive browser experiences vs. an app for a variety of reasons, app development is not our engineering strongpoint and we want to decide when fixes and enhancements are released vs. a third-party app marketplace.As soon as you register a participant, they are sent an email with login instructions. You can always send additional information (i.e. how to request services) via a Direct Message.13. Are there detailed instructions on how to set this up?Great question. The email participants receive to set up Connect is not exhaustive, but we have built an intuitive experience. If you would like to provide additional instructions, you can always send a Direct Message email as a follow-up.We will also be adding the ability to include custom text in the invite email soon. If you would like updates, please reach out to the Product Owner at tmoorhead@socialsolutions.com.14. Can we pre-fill part of a form before sending it to a client?Great question! Currently, you cannot pre-fill fields in a form because Default Values are not quite supported yet. We’ve heard this is a need from several clients, so we’ve moved up supporting Default Values up in our roadmap. If you would like updates, please reach out to the Product Owner at tmoorhead@socialsolutions.com.15. Are messages sent through Direct Messages encrypted?Messages sent through Direct Messages are not encrypted. However, data entered and shared via Portal is because Portal uses the https protocol. We will be looking to add a Notification functionality to Portal for this very reason. If you would like updates, please reach out to the Product Owner at tmoorhead@socialsolutions.com.16. What about linking fields? (And, can the forms via Connect involve links? (E.g. a service plan with several linked goals, sent to client to then sign?)Having participants complete linking fields in Connect is currently not supported. If your form has a linking field that is unrequired, the linking field will not show up in the form. If the linking field is required, Connect will show an error.However, forms can be edited by staff after submission via Connect to add the appropriate link.17. How can we quickly re-work forms with links that currently are not compatible with Connect?Very quickly. For the time being, we recommend de-requiring any linking fields. If links are critical, create reports for staff that show form submissions coming in that need links added. Our Support team would be happy to help!18. What would pricing for Connect be like after the free period?We have not decided on upgrade pricing after Sept. 30, 2020, right now we are focused on getting nonprofits and public sector organizations capabilities that are critical in the current climate.19. Is there a calendar connection, like Calendly?We have not extended Apricot’s Google or MSFT Exchange calendar integrations to Connect at this point. This is something we would like to do in the future (appt scheduling with automated text reminders). If you have a specific use case you’d like our Product team to know, please reach out to our Product Owner at tmoorhead@socialsolutions.com.20. How do multi-language options work?We’ve seen several organizations use field labels in the Intake Form Builder to either translate the field entirely or provide the translation.ex. Consent to receive text messages / Consentimiento para recibir mensajes de textoIf you are applying a field label to a multiselect field, make sure the answer choices remain reportable.21. Can you schedule direct messages? For example, can we schedule follow-ups for X days after intake?We have not built scheduling logic into Direct Messages (or Portal) yet. We have scoped the work but have not scheduled the work. We agree this could be very powerful. If you would like updates, please reach out to the Product Owner at tmoorhead@socialsolutions.com.22. Our agency has 200+ programs, do you need to set Connect by program? Is this a feature that can have a quick turnaround time to activate?It is not necessary to set up Connect program by program. The first step in configuring Connect (Portal & Direct Messages) is setting up a Participant Type based on a Tier 1. Therefore, you could have one participant type, “Clients”, for a very quick setup, or many participant types broken down in a way that makes sense for your organization, which will take longer to configure. Our Support team can help you decide a path forward.23. When you send a DM to a client, does it automatically document that communication in the client's respective file?Currently, we do not include “Sent Direct Message” as an activity in the Document Folder. However, if you attach a form for completion to the text or email, when completed, that record will automatically be filed in the Document Folder.24. With Direct Messaging, is there some way to record correspondence on text and email automatically in notes with each Participant? (Outreach attempts, and any Participant replies?)We have not built two-way communication or an outreach counter that would sync back to a notes field on a Tier 1 or Tier 2 record. This sounds interesting and we’d like to understand better what you’re trying to accomplish, please reach out to our Product Owner at tmoorhead@socialsolutions.com to discuss further.25. What is the best way to train staff on use of Connect remotely, with confidential considerations in mind? (Is screen sharing on zoom considered safe?)As training best practices differ between organizations, we are hesitant to say what will work best for you. If you are interested in personalized training with Social Solutions, please reach out to trainingteam@socialsolutions.com.Additionally, we recommend reaching out to Zoom for your confidentiality and security questions as they are best positioned to answer.26. During the intake process, will the participant need a login for each person in the household?If you are creating a Connect account for a household, you may designate a head of household to own the account and complete activities for the household. Make sure to select the head of household’s email when creating the Participant Type.27. The population we serve usually doesn’t have access to emails. Is there a way in the intake feature to only send a tier 2 form and not the tier 1? Our team wants the ability to have the tier 1 form (universal profile) created already and only send out the tier 2 form (consent form).Intake is used to create new Tier 1 records in the system. It sounds like you have the Tier 1 records already and want to send a Tier 2 for completion via text, not email. We would point you to Direct Messages where you can send participants a text with a URL to a Tier 2 for easy completion. Our Support team would be happy to help you set this up.28. Does Connect work with allowing one username access to multiple participant profiles? Such as multiple children profiles accounts, with one parent username going into access and update forms.Currently, Connect is 1:1, one account per Tier 1 record. We understand this is not ideal for families when a parent needs to complete forms for multiple children. Our Product team is currently thinking through the best way to handle this. Make sure to upvote this in the Ideas Portal!29. With Direct Messaging does a client have to have set up their client portal (logged in) to receive the direct message?Great question. A participant does not need to have logged into their Connect (Portal) account to receive a Direct Message, however, they do need to be registered (this is how Apricot knows where to put forms completed by text and email).30. Does the Direct Message feature allow participants to update already existing information (e.g. contact information) or can they only create new questions?Direct Messages only lets participants create new records. Contact information can be made available for updates via Portal. Participant Type > Edit Permissions > Personal Info, admins can select which fields participant can view and update in their account.31. Are Connect and Direct Messages HIPAA compliant?The Apricot platform is HIPAA compliant but emails and texts coming out of the system are not encrypted over the public internet. Use caution when choosing PII that is included in the body of a text or email through Direct Messages or email triggers. If an Apricot Tier 1 or Tier 2 form is included in a message, those forms are Https secure.32. Can the forms done by clients on Connect create the document folder?If a participant completes an Intake Form, a Tier 1 record and Document Folder is created.33. I am being told that only 1 username can be created to access connect - and can not be created and used ever again. Example janedoe@gmail.com, can only be created once, and never used again after being registered once to use connect.This is currently the case; however, our development team is working on allowing for re-registering. That capability is set to be released 4/24. If you would like progress updates, please reach out to the Product Owner at tmoorhead@socialsolutions.com.","title":"Connect Webinar and FAQ","url":"https://apricot-articles.socialsolutions.com/en/articles/3881379-connect-webinar-and-faq"}