{"content":"Administrators can grant Standard Users Connect access by assigning the Manage Connect role. Once granted Standard Users will be able to create participant types, register participants, send Direct Messages and more. \nTo assign Connect access to a Standard User, navigate to the User Details Page and click “Edit”. Scroll to the second section “Assigned Roles” and click “Add”. This will open the above dialog box. In Roles Search, users can scroll to the External Access Product Area, or use the search functionality for quicker access. Expand the row by clicking the triangle and find the Manage Connect role. Click Manage Connect and move to the next step. Upon clicking the Manage Connect role, a link will appear in the Assigned Roles section. If no other changes are needed on the Users Page, click “Save Record” in the top right side palette. Once the User record is saved, the User will see the Administrator tab in addition to My Apricot in their view. From the Administrator tab, they may now access Connect.Please note that Standard Users permissions (Programs) are respected in Connect. Standard Users will not be able to register or send messages to participants, they do not have access to. It could be the case that the Administrator view, and Standard User view is different. We will illustrate that here. As seen above, the Standard User we are working with only has access to one program: Hogwarts. However, there are additional programs in the site, as you can see below.When this Standard User navigates to “Participants” (Portal) they are only able to see Participant Types based on the Tier 1 in the Hogwarts program. As the Standard User is operating in the Hogwarts program, they are seeing a subset of existing Connect participant types. Below is the Administrator view (All Sites & Programs), as you can see there are two additional Participant Types. 2. Please note, Standard Users will have to ability to edit Participant Types if given the Manage Connect role. 3. Standard Users can also create new Participant Types based on the Tier 1s they have access to, in this case Hogwarts Students.\n\nPermissions (Programs) are also respected in Direct Messages. This Standard User can only see Direct Message statistics that include participants, they have access to. Below is the Administrator view (All Sites & Programs), as you can see there are Direct Messages outside the Hogwarts Program","title":"Assigning Connect Access to Standard Users","url":"https://apricot-articles.socialsolutions.com/en/articles/3921934-assigning-connect-access-to-standard-users"}