{"content":"Disabling and Archiving Connect Participants may seem very similar on paper, but these two options have distinct functionality that is important to know before enacting any changes in your Participant Types. Disabling a participant removes their ability to log into the Connect Portal, but still keeps that participant's account data intact in case you want them to be able to log in again at some point in the future. If this case does arise, then you would simply re-enable their account data and their login credentials would still be intact. First, locate the participants you would like to disable.To locate a participant:Open the Administrator tab,Click on the Connect dropdown on the left-hand menu to expandSelect Participant from the ‘Connect’ drop-down options.Select a Connect Participant Type and click view.Then, to disable a participant within this Participant Type you would need to: Use the search field, if necessary, to locate the participant you want to disable. Type into the search field to narrow your search results.When you have located participant, click the checkbox next to the participant.Once you have selected the participants that you would like to disable, click \"Disable\" located below the Registered tab. Archiving removes the record of participant's registration through your Apricot Connect participant type. The archived participants will appear as unregistered participants. Participants that have been archived in error can be restored by simply following the same steps to register a participant to a participant type. Archiving participants can be helpful if you need to change the registered email address of participants, or if you need to move a participant from one participant type to another.First, locate the participants you would like to archive.To locate a participant: Open the Administrator tab,Click on the Connect dropdown on the left-hand menu to expandSelect Participant from the ‘Connect’ drop-down options.Select a Connect Participant Type and click view. Then, to archive a participant within this Participant Type you would need to: Use the search field, if necessary, to locate the participant you want to archive. Type into the search field to narrow your search results.When you have located participant, click the checkbox next to the participant.Once you have selected the participants that you would like to archive, click \"Archive\" located below the Registered tab. *** If a participant is archived by mistake, the participant can be registered in the participant type again. ***Please Note: Archiving a participant and re-enabling them will resend the welcome to Connect email. However, participants can always use the Forgot My Password link on the login page to establish their password after the welcome email expires.  ","title":"Disabling and Archiving Participants in Connect","url":"https://apricot-articles.socialsolutions.com/en/articles/4169360-disabling-and-archiving-participants-in-connect"}