{"content":"The Census Data Dashboard is an interactive map powered by a google maps integration that allows users to dig into the demographic make-up of the communities they serve.Users can search for a City, State, Zip, County or specific location by selecting the Search icon on the map and typing in their search request.The user can zoom in and out of the map by using zoom quick keys or by selecting the “+” and “-“ icons on the lower right area of the map.As the user zooms in on the map, different boundary lines will appear segmenting by either Counties or Census Tracts depending on the user’s current zoom level.Counties: Counties will be identified by name and can be selected to view demographic data for that county.Census Tracts: Census Tracts are labeled by the fist 4 digits of their tract ID and can be selected to view demographic data within the bounds of the defined area. Census tracts were designed specifically to give a more granular level for population and demographic data collected through the annual census.The user can select different filters to overlay locations of entities like schools, food banks and shelters on their Census Map by selecting the map icon (located below the search icon) and choosing from a list of filter options. Multiple filters can be selected at one time.Upon hovering over a location populated by one of the filters, the user will see the name of the entity and can click to expand and view additional information about that entity. This includes name, address, link to website, phone number and hours of operation.When a tract or county is selected, a card will appear below displaying data points from the current demographic category selected in the drop down above the card carousel. The color of the card will correspond with the color of the county or tract that it pertains to. The user can select up to 5 counties or tracts to compare at one time. Chart View: In addition to displaying demographics and population data in a card format, the user can select the chart icon to view data displayed in new bar charts. There is additional sub categorization of data that the user can select via radio buttons.Drag & Drop: The user can now drag and drop to rearrange demographic cards for a better comparative analysis experience.The user can now enable a Census Data Integration in the document folder for address data on Tier 1 forms.To enable this integration, the user can select a new field property for Address Look-up Fields in the form designer. This field property is only applicable for Tier 1 forms. The user can enable Census Data in the document folder for multiple Address Look-up Fields. Once the form is published, the user can navigate to the document folder to view the demographic and population data for any address from an enabled Address Look-up Field on any given record.Once enabled, the document folder Census Card can be located in the Overview tab.The user can select different data categories to view demographic and population for as well as toggle the display to the chart view option.From this card, the user can select VIEW ON MAP to populate the address on the Census Data Dashboard. The user can also use the street view feature to get more insight into the location.","title":"Census Data Dashboard","url":"https://apricot-articles.socialsolutions.com/en/articles/4284831-census-data-dashboard"}