{"content":"There may be times when you want to use an image, such as a logo, on a form. You can do this by adding a link to the image to a Label (HTML) field.In order to add an image to your form, you will first need to pull a Label (HTML) onto your form. You can find this field type under the Special category in your Field Options palette, as shown below: Head to this article if you are unfamiliar with the process of editing forms.Many times, you may want to use an image that is currently not hosted online. You can use the Shared Files to get around this limitation. Additionally, you can use this method if you are afraid the URL to an image that you are using elsewhere might change (or the hosting service may change the image).Note: For both Secure Web Forms and Intake Forms, images must be hosted outside of Apricot Shared Files or on a public web page. First, make sure the image you want to use is saved onto your computer. In our scenario we will use the Desktop.Optional: you may already have a Shared File Category that you want to use, if you do you may skip these next few steps.Head to the Administrator tabClick on Shared Files under Workflow StationClick on Create New CategoryGive the Category a nameClick on CreateNext, we will choose UploadSelect a CategoryClick on 'Choose File' and locate the imageChoose UploadNext, we will need to copy the Image URL.Click on My ApricotChoose My Shared Files under My Apricot ToolsExpand the Category which the image was placed inHover over ActionsRight click on DownloadSelect \"Copy link address\" Note: Depending on your operating system and/or browser the wording may be slightly different.Next, we will head to the form that you are creating/editing and add the image to the Label (HTML) field.Click the green gear icon to the right of the field you added to open the Field Properties Menu.Once the menu is open, click the image icon.Paste the URL that was copied into the \"URL\" box. It should start out with         \"https://apricot.socialsolutions.com/upload/download/\". If it does not, it did not         copy properly.Click the refresh icon to see a refreshed preview of the image. Note: The text   below it will not show up on the form.You may adjust the Width and Height to re-size the image.Click OK.Finally, remember to publish your form after making any changes.","title":"Adding Images to a Form","url":"https://apricot-articles.socialsolutions.com/en/articles/4319079-adding-images-to-a-form"}