{"content":"Click the biggest green gear box at the top of the page to open the properties that govern an entire form.You can edit the form name and add a description. Choosing a name that accurately reflects the type of data being collected will increase its usefulness and value. Descriptions added here will appear on the list of available forms in the Form Designer.Adjust settings:Hide from Navigation Menu: checking this box means that the form will be placed into a category called \"Hidden Records\" in the left hand navigation menu on the my Apricot tab. Users will need to click the \"Hidden Records\" option to see records of a hidden form.Allow Search by Linked Forms: checking this box means that when searching for records that have been created of other forms, the searchable fields available in this form will be available in the search drop-down.Allow Copies: allows users to make copies of records. If \"Allow Copies\" is selected here, then a field property called \"Clear on Copy\" will become available to fields that are added to the form.Enable Form Logic: allows you to add conditional rules to a form that apply in very specific cases. Fields can become hidden or un-hidden, required or not, locked or unlocked; use various look up lists depending on other field values; set a value based on other field options; or be highlighted based on what your users fill out.4. Set the Program Assignment Type - can be set to:User selects program assignment: Each time a record is saved, the user will be prompted to select which programs are assigned to new records.Assign Records to the Form's Associated Programs: Any programs with access to at least view and search records of the form will be assigned to each newly created record.Assign Records to User's Active Programs: The linked permissions of the User determine which programs are assigned upon record creation.5.  Set the Record Name for the form - The Record Name will determine what is displayed in the upper left hand corner of each document folder for each record of the form, and will also determine what is displayed when linking to records of this form, and what is displayed as the Identifier Field when pulling in the form's record ID column into a report and selecting the data style \"With Identifier Field(s).\" It also controls what is displayed in Print Mode for tier 2 Records.6.  The Form Properties window will display which fields are set to Quick View or Searchable.7.  Click 'Apply' then Publish the form for your changes to take effect. Click the biggest green gear box at the top of the page to open the properties that govern an entire form.You can edit the form name and add a description. Choosing a name that accurately reflects the type of data being collected will increase its usefulness and value. Descriptions added here will appear on the list of available forms in the Form Designer.Adjust settings:Allow Batch Record creation?: checking this box will allow users to create Tier 2 records for more than one Tier 1 record at one time.Allow Copies: allows users to make copies of records. If \"Allow Copies\" is selected here, then a field property called \"Clear on Copy\" will become available to fields that are added to the form.Record Limit: checking this box brings up a number field that will allow a limit to be set for the maximum number of records of the form that can exist in a Document Folder. Hide from Document Folder: checking this box means that the form will not be shown in the document folder's list of tier 2 forms.Enable Form Logic: allows you to add conditional rules to a form that apply in very specific cases. Fields can become hidden or un-hidden, required or not, locked or unlocked; use various look up lists depending on other field values; set a value based on other field options; or be highlighted based on what your users fill out.4. Set the Program Assignment Type - can be set to:User selects program assignment: Each time a record is saved, the user will be prompted to select which programs are assigned to new records.Assign Records to the Form's Associated Programs: Any programs with access to at least view and search records of the form will be assigned to each newly created record.Assign Records to User's Active Programs: The linked permissions of the User determine which programs are assigned upon record creation.5.  Set the Record Name for the form - The Record Name will determine what is displayed in the upper left hand corner of each document folder for each record of the form, and will also determine what is displayed when linking to records of this form, and what is displayed as the Identifier Field when pulling in the form's record ID column into a report and selecting the data style \"With Identifier Field(s).\" It also controls what is displayed in Print Mode for tier 2 Records.6.  The Form Properties window will display which fields are set to Quick View or Searchable.7.  Click 'Apply' then Publish the form for your changes to take effect. ","title":"Form Properties","url":"https://apricot-articles.socialsolutions.com/en/articles/4446403-form-properties"}