{"content":"If a participant reaches out regarding an issue while filling out an intake form, go through this list with them and have them try submitting again:If they are on an iPhone, it may be necessary to have them use a desktop in order to capture necessary error information from the browser's consoleHave them clear their cacheHave them disable any browser extensions they may have installed or they can try submitting the form in an incognito windowEnsure they are filling out all required fields on the formEnsure they are not putting invalid characters into a field (for example, letters into a phone number field)For image or document uploads, determine if the participant is uploading the appropriate file type and that the file is no larger than 25MBIf a participant has trouble accessing or updating their Tier 1 record or certain fields from the portal, go through the following steps:Verify that the form permissions for both the Tier 1 \"Personal Info\" and Tier 2 \"Form Permissions\" are set up properly for the program in the Participant TypeDetermine whether the participant is entering invalid characters or pasting text from another application (such as Word or Google Docs)Sample Scenarios:If a Tier 2 Form isn't visible in the participant portal even though program access is granted, check that the Tier 1 Record (often the Client or Participant Profile) has access to the program as wellIf all fields in the Tier 1 record have the correct values but a participant is unable to save, ensure the participant has view/edit permissions in the Participant Type for those specific fieldsIf you are not able to solve the issue after going through these steps with your participant, reach out to Support via chat or email with the information you collected from the participant, including but not limited to:The name of the record where the issue is occurring and/or a link to the intake formThe name of the participant experiencing the issueThe specific fields they are attempting to updateThe exact error message the participant received and have them provide a screenshot if possible. For example: If Support is unable to determine the cause of an error with this information they may ask for a screenshot of the Error Console. Have your participants follow the steps in the article to provide the screenshot. For a more in depth look at Connect and all its features, check out the article titled Apricot Connect.","title":"Troubleshooting Connect with your Participants","url":"https://apricot-articles.socialsolutions.com/en/articles/4734602-troubleshooting-connect-with-your-participants"}