{"content":"*DISCLAIMER*This article goes over how to add and manage users in Role Based Permissions, not Legacy Permissions. If you are currently utilizing Legacy Permissions then you would want to access this article.Your Apricot database has a limited number of user seats available. These users are split up into Standard and Administrator seats. What these user types entail is detailed at a later point in this article. Users who once had access but are no longer allowed to use the database are called \"Inactive\" users. The history of what records they created or edited will remain in the system even after they have been deactivated.Note: Administrators take both an Administrator seat and a Standard User seatNote: Some sites may have \"Guest\" as an option. This is because you have Guest User access enabled (a premium, add-on feature).If you believe you require more user seats, you can request them from your Account Manager at an additional cost.Adding a New User: To add a new user, select the Administrator tab at the top of the page. On the left hand menu, select \"Access Control\"This will reveal several options. Click on \"Users,\" which will bring you to your users listOnce on the Users page you can start the User creation process by clicking \"New User\" in the top right hand corner. *In order to create a user, admins will need to fill out an email address and name for the New User. There is no requirement on adding Roles/Programs to create a user, though that can be accomplished at this point as well.1. Add New User’s email address2. Add New User’s first and last name3. Select the User TypeStandard users have access to log in and edit data in the Apricot database. Their access to certain forms, records and reports can be managed or limited by Administrators.Administrator users have the same access as Standard users, but in addition they also have access to the Administrator functions under the Administrator tab at the top of the page. Access for Administrator users cannot be edited or limited.Guest users have very limited access to Apricot. More information on guest users can be found in the Help Center section on Guest User Access.4. Select which Site(s) you want to associate the User with5. Assign Role(s) and Program(s) *Optional4. Send Invite – When Send Invite is selected, an email containing a link to login to Apricot will be sent to the email address specified for the New User. The New User can then login to Apricot and create their password. If no Roles/Programs have been set up for the New User, they will be able to log in but will not see anything in Apricot.**IMPORTANT NOTE**: The login link contained in the invite email will only be valid for 30 minutes. After 30 minutes the link will expire and a new invite will need to be sent.Invited (on the Users Page): When a New User has been created, there will be a detail on their User Card that says ‘Invited’. When the New User logs in for the first time, this detail will go away.Additionally, there will be a snack bar on the User Details page that indicates that this user has been invited and has not logged in. An admin can resend their invite via a link on this snack bar.Managing Users on the User Details PageYou can find the User Details Page for a user by clicking on their User Card located on the Users Page. The User Details Page is where admins can make changes and updates to specific users.Update User Info: An admin can update the name and email address for a user by selecting the Update button or by clicking on the name or email address fields.Deactivate/Activate User: An admin can move the Active toggle to activate or deactivate a user. Once a user has been deactivated, they can no longer log in to Apricot or access any part of your database, and they will no longer take up one of your user seats; however, certain details about them will remain in the system - information about what records they created or edited, for example, will still be recorded. Because Apricot keeps track of this kind of historical data, users cannot be completely deleted.Update Password: Administrators can manually reset their password if they remember  their old password. Force Password Reset: Clicking this will force this user to reset their password upon their next login. Send Password Reset Email: Clicking this will send a password reset email to the user. This is a great method of unlocking user accounts if they're unable to get logged in! Assigned Roles & Programs: If an admin needs to change/update a user’s Role or Program assignment, they can select the pencil icon next to the Role/Program that they wish to edit. If an admin needs to add a Role or Program, they can do so by selecting Add. User Preferences: Admins can update the User Preferences for any user. *Standard Users can update their own preferences as wellYou can read more about role based permissions by clicking here!","title":"Adding and Managing Users - Role Based Permissions","url":"https://apricot-articles.socialsolutions.com/en/articles/4778187-adding-and-managing-users-role-based-permissions"}