{"content":"Navigate to your Administrator tabOpen Connect and click \"Settings\"Copy URL from settings page to provide Participants to login pageIn the event that a Participant did not receive the initial email, or perhaps they just forgot their password, you can provide the Participant with a link to the Connect Login page. From here, they can click \"Forgot Your Password?\" which will send them another email to reset their password. Make sure they check their spam if not received. This is the Participant's View when they first log in to their PortalThe blue sidebar shows the programs and forms available to themForm Submission is where they can review any records they have previously submittedOn the main page, the Participant can decide which form they need to fill out depending on the program**Note: This example Participant has two Positive Parenting Assessment forms in their Portal because of the Form Permissions in Connect. Review how to adjust Form Permissions in the linked article if the available forms seems incorrect.  **Note: Connect will log participants out due to inactivity after 1 hour. The top right corner of their portal is their Participant Badge. This is where they can either Log Out or access their Account Information. Account Information is their Tier 1 Participant Profile information. You can adjust which fields they are able to view/edit on their Tier 1 record based on the Permissions you set in the Participant Type. Here, a Participant can change their password or update fields such as their address or phone number.Note: It is discouraged that Participants be able to edit their emails. They can do so, however, their initial email serves as their Connect Username and cannot be changed unless you archive the Participant, change their email, and then re-enable them in the Participant Type. If they need to change their email for their username, you can follow the steps here to Archive a Participant in Connect.Here, participants can view previous record submissions including records filled out for them in Apricot.The pencil (edit) icon will appear for the participant if they have edit permissions enabled for the specified form. This will allow the participant to edit forms that they have already submitted.The eye (view) icon will allow the participant to view the submitted record.","title":"Connect Portal","url":"https://apricot-articles.socialsolutions.com/en/articles/4792111-connect-portal"}