{"content":"Introducing Apricot Schedule! Apricot Schedule is a feature available to Core/360 platforms and redefines how appointments are created and conducted in your day-to-day operations. With this brand-new integration, you’ll be able to eliminate the pain of double-data entry and schedule appointments directly through Apricot.Functionality & FeaturesThe new Apricot Schedule will replace the existing Calendar Integrations functionality in Apricot by allowing you to sync your external calendar accounts, schedule appointments, and link your video conferencing account right from within Apricot!  Apricot Schedule uses Cronofy for secure access to your calendar and the calendar services supported include Apple, Google, Microsoft Exchange(including on-premise), Microsoft Office 365, and Microsoft Outlook.com.How to Configure Apricot Schedule:Once Apricot Schedule is turned on for your organization, you will need to configure the calendar.  You will need to be signed in as an administrator in order to do this. When you click to configure your calendar, Apricot will take you to a configuration page where you will tell us what Tier 1 form you are using to create participants. This Tier 1 form will populate a dropdown when you are adding an appointment and will comprise the list of who you are able to add an appointment with.  Once you tell Apricot what Tier 1 form, you will then be prompted to indicate the Name and Email field that Apricot should use from that form. You can also choose a “Participant Quick View Field”, which will be used as a secondary identifier when adding an appointment.  You can add up to 2 Tier 1 forms.  This configuration will apply across all sites and programs. How to sync a calendar account:Once you have configured Apricot Schedule, you will need to sync your account to begin. By clicking to configure your calendar account, you will be taken to another page to determine what provider and account you would like to sync with Apricot.You will need to agree to the Cronofy Terms of Service and Privacy Policy. Cronofy is the third party provider that we have partnered with in order to implement this calendar functionality in Apricot. This is a requirement to enable the integration.You will click to link your account and it will take you through a verification process in order to sync your account. Once you have completed the verification process then you should be redirected to Apricot and you are ready to use Apricot Schedule! You can also sync your account from the Add Calendar page in the upper righthand corner (accessible through the ellipses button).How to link video conferencing accountNot only can you sync your calendar account, as well as additional calendar accounts, from the Add Calendar page, but you can also link your video conferencing account. After linking your account and following a similar verification workflow, your account information will auto-populate the Location field when you are adding an appointment.Simply click on the link in order to begin the workflow!How to manage your availabilityYou can also set additional availability in Apricot, making certain times and days unavailable.This is particularly helpful if you are out of office or in the field on certain days every week.Simply click on different times to make yourself unavailable and click save.Similarly, you can extend or minimize your availability start/end times. This should be viewed as additional layer of availability configurability, in addition to what you already have set in your external calendar account.  How to view existing appointmentsOnce you have synced your calendar you are able to view your calendar in a multitude of ways – by month, week, or day.At any point, you can click on an appointment and expand it to see a high level overview of the appointment – date, time, names of attendees, location, and description. Note: You are able to edit/delete appointments from the high-level overview popup if the appointment was created in Apricot Schedule. Any appointments brought over from a synced calendar will not have the ability to edit/delete from Apricot.If you have a particularly busy day, you can always click on “ … X more” for that day to see the rest of your appointments.How to view others’ calendarsWith the new functionality, you can see your coworkers’ calendars, if they have synced their calendar with Apricot.Simply click “Calendars” in the upper righthand corner and select which calendars you would like to also view. The different calendars will show as different colors on the main screen.Note: The colors of the staff calendars are not static; they change. In other words, Staff A might be purple one day, but green the next.Note: At this time, your individual calendar will be the only calendar that remains checked by default. Other staff calendars do not remain checked (and therefore shown) if you navigate away from the page.How to add an appointmentIn order to add an appointment, click on “Add Appointment” in the upper righthand corner. Search for your participant. This dropdown will populate with a list of records from the Tier 1 form that was indicated on the Configuration Page. The dropdown will show the Participant Name and the Participant Quick View Field (secondary identifier for the participant). Note: The Participant Quick View Field dropdown is populated from the list of elements on the selected participant form which have Quick View checked.Note: A participant’s name will be grayed out if they do not have an email address filled out.Select your participant. You can select multiple participants.Select the staff attendees – This can be yourself or this can be other staff members. Note: At this time, a user can chose any other staff member, meaning a user can add an appointment to any other user’s calendar.Select the date/time of the appointment.Fill in the appropriate Appointment Title and Description. Check the box to include Video Conference Info, if you have already linked your video conferencing account from the Add Calendar page.Type in the location, if not already auto-populated with your video conferencing account information.Click \"Add\". This will add the appointment to all Staff Attendees’ calendars and it will send an appointment notification email to participant attendees at the email indicated on their Tier 1 form.Note: If you click the “Add Appointment\" button, you will need to click “Cancel” to get back to calendar.Note: Apricot Schedule appointments will not be available in record audits, as they are not Apricot records.How to view a participant’s upcoming and past appointmentsAlong with the new calendar, you can also view the upcoming and past appointments for a particular participant!Simply navigate to the participant’s Document Folder and click on the new Appointments tab, and you will be able to see all of the upcoming scheduled appointments from the Schedule tab or any past appointments from the History tab.This is particularly beneficial when you have just met with the participant and you want to ensure that the participant has all necessary upcoming appointments scheduled or to check to see if they already attended certain appointments.Right from this page, you can add an appointment for the participant.Changing the information in an appointment, like the description, will resend the appointment email with the updated information.","title":"Apricot Schedule","url":"https://apricot-articles.socialsolutions.com/en/articles/4799702-apricot-schedule"}