{"content":"If you need to set up Connect or create a Participant Type, please begin by following the article called Apricot Connect, then return here.When you register a participant in Connect, you are giving them access to log in to Connect. Any individual participants you do not want to have access to Connect can remain in your Participant Type as unregistered. Click the Administrator tabUnder Connect in the left menu, select ParticipantsSelect View to open the Participant TypeClick the Unregistered tab to view your unregistered participantsIf necessary, use the search bar to filter individuals by Name, Site, or Program*Select the individuals you wish to register. If you would like to customize the email that will be sent to your participants with their login information, click the text to \"Add some custom email language.\" (Optional)Click Create Account*Please note children under 13 may not enter data in Connect, so you should avoid registering them if your Participant Type include records for children under 13.Upon registering the participants, you will receive an Account Creation notification like the one above. This will show which of the individuals should have successfully received an email with a link to set up their Connect account. An error may be present if the email address is already registered in Connect or if the participant record does not contain an email address. Troubleshooting Note: If you are getting an error that the email is already registered in Connect but you cannot find that user, it will most likely be due to the Tier 1 record getting archived in Apricot before being archived in Connect. You can fix this by restoring the record in Apricot, then finding the participant in Connect and archiving them. Finally, re-archiving the record in Apricot should let you register the participant with no errors.If a Connect Participant opts out of Connect, this cannot be undone and they will need to be registered again with a new email. Initial Connect Registration invite links expire after 30 days. If this occurs, the participant will need to be registered once again in order to gain access.If you need to remove a participant from Connect, please see our article on Archiving a Participant in Connect. ","title":"Registering Participants in Connect","url":"https://apricot-articles.socialsolutions.com/en/articles/4820619-registering-participants-in-connect"}