{"content":"Apricot Support is available Monday - Friday from 7 AM - 7 PM CST. During business hours you can chat in, open a portal ticket, or email our team.Please see our scheduled maintenance, unscheduled maintenance and any open incidents on our status page. Outside of business hours or on holidays you can open a critical case to get immediate support. See our 2023 holiday schedule here.The best way to contact our team after-hours is by emailing us at apricot@bonterratech.comCritical cases are defined as: Client’s production use of the Bonterra Software is stopped or so severely impacted that no User can reasonably continue to use or access the Bonterra Software. Critical requests have one or more of the following characteristics:(a) data corruption, (b) Bonterra Software hangs causing unacceptable delays or (c) the Bonterra Software is inaccessible.Target response time for Critical/Business Down cases will be 2 hour. More on case priorities here.To open a critical priority case:Open a Critical priority support ticket through the portalEmail support (apricot@bonterratech.com) with the word \"Critical\" in the subject lineOr call our emergency line at 1-469-874-0792 Ext. 1 *Calling the line with a non-emergency may be subject to a fine.*Calling the line with a non-emergency may be subject to a fine. Please only use this line if you are experiencing a major functionality issue that prevents users from being able to use software. This is what we would consider an Severity 1 issue. An agent will triage your call and connect you with a support representative to resolve the issue.Bonterra Case Management Emergency After Hours Support: 1-469-874-0792 Ext. 1If you forget your password, you can have a new one emailed to you by selecting 'Forgot Your Password' on the main login page.If you have received a message that indicates you have been locked out due to too many failed login attempts, please see our User Lock-Out Article Here.","title":"Apricot Support | After Hours and Critical Support","url":"https://apricot-articles.socialsolutions.com/en/articles/4892358-apricot-support-after-hours-and-critical-support"}