{"content":"The Ideas Portal is your direct line to our Product and Development teams and allows them to gather feedback and suggestions so that they may make improvements to Apricot, whether they be quality of life adjustments or major changes.To submit a suggestion to the Ideas Portal, or browse existing suggestions, click \"Submit an Idea\" on the lower left of your screen.Once user clicks “Submit Idea, the ideas portal homepage will load in a new tab. From the homepage users can vote, search, view, and sort existing ideas, see their previous submissions and votes, and create new ideasTo search for an existing idea or ideas that meet certain criteria, type keyword(s) into the search bar and hit enter.To see how many ideas and how many votes a user submitted, users should refer to “My ideas” and “My vote” counts.To filter the All Ideas view by category, users can click the desired category. Please note users can only filter on one category at a time. Users can also see the total number of ideas per category in this list. Ideas can have more than one category.Previously submitted ideas are displayed in the All Ideas view. Ideas show as a summary, including the title, first few sentences of the description, category, status and current vote total. It may also include submitter name. To vote for the idea without opening the idea to see all information, click “VOTE”. To see all information collected for the idea, including full description, importance to the organization and any comments on the idea, click anywhere on the idea summary.To submit a new idea, click “+ Add New Idea\"Here are just a few of the great ideas and suggestions that have been implemented by our teams!Rules and AlertsField Level AccessRemove Auto Generated Link to Record in Email TriggersEdit Tier 2 Records in ConnectApricot Connect Select AllAttendance Tracker Reporting in Apricot ResultsCaseload Management for Standard Users...And many more!","title":"Apricot Ideas Portal","url":"https://apricot-articles.socialsolutions.com/en/articles/4901671-apricot-ideas-portal"}