{"content":"The first thing you will want to do is ensure that you have a Support Package that includes call time. You can reach out to your Account Manager in order to verify or purchase a support package. If you do not know their direct email you can email AccountManagement@SocialSolutions.com for assistance! To see the breakdown of each Support Package click here.You can schedule your call one of two ways:Use the chat feature Create a new email case If you chat in to schedule the call, the case will be created and correspondence will continue through email. Please bear in mind that Support cannot in most cases start a call at the time of the request, it is best to schedule your call at least a week in advance, and consider any deadlines that might be coming up for you to have the issue resolved. Support call hours do not roll over from month to month, so the time of the call is credited to the month it was scheduled in. Support calls can be used in 30 Minute or 1 Hour increments only. Requests for a call on the last day of a month are credited to the month they are scheduled in, and will not count towards the previous month. Provide 3 dates and time you are available for the call including your Time Zone (Support operates 7am-7pm CST)Provide a brief description of your issue and/or an agenda for what you would like to cover on the call. Giving us the exact report, form, or bulletin name as well as a direct link will be the most helpful so we can start troubleshooting your issue before the call. Bear in mind that Support is not able to train users on features, but can assist with the step by step construction as long as there is a concrete goal in mind. Once we have this information, we will be able to schedule the call and potentially go over any quick fixes we identify from your initial materials. A link to the zoom meeting will be sent to you via email on the case. ","title":"Setting Up a Support Call","url":"https://apricot-articles.socialsolutions.com/en/articles/4957657-setting-up-a-support-call"}