{"content":"Apricot Core and 360 Administrators have access to a Sandbox site in addition to their live database. Without worrying about affecting users' daily work or the data in your site, Administrators can use a Sandbox to:Test new form configurationsGet to know new features Check for conflicts with current setup when building out new ideas Please note:  Your Sandbox cannot be copied onto your live site. Any changes made in your Sandbox will need to be built into your live site when you are ready to implement those changes.When a Sandbox is created, it will be reflective of your live site at that time and only Administrators will have access. Any standard users will be made inactive, and Administrators will need to manually activate them in order for them to be able to access the Sandbox. That being said, we do not recommend activating standard users within your Sandbox. There is the risk that a standard user could mistakenly log into the Sandbox and input data there instead of in your live site. If that happens, there is no way to copy the data that was input into your Sandbox into your live site. It will have to be manually input into your live site.If you are unsure about whether you already have a Sandbox or would like to request a Sandbox, please Contact Support for assistance!  When your Sandbox is created, all active Administrators will receive a welcome email to log in for the first time. Your username will be the same as the username for your live site.A note about setting your password: If your username and password are exactly the same for both your live and Sandbox sites, you will be able to choose which site to log into.For example, a user with a username of administrator@apricot.com and a password of Apricotapricot123! for both sites will see a dropdown option upon logging in:If your passwords are unique, then each password will log you directly into the respective site. Resetting PasswordsJust as described in our article on User Lock-Out, you can use the Forgot Password link to request a password reset (even if you have never logged in before), and you will receive separate emails to reset your password for both your live and Sandbox sites. Receiving these emails will not require a password reset for each site. You can click on the email for the specific site for which you need to reset your password and delete the other.  Alternatively, if you've lost track of your credentials for either environment you can use both links within the two emails to update both passwords - as mentioned previously, clicking into both and updating each to the same password will allow you to pick your environment upon login.To change your password while logged into either of your sites, click the arrow next to your name and select \"Change Password.\" After making a large amount of changes in your live site, you may wish for those to be reflected in your Sandbox. Up to four Sandbox Refreshes can be run per calendar year.Contact support to request a Sandbox Refresh and have the current version of your live site copied onto your Sandbox to reflect your most recent changes for testing purposes. Any active standard users will be made inactive again upon a Sandbox refresh and will need to be manually reactivated by an administrator if they still need access.Connect data will not transfer into Sandbox sites. Attendance Tracker data entered under Classes & Terms will not transfer into Sandbox sites.Your Apricot Results environment will not be copied to the Sandbox, and will essentially be a fresh environment connected to the Sandbox database.YOU CANNOT BE LOGGED INTO YOUR LIVE SITE AND SANDBOX AT THE SAME TIME. YOU MUST LOG INTO ONE IN AN INCOGNITO WINDOW.","title":"Apricot Sandbox","url":"https://apricot-articles.socialsolutions.com/en/articles/5461315-apricot-sandbox"}