{"content":"This document outlines Caseloads, a security and workflow feature in ApricotThis permission is tied to the URLA permission type in legacy Apricot permissions. The Caseloads Toggle enables record level access for the forms that it’s configured for. Caseloads apply an extra level of security, requiring that Participants are assigned to Caseloads before Users can access their information. Because this is a security feature, it does not apply to Administrators, who will always have access to every Participant.Note that a standard user will be restricted to just the records they are able to see when assigning caseloads to others. If that user is assigned to the role that caseloads is turned on for, they won't be able to assign any participants to other staff unless they themselves have them in their caseload.Setting up forms with the Caseload Manager*DISCLAIMER*The Caseload Manager is only meant to coincide with Tier 1 forms, and cannot be used to configured permissions for Tier 2 forms. If you apply Caseloads to any Tier 2 form on your site it will function exactly as URLA did in Legacy Permissions, where users will only be able to see Tier 2 records where they are selected as the owner on each respective Tier 2 record's owner dropdown. If you would like for your users to be able to access only specific Tier 1 records, but want them to see all of the Tier 2 records associated with that Tier 1 record, then we recommend only enabling Caseloads for the Tier 1 form. In order to use the Caseload Manager, an administrator will need to configure the forms they would like to manage records for. Multiple forms are able to be configured.In order to set up forms, do the following:In the Account Management app, select Caseload Manager from the left menu.Select “Configure Caseloads” button from Forms PageSelect the Tier 1 form you would like to configureSelect a Quick View field from the selected Tier 1 to help distinguish between recordsSelect the programs that you would like to manage records forSaveFrom the forms page of the Caseload Manager, a user can select which form they’d like to manage record assignment for.\nCaseload ManagerOnce a form is selected, the user can manage record access for their staff members by using the Caseload Manager. 1. Search: The user can filter their staff member results through the search bar2. Programs drop down: The user can filter their staff member results by program through the programs drop down. More than one program can be selected and viewed at one time.3. Record Assignment: The user can assign new records to a staff member by selecting the plus icon.Note: Guest Users will not have access to Caseloads, they will need their own RoleIn the Assign modal, the user can filter records by record name or quick view input by using the search bar. The user can also filter records by program assignment.The user can select all records or individual records to assign to the selected staff member.4. Record Edit/Transfer: The user can edit record assignment by selecting the pencil icon.In the Edit modal, the user can filter records by record name or quick view input by using the search bar. The user can also filter records by program assignment.The user can remove records from the selected staff members caseload by selecting the trash icon and saving.The user can transfer records to another staff member by selecting the Transfer tab.After selecting the transfer tab, the user can choose which staff member they would like to transfer records to. Upon selection, all records that are eligible for transfer based on the chosen staff members permissions and the record's program assignment will populate.The user can filter down the eligible records by searching for record name or quick view input using the search bar. The user can also filter down eligible records by program using the program drop down selection.Upon confirmation of transfer, the user will have the opportunity to keep navigating through the modal.My CaseloadThe My Caseload page is located under the My Apricot tab, accessible through the left-hand navigation menu.On this page, the user can view all records that are assigned to them as well as navigate to the document folder for any Tier 1 that falls under their ownership. They can filter records by record name and quick view input by using the search bar. They can also switch forms using the forms drop down selection.**NOTE**Standard users can be given access to manage Caseloads by enabling the Site Administrator permission on their User Detail's page. However, it is important to note this will also grant other administrative permissions. ","title":"Caseloads","url":"https://apricot-articles.socialsolutions.com/en/articles/5569420-caseloads"}