{"content":"Apricot preserves your archived records in case they need to be restored for review or reporting purposes.  Administrators can review and restore any archived records.If your Tier 1 record has already been restored, Jump to Restoring a Tier 2 Record.To restore an archived Tier 1 record, navigate to the Archived Records page under the Administrator tab: Locate the the name of the Tier 1 form for the record you need to restore. Hover over Actions, and then click Search to review the archived records of that form: The Archive Search page for a Tier 1 form behaves similarly to other Tier 1 Search pages. You can pull in search fields from the \"Add Search Field\" dropdown so you can easily find the record you are looking for. When you locate it, click on it to open and review that archived record. While viewing the archived record, you will not be able to make any changes to the record. However, you will be able to see the data contained in the record along with the Record History and a Record Options menu with buttons to Restore, or permanently Delete, or Print the record. Click the Restore button to unarchive the record and place it back in your normal Tier 1 Search location. The record will once again be editable and available for reporting.Note: Restoring a Tier 1 record will not automatically restore the associated Tier 2 records. You must search form by form to restore the necessary records. Restoring will also not reactivate any previous links that were on the records.You will receive a notification that the record has been saved. Clicking \"Continue\" will redirect you to the My Apricot side of your site where the record is available once again, or you can choose to navigate to the client's document folder or Tier 1 Search page.To restore a Tier 2 record, navigate to the Archived Records page under the Administrator tab.You must first ensure that the Tier 1 record is active in your site or restore it first before you can restore any of its Tier 2 records. Locate the Tier 1 form that the Tier 2 form is under and click to expand the dropdown arrow. Identify the Tier 2 form of the record you are looking to restore, then hover over Actions and click Search.On the Archive Search page for the Tier 2 form, you will be able to utilize searchable fields from the Tier 1 and Tier 2 form to easily locate the record(s) you are looking for. Select them from the \"Add Search Field\" dropdown to search, then expand the results to click into the Tier 2 record you need to restore:While viewing the archived record, you will not be able to make any changes. However, you will be able to see the data contained in the record along with the Record History and a Record Options menu with buttons to Restore, or permanently Delete, or Print the record. Click the Restore button to unarchive the record and place it back in the Tier 1 document folder. The record will once again be editable and available for reporting.You will receive a notification that the record has been saved. Clicking \"Continue\" will redirect you to the My Apricot side of your site where the record is now available once again, or you can choose to navigate to the client's document folder or Tier 1 Search page.You will need to repeat these steps for every Tier 2 record that needs to be restored, as restoring a Tier 1 record does not automatically restore the associated Tier 2 records. Click here to review additional information about Archiving Records.","title":"Restoring Archived Records","url":"https://apricot-articles.socialsolutions.com/en/articles/5677944-restoring-archived-records"}