{"content":"The three primary versions of Apricot that Bonterra  offers are as follows. Apricot Essentials -  Apricot Essentials is a simple, easy-to-use case management tool built for small and efficient teams looking to get out of spreadsheets and consolidate their data and reporting in one place.Apricot Core -  Built with the core capabilities you need to keep growing your organization, Apricot Core empowers organizations to better track their data, understand impact, and manage to outcomes.Apricot 360 - Apricot 360 is our most comprehensive case management tool for outcome-focused organizations. With built-in reporting capabilities, data import tools, and powerful integrations, Apricot 360 enables organizations to lead with actionable insights and accelerate change.We also offer a few specialized versions of Apricot! These are built on the foundation of our other Apricot versions, but with some extra functionality for those who need it. Apricot for Violence Survivors (AVS) - Apricot Core with special forms and reports to meet specific violence survivor organizations' funder needs (HUD, VOCA, VAWA).Apricot for Homelessness (AHS) - Apricot Core with special templates for homelessness orgs.Here's an outline of which features come with each version of Apricot. You can also see a comparison of packages by visiting our website.Data Import ToolBest Practice Forms and Reports Customizable Forms and ReportsSecure Data EnvironmentMonitor and Manage CaseloadsSmart Form CreationMobile Compatibility DIY Implementation Option Available 1 GB Storage Everything included in Essentials, plus: Client Information Portal (Connect) Remote Participant Intake (Intake Forms) Client Communication ToolsData Import, Export, MigrationForm LogicReferralsWorkflows Multi-Site Functionality Multifactor AuthenticationAutomated Rules & AlertsAttendance ModuleCalendar Integrations (Apricot Schedule) Sandbox Environment (by request)5 GB Storage Everything included in Essentials and Core, plus: Census Data IntegrationsAdvanced Results ReportingConnect SchedulerAttendance DashboardSandbox Environment Federated SSO10 GB Storage If you have questions about which package you currently have, or which package is right for you, please contact your account manager at accountmanagement@bonterratech.com. We would be happy to assist you!","title":"Apricot Packages | Essentials, Core and 360","url":"https://apricot-articles.socialsolutions.com/en/articles/5908488-apricot-packages-essentials-core-and-360"}