{"content":"Bonterra Academy is an excellent resource for learning how to set up, use and manage your Bonterra Software.\n\nIf you do not already have an Academy Account, you can sign up by following these steps to access this free content. \nGo to: bonterraacademy.bonterratech.com/self-signupEnter your First Name, Last Name, Email Address, and confirm your same Email AddressEnter one Self-Signup Code:For 360 Administrators, Use Code:  360 AdminFor CORE Administrators, Use Code: CORE AdminFor Essentials Administrators, User Code: Essentials AdminFor Standard Users, Use Code: Apricot End UserClick “Register”Check your inbox for an email from system@litmos.com prompting you to choose a password and login for the first time.Complete!Once signed up, login here: bonterraacademy.bonterratech.com.We also recommend bookmarking this page for easy access.Reset your password at any time from bonterraacademy.bonterratech.com by clicking “I’ve forgotten my username/password.” Use more than one, Self-Signup Code to add additional Academy Access. Complete the form and register… then enter your details again with a different signup code (use the same email address to add the additional access to your existing Academy Account).Reach out if you need additional Academy assistance: clienttrainingrequests@bonterratech.comBoot Camps are intensive, multi-day trainings that review all basic capabilities within the software. Labs are 2-hour courses that review single capabilities within the software. These are paid trainings. Purchase these trainings individually or talk to your Account Manager (accountmanagement@socialsolutions.com) about ongoing access with a Training Subscription.Custom Trainings provide an overview of Apricot functionality as it relates to your organization’s configuration and goals. These are designed to cover your data entry process and sessions are taught out of your Apricot  Environment. A training agenda and slide deck will be provided prior to your session. Trainings will be conducted virtually via Zoom. Up to 12 individuals can attend per session. Multiple sessions can be purchased. Questions about purchasing trainings or training subscriptions? Email accountmanagement@socialsolutions.comQuestion about accessing the Academy or specific training materials? Email clienttrainingrequests@bonterratech.com","title":"Apricot Packages and Add-Ons | Apricot Training","url":"https://apricot-articles.socialsolutions.com/en/articles/6088648-apricot-packages-and-add-ons-apricot-training"}