{"content":"US/CA M-F: 7 AM CDT/CST – 7 PM CDT/CSTAUS/NZ: M-F: 10 AM AEST - 2 PM AESTApricot Chat is an excellent tool to ask feature-related questions and search for articles.Apricot Chat is an integration with Intercom that allows users to search for help articles and chat with support while logged into Apricot. This allows clients to get help right while they’re in the product and streamlines our support team's workflow!Please provide all details when you chat in, we can always follow up over email if you do no have time to chat. Alternatively, customers can always contact support through the portal or by email at apricot@bonterratech.comWhen a user logs into Apricot, they will see a new icon in the bottom right corner of the screen.When clicked, the following bubble will open.Start a conversation with a representative by clicking \"Send us a message\" and begin asking questions. Please provide replication steps and the errors you are encountering.Chat can support screenshot sharing. Chat cannot support sharing documents like excel, word, or pdfs. Add attachments by clicking the paperclip icon in the chat window.Please note, sensitive data and PHI/PII should NOT be shared through this chat feature. Although our chat platform is secure, please treat it like email and share only de-identified data or screenshots.Download chat transcripts by clicking the arrow icon inside of the open chat window.Send Gifs and Emojis to react to customer support by finding the smiley face and gif icons in the chat window.To search for an article, type what you’re looking for in the Find your answer now field and click the arrow button (or hit enter on your keyboard), Apricot Chat will show you articles that might help and you can view them right in Apricot.If the first few articles don’t help, you can click See more results to be taken to the search in the knowledge base. https://apricot-articles.socialsolutions.com/en/  When you open a conversation, it will be saved under Your Messages. If you exit ETO and return, the conversations will be saved under See All.Users should open a new chat for every new issue. If a customer re-opens an old chat, the representative may ask the customer to open a new chat.Chats will close after 15 minutes of inactivity. If the User does not respond, the representative will close the chat.Use News to see recent product release notes and feature releases.Chats will be saved, followed-up on, and closed through our Salesforce system. Each chat will be associated to a case number in Salesforce.\n\nCustomers can look at all their cases through the Salesforce Support Portal. They can look at their historic chats through the Chat application.","title":"Apricot Support | Apricot Chat","url":"https://apricot-articles.socialsolutions.com/en/articles/6267119-apricot-support-apricot-chat"}