{"content":"To access the Help Center while you are logged in to Apricot, click the \"help center\" link from the left navigation menu. A new window will open with access to the Help Center.If it is your first time visiting the Help Center, you will be prompted to log in. Follow the steps below if you are a:User within the US:\nClick \"Log in with Apricot\" and the system will immediately create a user account for the Help Center using the email address and password you use to login to Apricot. \nUser outside of the US:\nDue to limitations of a feature known as Single Sign-On (SSO), users outside of the US will need to enter another username and password in order to access the Help Center. You should have received a separate email to set up your Help Center (Community Portal) username and password. If you do not remember your login, you can click the \"Forgot Your Password?\" link.Note: If you receive a sign on error, remove all capital letters from your username and try logging in again.3. You will be taken to the Apricot Support Portal. Here you can access a variety of resources for Apricot.Create a Case. Submit a question to the Customer Care team or report a problem with the functionality of your Apricot. See below for more details. Detailed description of support ticket fields. View Support Cases. Access any of the tickets or cases you have submitted to the Apricot Customer Care team. See below for more details.User Groups. Find and converse with other Apricot users at other organizations. See below for more details.Training. See a calendar of upcoming training events, register for a live webinar or watch a recorded training demo. See below for more details.Knowledge Base. Access our help manual with articles specific to Apricot set-up, configuration, and reporting needs.Set the type and category for your issue/question to help our team identify where in the product you need supportIf the priority is higher or lower than medium, choose a new priority. Critical priority is reserved for software-down or business stop issues. See a list of our priority definitions here.Paste a URL to the form/report/record/etc you're working on hereEnter your subject Enter your case details here, the more detail the better!Click \"Save\" to submit the case to our team! You will be taken to a page showing you your case and the case number that was generated. All cases are set to a status of \"Not Started\" when they are submitted.To view the support cases you have submitted to the Apricot Customer Care team, click View Support Cases on the main portal. You can view the cases you yourself have submitted or any cases that have been submitted from your organization.Expand the drop down menu to see All Cases or to filter down the cases you would like to view.Find the case you would like to review. Click Edit to make changes to the case.The Status column will tell you that the Customer Care team is working to resolve your case.\nChatter / Posts: We ask that you do not use the chatter feed section of your case to communicate with Tech Support agents. Reply to the email thread or add Case Comments to the ticket to communicate with Tech Support agents. This ensures that your latest message to Tech Support is moved into the correct queue in order for Tech Support agents to find it and respond in a timely fashion. Case Details: Include relevant information for tracking your case and for our teams to best prioritize and resolve your tickets. Case NumberUnique number for this case recordAccount NameYour organization's name and the organization this ticket is related toCase OwnerThe name of the technical support representative or team working on this ticketContact NameYour contact information, this is who will receive email updates about the caseProductETO, Apricot, or Penelope TypeFirst layer of categorization of casesSometimes this field doesn't totally encapsulate your issue, that's okay, we are just trying to gauge generally what the issue is about. CategorySecond layer of categorization of casesStatusNot Started - Your case is sitting in a queue and waiting to be accepted by the appropriate teamIn Progress - Your case is actively being worked on by our agents.In Progress - CSR - Your case is actively being worked on by our Cloud Operations team.Waiting on Client - We are waiting on more information from you before we can continue working on the ticket.Needs Resolution Confirmation - We are waiting on confirmation of the resolutions we provided so that we can close the ticket.Waiting on Defect Resolution Confirmation - Your case is waiting on a code fix resolution from Product Engineering / Development Team. These may take longer to close. See Defect Information for more details.Closed - This ticket has closed and our teams are no longer working on the ticket.Case OriginWhere did this case originate? Portal (Help Center)EmailChatPriorityCritical/Business Down – The software is stopped or so severely impacted that no User can reasonably continue to use or access the SSG Software. High – There is a disruptive loss of use of the Software. Important features are unavailable with no acceptable workaround, however, operations can continue in a restricted fashion.Medium – There is a moderate to minor loss of use of the SSG Software or a feature / operation generated a result that was not expected. The impact is isolated and an inconvenience however use and access of the software can continue. Low – Client requests information, an enhancement, or SSG Documentation clarification regarding the SSG Software but there is no impact on the use or access of the SSG Software.More about priorities here.SubjectYour original subject of the case or an updated title for the caseDescriptionYour originally submitted description of the issue. Replication steps, error descriptions, and specific examples are extremely helpful.URLThe URL to the form/report/record/etc you're working onIf your case is awaiting a Development Resolution, you will see the development ticket numbers, statuses, and workarounds in this section. Jira Ticket NumberThe engineering ticket number associated with the case. Multiple cases may be tied to the same engineering ticket number.Is DeployedYes or No. If yes, the defect resolution has been deployed to the software in a recent release. If no or blank, the resolution has not yet been delivered to the product. Defect StateBacklog or Closed. If backlogged, it is in our engineering backlog. If closed, it may be resolved or otherwise closed if the issue we will not addressed at this time.WorkaroundIf a workaround is available for the development issue, it will be noted here. Defect SeverityThere are four levels of severity for defects. Each defect is prioritized based on its severity level. \nSee more here.If your defect is closed as fixed or closed for any other reason, our team will update you via email.  A fixed defect would have a Defect State = Closed and Is Deployed = Yes. Case Comments: Our agents use case comments to provide updates statues, notes, and next actions on a ticket. Our primary communication comes from emails, but you can check cases in the help center to see updated notes on their progress. Additionally, you can choose to communicate with our staff by leaving a case comment. If you leave a case comment, the agent will be notified of the update to the ticket.Emails: This area shows details about the emails sent and received between the support representative and the cases contact. You can click in to the emails to read them and select \"Click here to view HTML version\" to see the emails in their HTML format. This is our primary form of contact on cases. However, we understand seeing a list of emails isn't very helpful when it comes to getting an updated case status. For this reason our team uses case comments to keep long email threads, relevant details, and updated information on the top of the case. Emails will show with different status to mark if they were sent or received. Details below.EMAIL STATUSDESCRIPTIONAdditional NotesNewAn inbound email that has not been read.The contents of the Subject field display in bold for emails with a New Status.ReadAn inbound email that has been read but not replied to.Our team may have replied to the email and it may not have updated this status, look for more recent emails in the list. SentAn outbound email from our team.RepliedAn inbound email that has been replied to. Replying to a sent email gives it a replied status.Attachments: You can attach relevant screenshots, videos, or other documents to your ticket through this field. The User Groups area of the customer portal is a place to connect with other users in other organizations who use Apricot.Click Active Groups to see which groups you would like to join.You can narrow the search results by typing into the search bar.Once you have found a group you would like to join, click the Join button to become a member.Once you are a member of a group, you will be able to ask questions that can be answered by other users or answer questions posed by other users in your group.* Note: In most cases, you can see the activity for a group and participate in the conversations without becoming a member, but you will need to be a member of a group to get updates on new group activity.The Knowledge Base holds all the instructional and step-by-step materials for using and configuring your Apricot database.","title":"Apricot Support | Using the Help Center","url":"https://apricot-articles.socialsolutions.com/en/articles/6282989-apricot-support-using-the-help-center"}