{"content":"There are a couple of things necessary to successfully run a project in Apricot AHS.This article will cover the following:Setting Up a ProjectIndividual Data EntrySetting up HouseholdsHousehold of Enrollment for the Head of HouseholdHousehold of Enrollment for other Household MembersHMIS FormsHMIS AssessmentIncome, Non-Cash Benefits and Health Insurance AssessmentPlease feel free to contact support if you have any questions, or reach out to your CSM for access to training.\nThe first thing necessary is to setup your Project. The Project form houses all the data relevant to the Project itself, including the project type, grant name, funding source, and other bits of information.Please follow these steps to access and enter the data in your Project form:Ensure you are in the \"My Apricot\" tabClick on \"Search Records\" on the site navigationSelect \"Project\"Select \"New Project\" on the right side of the screen under \"Search Actions\"\nNote: If you are looking to edit an existing project, you can click on the Project Name to bring up the existing form instead. You can then click edit in the form page at the very top to make any changes/updates as necessary.Fill out all required fields including the Project Name, Operating Start Date, report type, Organization link, Continuum Project information (includes CoC code), and Grant information (includes funding source). Note that all required fields are denoted by an asterisk (*) in front of the field. Additionally, any unfilled required fields will have a \"This field is required\" message appear.Click \"Save Record\" on the right side of the screen under \"Record Options\"All individuals in AHS must have basic data entry regarding the individual and their PII, as well as Program Enrollment in an AHS compliant Program/Project.Please follow these steps to enter Individual data:Ensure you are in the \"My Apricot\" tabClick on \"Search Records\" on the site navigationSelect \"Individuals\"On the very right, you can select \"New Individuals\" to enter a new client\nNote: you can click on an Individual's name to edit any of their information.Ensure that all of the required data is entered. This includes individual name, and all of the fields that have \"(HUD)\" in them and their associated fieldsContinue to scroll down until the \"Linked Households Records\" section, and click \"Add.\"Click \"Create New\" if the Individual you are adding is the Head of Household, and fill out the required fields and then click \"Save Record.\" Note:If the Individual being added is not the Head of Household, please select the Household to add the Individual to from the list shown.Click \"Save Record\" on the right side of the screen under \"Record Options\"After an individual has been entered, a Program Enrollment must be done for them in an HMIS compliant Program/Project.The Program Enrollment can be entered for each individual from their folder. This can be accessed from Individual search by clicking on an individual's name.If any Program Enrollments exist, you can click this button to expand and minimize this category to show all enrollments. You can click on one of the available enrollments if any changes are needed for the enrollment, or new forms for an enrollment need to be entered.If no Program Enrollments exist, or if a new one is required, you can click this button to enter a new enrollmentIf you wish to edit basic data collected from the individual, you can click \"Edit\" to get to their Client Information page\nAfter clicking to enter a new Program Enrollment, you will be presented with the enrollment form. All necessary information must be entered, however, please note that yours may not look like the screenshot below. Once the initially required data is entered, you can click \"Save Record\" under \"Record Options\" on the right side of the page.After the form has been saved, new sections for the Household of Enrollment, as well as HMIS forms will appear. The HMIS Assessment and the Income, Non-Cash Benefits and Health Insurance Assessment must be filled out for every individual. Please refer to the HMIS Forms section for more information.Please note that the Household of Enrollment is not the same as the Household that is created under the Client Information page. The Household of Enrollment is a Tier 2 form under the Household, this links the members of the Household to their enrollments so that the family structure is presented for HUD compliance.If the Individual whose Program Enrollment is being entered is the Head of Household, you must first click \"Add\" in the \"Household of Enrollment\" section.From here you can now click \"(new)\" to create a new Household of Enrollment for this Individual's specific enrollment.In the new page, you can enter the nickname for the Household of Enrollment. We recommend using a nickname that is easy to identify so that any other associations required to this Household of Enrollment can be done with ease. After the nickname is entered, you can click \"Save Record.\"Once the record has been initially saved, to ensure that this Household of Enrollment appears for all other members of the Household, please click \"Save Record\" a second time.After the Head of Household has their Program Enrollment created and filled out, you can proceed to enter the data for any other household members. The Household of Enrollment section becomes a drop-down field where you can select the Household of Enrollment that the Individual must be added to. The contents of the drop-down are based on the nickname that was created for each Household of Enrollment.The changes on the Household of Enrollment section are based on what is selected for \"Relationship to Head of Household.\" If you have any relationship that is NOT \"Self (Head of Household) selected, and you do not see a drop-down, please ensure that a Household of Enrollment was not accidentally setup as \"Self (Head of Household)\" for this Individual. If this is the case, it can be de-activated and the drop-down will appear.The HMIS Assessment form and Income, Non-Cash Benefits and Health Insurance Assessment are necessary data entry points for AHS and HMIS data compliance. These forms collects necessary information regarding the individual, and the questions that appear are based on HUD guidelines that are dependent on the Project information, as well as other questions answered within the forms. If you ever have any questions regarding what questions should appear, please contact support.An important point to note about these forms is the \"Information Date\" field, as well as the \"Status\" field. These fields are located in the \"Main\" category, along with the Enrollment Start Date and the Enrollment Exit Date. These forms may be required to be entered multiple times per enrollment, please read below for more information on this, as well as what to select for \"Status\" and how to manage the \"Information Date.\" All required fields must be entered, but please have in mind that for some fields \"Data not collected\" is a valid response.Is the client entering the project?Take HMIS and Income and Benefits Assessments as Status: Project Entry and set the Information date in forms to match client’s Enrollment Start Date.\nHas the client been enrolled for a year or multiple years?Take HMIS and Income and Benefits Assessments as Status: Annual within +/- 30 days of client’s enrollment anniversary once for every year they have been enrolled.For this, set Information date in forms to be within +/- 30 days from the individual's enrollment anniversary for every year they are enrolled.Example: If client was enrolled on 12/1/2020, the first annual must be taken within +/- 30 days of 12/1/2021, then their second one would be within +/- 30 days of 12/1/2022, and the information date must also match this.Have any changes occurred to the information previously collected in these forms?Take the HMIS and Income and Benefits Assessments as Status: Update, and set Information date to be any date in between client’s enrollment date and their exit date if back-dating, or any date after their enrollment date if still actively enrolled.Is the client exiting the project?Take HMIS and Income and Benefits Assessments as Status: Project Exit and set Information date in forms to match client’s Enrollment Exit Date.","title":"AHS: How to Get Started and Individual Data Entry","url":"https://apricot-articles.socialsolutions.com/en/articles/6325249-ahs-how-to-get-started-and-individual-data-entry"}