{"content":"Understanding where the participant is in their program is crucial to helping participants achieve their goals. Enrollments are the first step to help organizations better capture programmatic outcomes and help organizations understand the efficacy of their programs!With Enrollments, you’ll be able to enroll a participant in a program, exit participants from a program, attach a Tier 2 to an Enrollment, and audit actions completed on Enrollments. You do not need to have migrated to Role Based Permissions to use Enrollments.Let’s get to know the fields that make up an Enrollment!Program – Program that the Enrollment will be a part of. This list is made up of the Programs that are setup in Apricot under Sites & Programs and that have a Permission Set or Role related to it that has the \"Edit Record\" permission enabled for the Tier 1 form. This field is required when enrolling in a program.Assigned Staff – Who the enrollment is assigned to. This is a list of users in Apricot. Multiple Assigned Staff can be selected for an Enrollment. This field is optional.Start Date – Start date of the participant’s enrollment in the program. This field is required when enrolling in a program.Enrollment Notes – Add any notes that are important for the enrollment while it’s open. This field is optional.End Date – End date of the participant’s enrollment in the program. Once this is set the enrollment is considered inactive. This field is required when exiting from a program.Exit Reason – When exiting, set the Exit Reason to the appropriate Exit Reason. If none of the set reasons apply, select “Other” and enter the Exit Reason in the Enrollment’s Exit Notes. This field is required when exiting from a program.Exit Notes – Add any notes that are important for the Participant’s exit from the program. This field is optional.An Enrollment is considered active when there has been no Exit Date specified. Once an Enrollment has been exited that Enrollment is inactive. Participants can have multiple active Enrollments for different programs but cannot have multiple active enrollments for the same program.Site Administrators will be able to assign an Enrollment to any user. Standard Users will only be able to assign Enrollments to themselves or no one.To view which programs a participant is currently enrolled in, the Document folder will have a list of all active and inactive Enrollments.One participant can be enrolled in a program using the Document Folder or Record Search. Multiple Participants can be enrolled in a program using Record Search.Create an Active Enrollment:To enroll one participant in a program, go to the Enrollments tabclick on Add Program EnrollmentView any Current Enrollments.Scroll down to Enrollment Details.Select the Program the Enrollment will be for.Select any Assigned Staff.Select the Start Date of the Enrollment.Enter any applicable Enrollment Notes.Click Enroll.After going through these steps, Apricot will tell you whether the Enrollment was successful or if there was an issue Enrolling the Participant. Most commonly this will be that the Start Date overlaps with an existing Enrollment for the program selected.To enter Enrollments from the past, follow the steps 1-8 above and then do the following.9.Select the End Date of the Enrollment10. Select the applicable Exit Reason11. Enter any Exit Notes12. Click EnrollYou can also enroll someone in a deactivated program if need be by following the same steps above! Enrolling multiple Participants in a Program:Under Search Records select the Record Search you’d like to use to add an Enrollment.Under Search Actions, click Show Enrollment Actions.Select the participants you want to enroll in the program.Click Enroll in ProgramView any Current Enrollments.Scroll down to Enrollment Details.Select the Program the Enrollment will be for.Select any Assigned Staff.Select the Start Date of the Enrollment.Enter any applicable Enrollment Notes.Click Enroll.After going through these steps, Apricot will tell you whether the Enrollment was successful or if there was an issue Enrolling the Participant. Most commonly this will be that the Start Date overlaps with an existing Enrollment for the program selected.Exit multiple Enrollments from a ProgramFollow steps 1-3 above and then do the following:4. Click Exit From Program5. Select the Program to exit from.6. Select the End Date for the Enrollments7. Select the applicable Exit Reason for the Enrollments8. Enter any applicable Exit Notes for the Enrollment.9. Click ExitIf you need to enter any specific information for a particular participant, but not for all participants, select their name from the For dropdown. After modifying this will show as Modified in the dropdownTo connect important information related to an Enrollment, we’ve included the ability to attach a Tier 2 to an Enrollment.After saving a Tier 2 Record, you will see an Attached Enrollments section on the right-hand side. Click this to attach the Tier 2 to any applicable Enrollments. You can attach a Tier 2 to any current and exited enrollments.Administrators will be able to access record audit information to allow them to understand what changes have been made to Enrollment data.Go to Access ControlClick into Users or Sites & Programs,Select Record AuditsClick EnrollmentsTo view the change made to the Enrollment, click into one of the results.You can report on the data in Program Enrollments the same way you would report on anything else in Apricot. If you need more information on Reports in general, please refer to our Building Reports article. Here's some tips specific to Program Enrollments! You can click and drag any field from the Program Enrollments dropdown in the right-hand Field Choices menu. The only field unavailable to report on is \"Assigned Staff\". \nIn addition to the fields you can pull in from Program Enrollments, you can add fields from other Tier 1 forms without issue, since Enrollments are not connected to any one form. No. We have decided not to allow disabling this feature so that as we release updates and the feature becomes more and more robust, you are able to begin utilizing this feature as soon as possible - without any extra steps getting in the way.We encourage you to test drive this feature and give us your feedback in the Ideas Portal. We want this feature to be as helpful as possible, and we rely on you to help us understand how to make that happen!","title":"Program Enrollments","url":"https://apricot-articles.socialsolutions.com/en/articles/6355627-program-enrollments"}