{"content":"Please note, this article applies only to Users on Role Based Permissions. If your left Navigation menu does not look like the below screenshot when viewing User profiles, please head to this article.Administrators can manage Advanced Access for standard users through their User Details page. To navigate to the Advanced Access panel for a specific user, first you will need to open that user's profile. From there, you will scroll all the way down to the bottom of the User Details page to where the Advanced Access panel is located (under the User Preferences panel).Expanding the category will allow administrators to select which specific administrative tasks they would like to assign their standard user. The category toggle can also be used to adjust assignments. Using the category toggle will turn on/off all of the specific administrative tasks within that category at the same time. To save the adjustments that have been made to a user's Advanced Access, click on the \"Update\" button.Green Toggle: Indicates that the standard user has access to all administrative tasks within the category.Yellow Toggle: Indicates that the standard user has access to some of the administrative tasks within the category.Grey Toggle: Indicates that the standard user does not have any access to that category.Standard Forms: This allows users to access Form Designer under the Administrator tab. By default they will only be able to create a brand new Tier 1 form and it's subsequent Tier 2 forms. Please note: If a standard user creates a new form, they will need to be given \"Edit\" permission to it after the form is initially published. This is done by an administrator in their Role by checking the \"Edit\" box under the \"Forms\" column. If you would like a user to have access to edit pre-existing forms, you will need to provide them access via their Role (check the \"Edit\" box under the \"Forms\" column for the form(s) you would like them to edit). See screenshot below.Templates: This allows users to access the Templates library where they can view various form templates and use those templates to create new Tier 1 and Tier 2 forms. Please note that if you only give a user access to the Templates library without also giving them advanced access to Standard Forms, they will only be able to view the template options in the Templates library. They will not be able to use the templates to create a new form within your database.Lookup Lists: This allows users to access the Lookup Lists page where they can create new Lookup Lists or modify existing ones.Reports: This allows users to create and edit reports using the Report Builder tool. They will only be able to create new reports by default. Please note, you must either create a Category for them to place reports into (they do not have access to create a new Category) or give them \"Edit\" permission to an existing Category in their Role (see screenshot below). Granting \"Edit\" permission to an existing Category will also give them access to edit the existing reports that are already in that Category.Aggregate Reports: This allows users to create and edit Aggregate Reports. Please note, the \"Reports\" access has to be enabled in the user's Advanced Access for them to be able to access the edit side of Aggregate Reports.Data Archives: This allows users to access the Data Archives page and export any data from forms that they have at least \"View\" permissions for in their Role(s).Imports: This allows users to access the Imports page and perform imports for any forms that they have at least \"View\" permissions for in their Role(s).Archived Records: This allows users to access the Archived Records page and restore records of forms that they have \"View\", \"Search\", and \"Edit\" permissions for in their Role(s). Please note, users will only be able to access/restore archived records that are assigned to the users program(s).Record Audits: This allows users to access the Record Audits page and view past versions of records, compare prior and current versions, and restore earlier versions of records. Please note, the Record Audits page will only show records that the user currently has access to.Bulk Assignments: This allows users to be able to assign/remove programs from records in bulk via the Program Access button on the Search Page for those records. They will also have access to the Bulk Assignments page to view the history of any bulk assignments/removals that they performed. See screenshots below. For more information about assigning and removing programs in bulk, please read this article.Account Information: This is a remnant of an older feature that does not exist in Apricot anymore. Enabling this for a user will not do anything.Bulletins: This allows users to create and edit the bulletins that show up on the My Apricot landing page. Please note, you must either create a Category for them to place bulletins into and give them \"View\" permission for that new Category (they do not have access to create a new Category) or give them \"View\" permission to an existing Category in their Role(s) (see screenshot below). They must have \"View\" permissions for a whole Category to be able to create new bulletins. Granting \"View\" permission in their Role(s) to an existing Category will also give them access to edit the existing bulletins that are already in that Category. If you want them to only be able to edit existing bulletins, and not create any new ones, you will give them \"View\" permission for those specific bulletins and not the Category as a whole.Calendars: This allows users to add and configure the calendars that interact with the scheduler field. Please note: the My Calendars feature is an older scheduling feature that is no longer being supported since, due to changes on Microsoft's end, errors occur when trying to sync Microsoft email accounts. Our newer Apricot Schedule feature was created to replace this feature and is what we recommend to use going forward for scheduling purposes in Apricot. Any clients that had their Microsoft accounts successfully synced before Microsoft's changes may, in many cases, be able to continue to use the feature without issue, but we can't make any guarantee, thus this Advanced Access setting is only relevant for those clients.Shared Files: This allows users to upload and edit files in the Shared Files area of Apricot. Please note, you must either create a Category for them to place shared files into and give them \"View\" permission for that new Category (they do not have access to create a new Category) or give them \"View\" permission to an existing Category in their Role(s) (see screenshot below). They must have \"View\" permissions for a whole Category to be able to create new shared files. Granting \"View\" permission in their Role(s) to an existing Category will also give them access to edit the existing shared files that are already in that Category. If you want them to only be able to edit existing shared files, and not create any new ones, you will give them \"View\" permission for those specific shared files and not the Category as a whole. Apricot Settings: This allows users to access the settings page for your Apricot site. They will have access to adjust settings in the Security, User Licenses (only for sites that have the Guest User Module enabled; will be able to adjust Guest User Forms), General Configuration, and Accessibility sections.Secure Web Form: This allows users to create new Secure Web Forms or to edit existing ones. A user will need at least \"View\" permissions in their Role(s) for any Tier 1 forms that they are wanting to create a Secure Web Form for.Connect: This allows users toedit and manage Participant Types, Connect Settings, and Direct Messages. A User with this role will not be able to send Direct Messages that would exceed the monthly allotment. Users are able to create new Participant Types, but only for Tier 1 forms that they at least have \"View\" permission for in their Role(s). It's similar for existing Participant Types, they can manage Participant Types with Tier 1 forms that the user has at least \"View\" permission for in their Role(s). Also, for users to be able to adjust Tier 2 forms within the Participant Type, they would need \"View\" permission for those forms in their Role(s). When adjusting Connect Tier 2 form permissions, the user will only be able to adjust Tier 2 permissions for the programs that they have access to.Intake: This allows users to create new Intake Forms and edit existing Intake Forms. Users will only be able to create new Intake Forms for Tier 1 forms that they have \"View\" permission for in their Role(s). Similarly, users will only be able to edit existing Intake Forms if they have \"View\" permission to the Tier 1 form the Intake Form is configured with (if the Intake Form has a Tier 2 form attached, the user will also need \"View\" permission for that form). They will also need access to the program that is chosen in the Program Enrollment drop down on the Intake Form to be able to edit the existing Intake Form. Users will only be able to attach Tier 2 forms to an Intake Form if they have \"View\" permission for the Tier 2 form in their Role(s).","title":"Advanced Access for Standard Users","url":"https://apricot-articles.socialsolutions.com/en/articles/6461297-advanced-access-for-standard-users"}