{"content":"Bonterra works closely with HUD to ensure that we are one of the few companies that can offer our customers a fully compliant system with the simplest processes. With the latest HUD changes, Bonterra has worked alongside HUD to create an Apricot Homeless Services (AHS) template of forms and reports that can be implemented into your existing database. If you're looking for more information regarding this, please check out this video!Here is also a table of contents for this article, with links that will take you to each respective section! Do You Need to Upgrade your AVS System?FAQ for Existing AVS UsersMigration OptionsNew HUD HMIS Forms and Reports HMIS Quality Assurance PackageIf you answer yes to any or all of these questions you will need to upgrade to the new HMIS Template. Does your Organization need to be HUD/CoC Complaint? Has your Organization been HUD/CoC compliant in the past? Have you received HUD funding in the past? Are you using Apricot as an HMIS comparable database? Do you receive money from a CoC or ESG Grant? Do you need APR, CAPER or Coordinated Entry APR reports? Do you submit data to HUD, a CoC, SAGE or HDX? To continue to be HUD compliant, the AHS HMIS  template of forms and reports can be implemented into your current Apricot System. To use the new template, data from the existing system will need to be migrated. Check out our Data Migration page here to learn more about this process. Will we still have all of our current forms?Yes, but we strongly recommend disabling user access to the HMIS fields/forms once you’re ready to use the new template. That will avoid users entering the data in the wrong place. Will we still have all of our current reports?The old APR and CAPER will continue to be active until sometime next year, but will not receive new updates if HUD pushes them out. We do plan on removing those two reports to avoid any confusion with the new reports. Will we still have all of our email triggers?The email triggers will not carry over to the new HMIS template. Since this is a template we maintain based on the HUD’s data standards, administrators will not have access to edit the forms to setup email triggers. Instead, you will be able to use Apricot’s Rules & Alerts to create those notifications. Will there be a noticeable transfer in systems? If so, will there be any time that our system will be down for the transfer?Our old process was to provision a new database that included the template. This would have required a costly full migration to a new database, a new implementation and weeks/months of potential downtime. Our mission was to avoid those pain points for our clients as much as possible. That’s what we’ve been working on and why we created a tool to install the HMIS template forms/reports directly in your existing database. There will not be downtime on our end when we launch the template to your Apricot database. Since we are putting the forms on your existing database, the HMIS data from your AVS forms will need to be migrated into the new template. There will also be configuration that needs to take place before the forms are used. This configuration is important to determine the proper conditional rules for each HMIS funded program. After those changes are completed, the forms will be ready to use. Will this roll out help with HUD Standards for Success Reporting or any additional HUD related system? HUD’s HMIS program is the only HUD project that we have an out of the box solution for that we maintain. This AHS solution will be continually updated to maintain compliance. This includes Emergency Shelters (ES), Rapid Re-Housing (RRH), Permanent Supportive housing (PSH), Housing for Veterans (VASH), Runaway Homeless Youth (RHY), Housing for People with AIDS (HOPWA). You have options on how to migrate your HMIS data. This is a timely and extensive process to get your existing data into the new HUD mandated forms and reporting requirements. We suggest you set up a meeting with your account manager to talk through the below options. HUD Changes Only Migration: 10k One Time CostYou can only migrate the mandated HUD changed forms and reports which will be a onetime 10k cost for Bonterra to complete this work for you. This will mean that you will keep two client intake forms. One that is HUD approved and another that is either your existing one or a modified one. You will be required to enter each new client into both the HMIS template and your existing Tier 1 Intake that will live outside of the HMIS template of forms and reports.  Any custom reports that you have built pulling data from the HUD mandated forms will be out of scope for the 10k cost. You can relink yourself or you can have us do this for you at an additional cost.  Full Custom Migration: All Tier 1 and Tier 2 related forms Migration This option starts at 10k and goes up depending on the number of customer reports and forms. This means that all data will be moved over under the HMIS template. This will eliminate the need for any double data entry. However, this cost must be custom scoped. You will need to provide how many reports you want rebuilt and you must choose which forms you want rebuilt. Each report will be roughly $400 and each form will be roughly $200 to move over.  Self Implementation: Client-led data Migration This self-service option is available with the help of our Self-Implementation    Guide: https://intercom.help/apricot-articles/en/articles/6449335-legacy-avs-template-to-ahs-template-migration-processThis latest update is a major change from what HUD previously required. HUD has mandated that only vendors are allowed to run reports and changes cannot be made to forms. The Quality Assurance Package will cover the running of the reports.  There are new forms and reports that are each in a new format from what HUD required previously. When you purchase the new Quality Assurance Package, you will receive the updated forms and reports in your existing Apricot Database.  Below is a full list of the new AHS forms that will be included in the NEW HMIS Template: Individuals Households Organization Project Continuum of Care Category HUD Enrollment Household Program Enrollments Services Provided HMIS Assessment Income and Benefits Assessment Bed-Night Date Ongoing Street Contact for Emergency Shelters, Street Outreach, and Services Projects RHY Form SSVF - Veteran Income Assessment Coordinated Entry Assessment Coordinated Entry Event Bed and Unit Inventory Information Grant Option  Below is a list of all the new AHS Reports that will be included in the HMIS Template of Reports: Annual Performance Report Client Level Report Consolidated Annual Performance and Evaluation Report Data Quality Report Housing Inventory Count Report Longitudinal System Analysis Report PATH Annual Report Point-in-Time Report System Performance Measures Report https://apricot-articles.socialsolutions.com/en/articles/6088621-apricot-packages-and-add-ons-managed-services-apricot-for-homelessness-services-quality-assurance-program ","title":"HUD Compliance Updates","url":"https://apricot-articles.socialsolutions.com/en/articles/6702788-hud-compliance-updates"}