{"content":"The Relationship to Head of Household is set through the Program Enrollments records, which can be found in an Individual's Document Folder.Having more than one Individual marked as \"Self (head of household)\" for any given household's enrollment will cause issues. This can be verified manually by:Checking the Program Enrollments records for the members of the household.Checking the Enrollment.csv file.Each individual household member that shares the enrollment in the program can have their individual \"Program Enrollments\" record checked to ensure that only one Individual is marked as \"Self (head of household)\".This process can be time consuming as it involves going through each household member's Program Enrollments record to ensure that only one is set as the Head of Household.You can perform an HMIS CSV Export for any given Project that you wish to check a household for. Once the report has completed, you can click on \"Export\" at the top left to export the CSV files into a zip file. After downloading the zip file, you will open the Enrollment.csv to view the individuals' relationship to Head of Household. To make things easier, press CTRL + F within the csv file and search for an individual by their Individual record ID (this can be found inside their Individual record in the System Fields section at the bottom of the record). Within the the csv file, Personal ID is the same as the Individual's record ID. Once the individual has been identified, right click on their Household ID, and select Filter > Filter by Selected Cell's Value.This will allow us to see all individuals that are in the household for any given household enrollment.  Individuals that are \"Self (head of household)\" will show a value of \"1\" under the \"RelationshiptoHoH\" column. From here, we can go ahead and verify that only one individual is marked as \"1\" under the \"RelationshiptoHoH\" column. If there is more than one individual with a \"1\" under the \"RelationshiptoHoH\" column, then there are two people who are marked as Head of Household. This will need to be fixed by going into the non-Head of Household individual's Program Enrollments record and selecting the correct option for their relation to the Head of Household.","title":"AHS: Checking Relationship to Head of Household","url":"https://apricot-articles.socialsolutions.com/en/articles/6706123-ahs-checking-relationship-to-head-of-household"}