{"content":"APR - Annual Performance ReportCAPER - Consolidated Annual Performance and Evaluation Report CoC - Continuum of CareESG - Emergency Solutions GrantChronically Homeless Individual - a person who is homeless, is disabled, and has been homeless for at least one year or has had at least four separate occasions of homelessness within the last three years where the occasions add up to 12 months or more. Leavers - a person who exits the program and is not active on the last day of the operating yearStayers -  a person who is still enrolled in the program on the last day of the operating yearAdult - a person age 18 or older Child - a person under the age of 18Youth - a person between the ages of 12 and 24 who is NOT in a household with anyone older than 24Household without children - a household composed of only adults Household with children and adults - a household composed of at least one adult and one child (a person under 18) Household with only children - a household composed of only children (persons under 18)Unknown household type - a household that cannot be classified in cases when one or more persons are missing dates of birth. However, when the households already have at least one known adult and one known child, the household type will be categorized as a Household with Children and Adults.PH - Permanent HousingRRH - Rapid Re-HousingHP - Homelessness PreventionThe APR and CAPER reports are due annually to the US Department of Housing and Urban Development within 90 days of the end of a grant recipient's operating year. They are used to report on the performance of projects funded by the CoC and ESG programs. Project: This information is found in the Project (Tier 1) taken for the specific project. Persons Served: Q7a and Q8a totals must match Q5 (report validation) totals. Demographics (Gender, Age, Ethnicity and Race) of clients served: Unknown Household type and unknown demographics both contribute to the “unknown” category – meaning if only one of those is missing the information about the other can’t be shared either. Data quality in basic demographics is of utmost importance.Totals must match Q5Physical and Mental Health conditions & Domestic Violence information of clients served:Only definitive “Yes” in HMIS Assessment for fields 4.05-4.10 counts in count of persons with conditions. If “Disabling Condition” is “Yes” but fields 4.05-4.10 are “No” or Unknown, they will not appear in the count of persons with conditions, but they will appear in the count of conditions under “Condition Unknown”.Living Situation of client at project start:Response options correspond directly to fields for 3.917 Living Situation.Totals must match Q5.Cash Income (Required for APR) - Non-Cash Income and Health InsuranceA “stayer” who hasn’t yet been in the program for a full year will be counted as “Data Not Collected” in Q20b (APR only) – this is okay.Lengths of participation, averages, medians, time between start and move-in for all clients served:APR - Q22a1, Q22b, Q22c.CAPER - Q22a2, Q22c, Q22d.Questions use the latest project stay only.Includes all days a participant has been enrolled in the latest project, even those days prior to reporting period.Q22c includes both PH and RRH Projects.Exit information (Q23): destination at exit for all project types, reported out by length of time in project, and assessments at exit for homelessness prevention ESG clients (Q24): APR -  Q23a & Q23b.CAPER - Q23a & Q23b (RRH only) Q23c (All but RRH), Q24 (HP only).Veteran, Chronic Homeless, and Youth sub population reporting.CAPER requires Q25a & Q26b only.Veteran status is defined by “Yes” to field 3.07 and 18 or older at project start or report start.Youth is defined as any person greater than or equal to age 12 and less than or equal to age 24 where all HH members are less than or equal to age 24. Veteran, Chronic Homeless, and Youth sub population reporting:CAPER requires Q25a & Q26b only.Veteran status is defined by “Yes” to field 3.07 and 18 or older at project start or report start. Youth is defined as any person greater than or equal to age 12 and less than or equal to age 24 where all Household members are less than or equal to age 24.Missing/Unknown in fields 3.917 means clients can’t be counted as “Chronically Homeless”.Missing/Unknown in Date of Birth means clients can’t be counted as “Youth”.Missing/Unknown in Veteran Status means clients can’t be counted as “Veterans”.Link the to continuously updated CoC/ESG Programming Specifications: https://files.hudexchange.info/resources/documents/HMIS-Programming-Specifications.pdf","title":"AHS: APR & CAPER Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/6729015-ahs-apr-caper-reports"}