{"content":"HIC - Housing Inventory Count\nPIT - Point in Time\nCoC - Continuum of Care\nESG - Emergency Solutions Grant\nChronically Homeless Individual - a person who is homeless, is disabled, and has been homeless for at least one year or has had at least four separate occasions of homelessness within the last three years where the occasions add up to 12 months or more.\nLeavers - a person who exits the program and is not active on the last day of the operating year\nStayers -  a person who is still enrolled in the program on the last day of the operating year\nAdult - a person age 18 or older\nChild - a person under the age of 18\nYouth - a person between the ages of 12 and 24 who is NOT in a household with anyone older than 24\nHousehold without children - a household composed of only adults\nHousehold with children and adults - a household composed of at least one adult and one child (a person under 18)\nHousehold with only children - a household composed of only children (persons under 18)\nUnknown household type - a household that cannot be classified in cases when one or more persons are missing dates of birth. However, when the households already have at least one known adult and one known child, the household type will be categorized as a Household with Children and Adults.\nPH - Permanent Housing\nRRH - Rapid Re-Housing\nHP - Homelessness PreventionThe HIC is a point-in time inventory of projects within CoC projects that provide beds and units dedicated to serving persons who are homeless. It is intended to provide HUD and CoCs with information about the shelter and housing capacity of homeless crisis response systems. It should reflect the number of beds and units available on the night designated for the count that are dedicated to serve persons who are homeless per the HUD homeless definition. For permanent housing projects, it will reflect persons who were homeless at entry and awaiting placement on the night of the count.The HIC Report is required for the following project types: Emergency Shelter (ES)Transitional Housing (TH)Safe Haven (SH)Permanent Housing (PH)Permanent Supportive Housing (PSH)Rapid Re-housing (RRH)Other PH (OPH) – combines two project types from the 2020 HMIS Data Standards:  PH – Housing with Services (no disability required for entry); and  PH – Housing OnlyProject: This information is found in the Project (Tier 1) taken for the specific project.\nBed and Unit Inventory Information: This information is found in the Bed and Unit Inventory Information (linked within the Project record) taken for the specific project.\nPoint-in-Time Counts for Each Project:Each project recorded in the HIC must provide a PIT count. The PIT count shows the number of persons served on the night of the count in the beds reported for the project. This includes persons who entered the project on or before the date of the HIC and PIT count, whether they are still in the project or have exited. The HIC and PIT count are integrally related. The sum total number of persons reported in emergency shelter, Safe Havens, and transitional housing projects in the PIT fields of the HICmust match the sum total of sheltered persons reported in the PIT count.The Point in Time count is defined as a “count of sheltered and unsheltered homeless persons carried out on one night in the last 10 calendar days of January or at such other time as required by HUD.” CoCs are required to conduct a PIT count at least biennially during the last 10 days of January.Here is a document detailing specifics on who should/should not be counted.","title":"AHS: HIC & PIT Reports","url":"https://apricot-articles.socialsolutions.com/en/articles/6732648-ahs-hic-pit-reports"}