{"content":"Clearing your cache and cookies can assist in resolving issues and improving your browsing experience throughout Apricot.Google ChromeTo clear your Cache and Cookies in Google Chrome, follow these steps:Open Google Chrome on your computer.Click on the three dots in the top-right corner of the window to open the menu.From the menu, select \"More tools\" and then click on \"Clear browsing data.\"A new window will open. From the \"Time range\" dropdown menu, you can choose how far back you want to clear your cache and cookies. Select \"All time\" to clear everything.In the \"Clear data\" section, make sure that the \"Cookies and other site data\" and \"Cached images and files\" options are checked. You can also choose to uncheck any other options that you don't want to clear.Click on the \"Clear data\" button to clear your cache and cookies.Please keep in mind that clearing your cache and cookies will log you out of Apricot, and you will have to re-enter your login credentials to access them again.It's a good idea to clear your cache and cookies regularly to help improve your experience in Apricot.Note: You can set Chrome to automatically clear your cache and cookies when you close the browser by going to the \"Advanced\" tab in the \"Clear browsing data\" window and checking the \"Cookies and other site data\" and \"Cached images and files\" options under \"Clear on exit.\"Mozilla FirefoxTo clear your Cache and Cookies in Mozilla Firefox, follow these steps:Open your Mozilla Firefox browser and click on the three horizontal lines in the top-right corner of the window.From the menu that appears, click on the \"Settings\" button.In the left-hand menu, click on the \"Privacy & Security\" tab.Scroll down to the \"Cookies and Site Data\" section and click on the \"Clear Data\" button.A new window will open, displaying a list of all the \"cookies and site data\" and \"Cached Web Content\" stored in your browser. To delete all of them, click on the \"Clear\" button.A confirmation window will appear, asking if you want to clear your cookies and site data. Click on the \"Clear Now\" button to confirm.Once the cache and cookies have been cleared, you can close the \"Options\" window and continue browsing as normal.Reminder:Please keep in mind that clearing your cache and cookies will log you out of Apricot, and you will have to re-enter your login credentials to access them again.It's a good idea to clear your cache and cookies regularly to help improve your experience in Apricot.You can set Chrome to automatically clear your cache and cookies when you close the browser by going to the \"Advanced\" tab in the \"Clear browsing data\" window and checking the \"Cookies and other site data\" and \"Cached images and files\" options under \"Clear on exit.\"You can set Firefox to automatically clear your cache and cookies when you close the browser by checking the \"Delete cookies and site data when Firefox is closed\" box in the Cookies and Site Data section.","title":"Clearing Cache and Cookies","url":"https://apricot-articles.socialsolutions.com/en/articles/6846174-clearing-cache-and-cookies"}