{"content":"When working in Apricot, each time a record is created it is automatically assigned a unique ID. There are many scenarios where it can become important to understand where to locate the Record ID. For example, an Administrator may request this information from data entry staff when troubleshooting issues locating that record within a Report or Bulletin.By default, any form created in Apricot will contain a System Fields section which contains a few different pieces of information that the system automatically generates, including Record ID.With that in mind, the first thing you can try is simply scrolling to the section labeled \"System Fields\" to find the Record IDIt is possible when designing a form to move any of the System Fields to different sections, and to rename the System Fields section. For that reason, the method outlined above won't always work.If you cannot locate a section named \"System Fields\", try using your browser's \"Find\" function to locate the Record ID field.Click \"Expand All\" in the upper right hand corner of the Apricot WindowWhile holding the Ctrl key (or the Command key on a Mac) press the F key. This will bring up a search box in the top right corner of the screen.Type \"record id\" into the searchFinally, there will be some instances where the Record ID field is totally hidden. Don't worry though, there is still a solution to locating the Record ID!In the below screenshot, notice that we have used \"Expand All\" and have used our browser's \"Find\" function, and we see that there are 0 results for the term \"record id\":We can be sure now that we won't be able to find the Record ID Field within this record, so we must use an alternative method to locate the Record ID. Thankfully, when viewing any record within Apricot, the URL or Address Bar of the page will always include the Record ID.Notice that your URL when viewing a record always looks something like this:In the above example, the Record ID can be found at the very end of the URL, in this case it is \"1313\". Now that you're acquainted with locating the ID using your URL or Address Bar, an easy mistake to make would be to share the ID of the document folder instead of the exact record you care about, particularly when what you need is the Record ID for a tier 2 record. While the document folder's ID will ALWAYS match the record of the tier 1 for that document folder, every tier 2 record will have it's own Record ID as well.Please be mindful of the URL and notice that when viewing a document folder, instead of \"document/edit/id/\" it reads \"profile/index/id\" If a Record ID is needed for a tier 2 record, this is NOT the correct ID to share. When working with tier 2 records, please navigate directly to the record first to locate it's ID.","title":"How to Locate a Record ID in Apricot","url":"https://apricot-articles.socialsolutions.com/en/articles/7017143-how-to-locate-a-record-id-in-apricot"}