{"content":"Rules & Alerts is an intelligent notification system that enables social good organizations to advance the way care is delivered. Users can configure business logic to generate notifications when key events occur so that caseworkers can focus on the most critical tasks and use data to fight participant disengagement. The next evolution of the Rules & Alerts feature is Time-Based Alerts. Time-Based Alerts adds the ability to trigger automatic notifications related to dates. Apricot 360 users will now be able to receive alerts about birthdays, compliance periods, days passed a check-in, and more! This top requested enhancement enables automation to free up even more time and clarity in a caseworker’s day. Apricot 360 now supports three common time-based alerts: 'Upcoming', 'Day Of', and 'Time-Passed'. Example use cases include: Complete follow-up assessment six months after enrollment Remind me to check in on participant 3 days after service delivery Release of Information expires in 2 weeks Participants birthday is today Time-based alerts can also be combined with field-level conditions, including multi-form field level conditions. This ensures targeted alert delivery and reducing the potential noisiness of alerts. Example use cases include: Remind me to follow up on referral in 1 week if referral status is “pending” Check in with participant every 3 months when they are still enrolled Reach out 1 week before school field trip when parent signature is missing and student has expressed interest Available to clients the morning of March 9, 2023 Time-based alerts are 360 only All alerts are recurring, meaning the alert will continue to fire every time the time and/or field conditions are met E.g. Every year on birthday, every 6mo if still enrolled This is why using field and multi-form field conditions are important No functionality exists yet to fire when condition is initially met, then not againHistorical notifications will not be created upon rule publish Notifications that would have been generated before today will not be created.E.g. If you set a rule for 30 days passed record create: Record created more than 30 days ago (31+ days) will never see an alert On rule publish day, alerts will show for records created exactly 30 days agoThe day after rule publish, alerts will show for records created 29 days ago Time-based alerts are responsive E.g. If you have a rule on birthday and the Date of Birth field is changed, the pending alert waiting in the background will adjust to the new Date of Birth valueTime comparison values do not include hours or weeks Time comparison values (# of days, months) is limited to three digits We recommend 10 conditions max on a rule, including multi-form (“secondary form” in the UI) field conditions Form rules only check the last created record of the secondary form Not first created Not last modified Not multiple records Not created during x time period Form rules can only check against an existing record, “empty” logic will only fire on true empty fields, not records that have yet to be created Multiform conditions (“secondary form” in the UI) are 360 only Multiform conditions are limited to the primary form’s Doc Folder Masked options are not supported, Rules and Alerts reads front end values only Alerts only fire if triggers are met via data import if 249 or fewer records are adjustedFrom the Notification Rules list page, either select an existing rule or create new rule.After selecting the primary form, open the dropdown to select the type of event upon which you want to build logic.There, the first three options represent record-action based logic: 'On Record Create', 'Update' or both. The next three options are the new time-based event options: 'Day of', 'Upcoming' and 'Time Passed'. NOTE: Time-based are still based in record data (either system date fields or date fields on the record), but are not tied to a user taking action (view, edit, creating) on that record. Day Of: Warn me about something today Ex. Today is Tyler’s birthday If <select date field> = today’s month and day Upcoming: Warn me that something is going to happen in the future Ex. Remind Jerrica she has an appointment scheduled for tomorrow If <select date field > occurs in <numeric> <unit of time> Time Passed: Tell me something is past due, or remind me it’s been a certain amount of time has passed It’s been 3 months since the last assessment was completed If it’s been <numeric> <unit of time> since <system date field> OR <date field> It is best practice to use field conditions so that alerts are specific and accurate. For example, alerts should not go to staff if a participant is not longer enrolled or not longer meets the program’s criteria (ex. Are over 18, not in good standing) Field-level and multi-form (secondary) conditions function as they did before.  In the example below, Professor Flitwick only needs to worry about orientation for Hufflepuff students, not all students.Time-based alerts when delivered look very similar to record action-based alerts.  Depending on the delivery channel, users will see alerts in product:Or delivered to their inbox:","title":"Rules & Alerts | Time-Based Alerts","url":"https://apricot-articles.socialsolutions.com/en/articles/7020407-rules-alerts-time-based-alerts"}