{"content":"In March of last year, we shared the exciting news that Social Solutions is becoming Bonterra and Apricot is becoming Bonterra Case Management.  Bonterra is the leading social good software company that brings together innovative technology, unmatched expertise, and strategic partnerships from CyberGrants, EveryAction, Network for Good, Social Solutions, and their respective entities, with a purpose to power those who power social impact. Bonterra Case Management (previously Apricot) will have the same user experience, web addresses, and notification channels you use every day. Your support, training, and service teams will not change. Hopefully you’ve become familiar with Bonterra through our various communications, webinars, events, thought leadership pieces, emails, social media channels, and more. In the coming weeks, you’ll hear more from us about who Bonterra is and how the products that you currently use will enable you and your organization to do even more good. We will share with you what to expect as we launch exciting updates that will allow you to be more efficient, more effective, and drive more impact.While there are exciting changes coming, one thing that will not change is your relationship with us. You will continue working with the same support, training, and service teams. Your data will be stored, managed, and serviced in the same secure way. We will continue offering our services and honoring the commitments under your current contract without change, and there is no action you need to take.We are proud to partner with you to create positive change in the world, and we are committed to continuously improving our products and services to help you do more good. We will keep you informed at every stage as we begin to launch some exciting enhancements. Thank you for choosing Bonterra, and we look forward to continuing this journey with you to advance your missions and drive more impact. We'll keep you updated along the way.To find out more about Bonterra and see our latest news, please visit us at bonterratech.com.Keep this link saved as we will update this article with all our Becoming Bonterra announcements. ","title":"Social Solutions is becoming Bonterra","url":"https://apricot-articles.socialsolutions.com/en/articles/7908663-social-solutions-is-becoming-bonterra"}