{"content":"On June 15, 2023, a new field type called Smart List will be available to Apricot clients on Core and 360 to use in the Form Designer! Smart Fields uses data saved in your forms to help you streamline data entry and simplify administration! ​With Smart Lists, you’ll be able to add a dropdown to your form where the options in the list available while completing forms are created using data saved in your forms. ​ ​To determine which items are displayed when completing a Smart List, Administrators can set up a Smart Field Preset. After the Smart Field Preset is set up, your Administrators don’t need to return to the setup to maintain the list options – Apricot will display the most current results to your staff while completing a Form with a Smart List on it! Lessening the burden of maintaining list options for data your users are already entering in Apricot.​ To add a Smart List to your Form, simply go to the Form Designer go to the “Smart Fields” section of the pallet and drag in “Smart List” to your Form Section.  Once you’ve dragged it into your form, it’s time to configure your field properties -- including selecting or configuring your Smart Field Preset! If you have an existing Smart Field Preset you want to use for your Smart List, select it from the Smart Field Presets dropdown, click “Apply” and you’re ready to go! Don’t have a Smart Field Preset created yet? Not to worry, you can configure one while you’re in the Form Designer!  Click the Create a new Smart Field Preset link. When you click Create a new Smart Field Preset a separate browser tab will open with the Smart Field Preset Builder. See below for details on configuring a Smart Field Preset. Once you’ve completed the setup in the Smart Field Preset Builder, come back to the browser tab with the Form Designer and click Refresh the preset list. Then click into the Smart Field Presets dropdown to select your Preset (we’ll display the most recent Smart Field Presets at the top of the list for quick access) Once you’ve selected the Smart Field Preset you created, click Apply, publish your form, and you’re ready to go! Note: Once a Smart Field Preset has been used in the setup of a Smart Field, you will no longer be able to delete it. Smart Field Presets allow you to set up what records you want to display for your staff to complete and which field you want to use as the answer to the field. A Smart Field Preset can be used in multiple Smart List configurations. However, once a Preset has been used in the configuration of a Smart List it cannot be deleted. To set up a Smart Field Preset login as an Administrator. You then have two options to access the Smart Field Preset Builder. The first is while adding a Smart List to a Form (as described above) and the second is from the left navigation under Form Designer.\n\n\nFrom this page you can create a new preset, search existing presets, edit, or delete a preset.  Edit:  Delete: \nName – enter the name of the preset. The Preset's name must be unique. We recommend naming your presets something that will easily identify what the list options would be (e.g. Available Volunteers, Hospitals in Toronto). Choose the source form... – can be T1 or T2 (within and outside of the Doc folder) Choose the primary field to display... -- Select a field from the form chosen above. The record information collected via that field will display in the smart field. Note: if you change this field after saving and using in a Smart List configuration, and a Form has the Smart List completed, the data will not be retained. The following fields cannot be used as the Primary Field in a Smart Field Preset Signatures Attach Doc Image AutopopulateDynamic Fields You can choose up to 4 filters (combined by AND) to narrow down which options will display in your list. The fields that are displayed for filtering are the fields from the  Source Form selected for the Smart Field Preset. Please note Autopopulate fields cannot be used as a filter. Always check the Preview after you’ve made any changes and before saving or updating a preset. Previewing will allow you to check that your filter is returning the right list options as well as check that the performance of the Preset you’ve configured is good to go. After clicking Preview, Apricot will show you the first 10 results to give help you understand if your filters are returning the correct data. If the preview tells you your Smart Field Preset is slow, please contact our Support Team.Speed is measured in terms of execution time and depends on many different factors such as complexity, size of the database, and number of filters used. We recommend previewing your Preset results during peak usage times (like the middle of the work day) to get an accurate representation of the performance of your Preset on a regular day. Previewing during non-working hours may give an inaccurate speed measurement as there are fewer users logged in.  A slow-running Preset means that your users may experience poor performance while performing data entry or reporting. If the Preview results say \"Slow\" please revisit the filters you're using for this Preset. In general, adding filters will reduce the number of results and increase performance.  Link and Program filters are complex and will negatively impact performance. \nContact support if you are experiencing extremely slow speeds. Fast: less than 1 second \nAverage: less than 5 seconds \nSlow: greater than 5 seconds Once you’ve previewed your preset and everything looks right, click Save Preset\nNow your Smart Field Preset is available to use in Field Properties of a Smart List as described above. Once your Form is published, the options displayed in the dropdown on the form will update automatically when you add or edit a Smart List!  Options in the Smart List will only display if you have access to that record. If your Smart Field Preset returns more than 1000 records, Apricot will only display 1000 records in the dropdown. Smart Fields can be reported on in Apricot’s Native Reporting. It is not currently available to be used in Results Reporting. At this time Smart Lists cannot be: set as a Form’s “Record Name” used with System FieldsThe \"Assigned Programs\" field can be used exclusively as a filterused with Autopopulate fields used in Form Logic used in Email Triggers used in Duplicate Check made searchable. made Quickview used in Imports used in Registration Grids completed in Connect Smart Field Presets cannot be filtered to just display records in the current Document Folder. \n","title":"Smart Fields | Smart List","url":"https://apricot-articles.socialsolutions.com/en/articles/7938862-smart-fields-smart-list"}