{"content":"Our intention is to make Rules & Alerts intuitive and easy to use. Users expressed the functionality that would help the most is ensuring the alert goes to the responsible staff within one rule configuration.  \nThat’s exactly what we did! Now admins can have alerts delivered to specific users without having to name that individual user in the Audience. In addition to design improvements, Admins will see a new option under Audience selection: Record Field. Record Field will show delivery options based on data held in records, System Fields and the User List Field.  Selecting Record Field will show three options for alert delivery:  Assigned Staff – If a User List field is present on the primary form, the alert will go to the user(s) saved on the field Note: If there are multiple User Lists fields on the form, Admins can select which User List field should be applied. Admins can also create an action for every User List field.  Created By – The alert will only go to the user that originally created the record Last Modified By – The alert will only go to the user that last edited the recordAttendance Tracker | Performance  We released performance improvements to alleviate longer load times for Classes & Terms.   Search | System Field Criteria  We fixed an issue that was preventing DD/MM/YYYY system date fields from returning search results.    Program Enrollment | Bulk Enroll  Select all no longer ignores search criteria when enrolling multiple participants at once.     Imports | Reconciliation Errors  We fixed an issue that was causing some large, complex imports to stall on reconciliation steps.   Imports | Program AssignmentWe fixed an issue where Programs we incorrectly assigned to records. Forms | Address LookupWe fixed an issue where Address Lookup would not show on Location Map graph type as well as the Address Lookup in records not showing the pin of the location. Forms | Auto PopulateWhen Auto Populate dropdown fields are locked via Field Properties, values will now be saved when using batch record creation. Rules & Alerts | Notification MessageWhen updating the Notification Message in the Action step of an existing Rule & Alert the Alert will no longer be prevented from sending. ","title":"Release Notes | Week of May 29 | Apricot 7.144.1 ","url":"https://apricot-articles.socialsolutions.com/en/articles/7974771-release-notes-week-of-may-29-apricot-7-144-1"}