{"content":"Results Reporting | Folder organization in Results ReportingThese changes take effect this week on Thursday, August 17th.As part of some behind the scenes security updates we've made to protect reports, we wanted to give you a heads up on a small change in your folder structure. Administrators will notice a new folder in the reporting directory called \"apricot_xxxx_administrators\" where xxxx is your organization’s identifier. There should be no other changes to your folders, reports, or their functionality. Program Enrollments | Ability to Delete a Program EnrollmentWhen you’re capturing Program Enrollment details, sometimes you might accidentally Enroll a Participant in the wrong Program. To help you keep the data you track about Participants accurate, we’ve added the ability to delete a Program Enrollment from the Document Folder. When you delete an Enrollment, any Tier 2 Forms associated with it will not be deleted. After the Enrollment has been deleted, it cannot be restored. You can delete a Program Enrollment from the Enrollments tab by clicking the 3 dots next to the “Exit Enrollment” button on the Document Folder.  Before you delete a Program Enrollment you will be asked to confirm the deletion. Clicking “Continue” will delete the Program Enrollment. Smart Fields | Smart List and Wizard LinksWe fixed an issue where the Smart List would not appear when completing a form through a Wizard Link. Referrals | Records DisplayWe fixed an issue where Referrals were displaying incorrectly. Imports | Autopopulate FieldsWe fixed an issue where apostrophes were preventing imports into Autopopulate fields. Forms | User List FieldWe fixed an issue where the User List field was always required when completing a Form even when set to be optional in Form Design. Reports | Running ReportsWe fixed an error that would occur when running a report and there were many Programs setup in Apricot. Rules & Alerts | CA PerformanceWe released a series of optimizations to Rules & Alerts that alleviated latency certain Canadian organizations experienced, ","title":"Release Notes | Week of August 7 | Apricot 7.148.1","url":"https://apricot-articles.socialsolutions.com/en/articles/8255988-release-notes-week-of-august-7-apricot-7-148-1"}