{"content":"The Inventory feature gives organizations a place to see what physical resources they have, what is available, and who is currently using what items. The feature is very customizable and can be used for a variety of resources such as beds, IT equipment, marketing materials, etc.A soft launch begins August 11, 2023 for Apricot 360 organizations. Early access to this feature can be requested via CSM or AM and turned on by Support.Please be aware currently there is no reporting available for this feature, but know we are aiming to provide an Interactive Dashboard feature within Q3 to help support analysis surrounding organizations resource usage.Feature ConfigurationConfiguring Categories and ItemsAdding a New CategoryEditing/Deleting a CategoryAdding a New ItemEditing/Deleting an itemDistributing ItemsReturning ItemsTo ensure organizations can track who is using their resources, the system needs to know what Tier 1 form you would like to distribute resources to. This can be configured by following clicking the pencil icon.At minimum the system needs to know which Tier 1 form Inventory should connect to and which field contains the Participants Name, Date of Birth, and Phone Number. Additional fields can be mapped for future iterations of Inventory feature to reference, but they are not required.Note: This configuration is only accessible to Admin users.The Inventory feature is made up of Categories and Items that can be customized to create a hierarchy of organization’s resources. Categories can be nested in order to keep resources organized in a way that helps end users quickly find the resource a participant is in need of. An Item will be the level of the resource hierarchy that is able to be distributed to a participant.Note: The creation of Categories and Items is only accessible to Admin users.A unique Category Name will be required. You will have the option to nest the Category under an already created Parent Category. There is also a Category Notes text box to collect details about that category that could help end users make sure this subset of resources is the right place to look for Items that will meet a participant’s needs.Once created, Categories can be edited or deleted by expanding the menu to the right of the category.A Category can only be deleted if there are no active distributions of an Item within the Category. Therefore, all Items must be returned within a Category prior to being able to delete it.A unique Item name will be required, along with which Parent Category the Item should be nested under.The Inventory feature will also need to know if this Item is Returnable or Non-Returnable. Returnable Items will be expected to return to the possession of an organization and be able to be used by more than one Participant over the course of time. For example, beds, showers, and laptops could all be Items that are used by a Participant for a limited amount of time and then distributed out to a different Participant at a later point in time. Non-Returnable Items are those that once they are distributed they will not be returning to the organization for an additional use. For example, food, clothing, and hygiene products could all be Items that are given to a Participant and not expected to be returned to the organization.When designating an Item as Returnable, the system will require a Participant to be designated upon distribution so the organization knows who is using that Item. When designating an Item as Non-Returnable, the system will NOT require a Participant to be designated upon distribution (see more details in the Distribution section).An Item can be edited or deleted two different ways. Directed from the Item Table, the far right menu can be expanded or an Item’s Details can be viewed by clicking the eyeball icon and then edited or deleted from there. If more of an Item is attained by an organization that Total Quantity of that Item can be increased. An Item's Total Quantity can also decrease if an organization no longer has that many of the Item in their possession. Changing the Total Quantity will not impact distributed resources and therefore will only impact the Available number of Items.  An organization's resources can be navigated to using the Resource Hierarchy on the left side of the screen. Items will then be seen as Available or Unavailable. An Available Item means there is enough of that Item to be distributed to a Participant. An Unavailable Item means this cannot be distributed to a Participant until one is returned or the Total Quantity of that Item is increased.Available Items can be distributed via the Items Table or via the Item Detail view by using the box icon. Returnable Items will require a Recipient to be designated. The Date of Distribution will default to Today’s date, but can be edited to reflect distributions that happened on a different day. A Date to Return can be captured if the organization knows when to expect that Item to be back in their possession. A Notes text box is also available to capture addition details regarding the distribution.Non-Returnable Items will not require a Recipient, but can be captured if the organization would like to have that detailed information.Note: At this point in time this information is not reportable but we are working on surfacing that information for Inventory analysis.All Returnable Items that are current distributed can be seen via the Returns tab. The Returns Table can be sorted by any of the columns headers as well as Searched to find a particular Item or Recipient Name.Items can be returned to the organization one by one. This can be done via the Returns Table or when accessing the Items Detail view.Multiple Items can also be selected to Return in bulk by using the check box within the table or a whole page of Items can be selected using the check box within the header column.Once an Item has been returned, the Available Quantity of that Item will automatically increase by the number that were returned.","title":"Inventory Release Notes","url":"https://apricot-articles.socialsolutions.com/en/articles/8263999-inventory-release-notes"}