{"content":"For more information on this Webinar: https://www.hudexchange.info/news/vawa-2022-foundations-for-coc-esg-webinar-series/?utm_source=HUD+Exchange+Mailing+List&utm_campaign=3a79a48db0-%22VAWA_2022%22_CoC_and_ESG_Comm_Convo_2023%2F8%2F28&utm_medium=email&utm_term=0_-a10eecd74e-%5BLIST_EMAIL_ID%5DStrategies to prevent barriers for survivors to get support:Learn the dynamics of domestic violence: when the client is not showing up the way you think they should be showing up (i.e. grateful for the services), you may need to check for bias.Realize that some survivors that show up for support do not identify as a survivor. They may not be ready to identify as one yet. Understanding the space that the person is in and breaking down the barriers to make the correct offers for services is important.Create spaces for survivors to exist and to incorporate their voices within the organizations that support survivors (i.e. committees, advocates within the HMIS orgs).The biggest barrier is the initial conversation about how to ask the survivors about their experiences. Don't talk to more than 1 household member in the same room at a time. Have signs in the room that indicate that it's a safe space to talk about their experiences. Ask questions in different ways if a survivor is not saying that they are a survivor of domestic abuse. Listen to survivors.Not only hearing about safety planning while in crisis. Safety plans can look different to different people (i.e. cultural, racial, lived experience). Incorporate other people in your safety plan (i.e. a mentor, a coach). Encourage other non-partners into the safety plan to bring others into the conversation. Safety plan does not only end once the crisis ends, it continues beyond the crisis situation and into their daily lives after.Have an advocate/peer that is a survivor (not a service provider) that can help talk to other survivors who are in services; to be someone that they can relate to and understands what they're going through.There's 2 kind of Categories for Safety Planning:Immediate need for safety (they are in immediate danger); make sure to have enough money so that you can provide a safe place for them to go (example: hotel) if they do not want to go a violence shelter.If they are not in immediate danger: Build on a survivor's natural tendencies of them preparing for potential crisis situations that could happen in the home. Ask \"What will happen once your abuser finds out you left?\" and then build in steps to mitigate those things for the Safety Plan.Look at the Safety Plan for survivors whose abuser is in prison. The abuser in the prison has the right to know where the survivor is if they have children together if the survivor is the sole guardian of the children. Survivors would have to receive phone calls and bring the children to visit the abuser in prison. Prisons are not great about relaying information about the abuser being released from prison, which is another dynamic to think about for the safety of the survivor. A possible remedy is to pursue legal action for address confidentiality to protect that survivors address.Incorporating emotional intelligence for service providers.What does your office look like? Is it inviting? Is it cluttered?How are you perceived by the survivors? Are you flustered or seeming uncaring? Or are you acting/talking in a manner that would make the survivor comfortable and trustful of you so that they can talk to you freely?User trauma informed care. Be trained to support VAWA clients.Speak the survivors language; they don't know the language of the service providers.The survivors should not have to advocate for themselves with the service providers. A lot of VAWA providers do not know how to even implement the VAWA protections. Many survivors fall through the cracks due to service providers not knowing how to get the survivors all of the services that are available to them.Some survivors may show up to service providers and not know that they are victims of economic or technological abuse. Ask open ended questions that are non-judgmental (i.e. ask about their jobs) regarding economic abuse. As for technological abuse (i.e. being tracked on their phone, messages being read, being watched by a home camera system), implement software that is disguised as a non-communication software, but is used for safe communication between service providers and the survivors.There are many different ways that a survivor can experience economic abuse: being disrupted at work by the abuser, not being allowed to work, the abuser opening credit lines in the survivors name, creating debt for the survivor, even racking up bills from legal actions against the abuser.There are many different ways that a survivor can experience technological abuse: the abuser taking over the social media accounts, watching their social media or electronic communications, even the abuser sending messages as the survivor to other people using the survivor's electronic communications account.To help mitigate economic abuse for the survivors:Have the survivors take financial literacy courses or trainingHelp them understand healthy financial practicesHelp them know the red flags to look for and what the next steps should beThe focus is always on safety.Include a list of resources to TA, service providers, local services and supports.","title":"Summary: Community Conversations: VAWA in Practice - HUD Webinar News","url":"https://apricot-articles.socialsolutions.com/en/articles/8370255-summary-community-conversations-vawa-in-practice-hud-webinar-news"}