{"content":"Fall Conference: Oct. 23rd - 25th in Philadelphia, PAHUD resources are available to use to pay for registration. HMIS funds under CoC and ESG grants can be used. If no HMIS funds, then you can use admin funds.Proposed HUD-Sponsored Sessions:Institutes (seats limited):HMIS Fundamentals & System Modeling/Stella-M for FacilitatorsSessions Include:HMIS Lead Monitoring, Project Monitoring, Project Set-UpHMIS Project Management and Annual Calendar of ExpectationsSystem Performance Improvement: Analyzing Performance and Developing Improvement StrategiesLeveraging HUD Reports for System Planning and ImprovementStrategies for Evaluating and Monitoring Coordinated EntryQ&A with the HUD FY2024 HMIS Data Standards TA TeamResource is available on the HUD Exchange from end of July 2023 to support the project setup, data collection, and reporting efforts of recipients fundedWork with your CoC leadership to identify any projects within your HMIS implementation that have been awarded this funding. Reporting will be done for these project activities and performance on a quarterly basis, with an annual APR being uploaded at the end of the operating yearStella MTo make it a bit easier, here are two questions to ask:How many households do you think you can serve?What proportion (percentage) of those served in the universe need each pathway?Due to rounding, it is possible that some pre-existing models will have a change in the inventory results by one unit.Stella PNew charts located in the Demographics sectionBetter represents how people identify, as well as provides more information to communities that you can use to improve your systems and address inequities2.09 CE Participation StatusOn October 1st, all active projects AND any projects that were active during the most recent report period for any Coordinated Entry grants must have a 2.09 record.If the CE Participation Status Start Date is unknown but began prior to 10/01/2020 and has not changed, use 10/01/2020 as the Participation Status Start Date.If the CE Participation Status Start Date is unknown for a project that began after 10/01/2020, set the CE Participation Status Start Date equal to the project’s Operating Start Date.Project Setup Tool Updatedhttps://www.hudexchange.info/programs/hmis/hmis-project-set-up-tool/What is the LSA?Data from within your HMIS gets pulled into the Longitudinal System Analysis (LSA) report, which looks at everything that happened in the homelessness system in certain project types over the course of the federal fiscal year.What data does the LSA report include?The LSA report includes aggregate data for Emergency Shelter, Safe Havens, Transitional Housing, Rapid Rehousing, and Permanent Supportive Housing across 10 CSV files.The LSA also includes project data for Other Permanent Housing (project types 9 and 10), although it is not included in AHAR Part 2 and is not reviewed for data quality.Why are we collecting this data?The LSA is necessary for producing the national estimates required by Congress in the Annual Homelessness Assessment Report (AHAR).Changes for the FY2023 LSA reportProject Type ChangesEmergency Shelter: Used to have 2 different sub-types, but those are now their own project types (Night-by-Night and Entry/Exit).Rapid Rehousing: Now has 2 different sub-types (“Services Only” and “Housing with or without services”).Changes to Lists of Response Options for Race/Ethnicity, Gender, Living SituationsWhat should you be doing now?Update your contact information in HDX 2.0 under “My Account”. The AHAR team and LSA team use that information in HDX 2.0 to start communicating with you to get the process started. It’s important that all contact information is correct and up to dateReview Preparing for the LSA: Guidance on Common Data Quality IssuesClean your data using EvaWhat does Eva do?File Structure AnalysisClient CountsData QualityEva’s 3 Levels of IssuesHigh Priority Errors *Aim to have 0Always indicates a data quality issue that can and should be fixed in HMIS.General Errors *Aim to have 0Always indicates a data quality issue that can and should be fixed in HMIS.WarningsMay be data quality issue, but may also be an unexpected situation that reflects reality.It is okay and expected to have some warnings.End users should check that any data being flagged as a Warning is accurate in their HMIS. If it is not accurate, then it should be corrected. If it is accurate, it should be left as is.Eva ResourcesEva page on HUD ExchangeEva Quick Start GuideEva GitHubFull list of Eva Checkshttps://www.hudexchange.info/programs/hmis/hmis-lead-sys-admin-webinars/\n\nHUD Monthly HMIS Webinar August 2023https://files.hudexchange.info/resources/documents/HMIS-Lead-System-Administrator-Monthly-Webinar-Slides-August-16-2023.pdfhttps://files.hudexchange.info/resources/documents/HMIS-Lead-System-Administrator-Monthly-Webinar-Transcript-August-16-2023.pdfhttps://files.hudexchange.info/resources/documents/HMIS-Lead-System-Administrator-Monthly-Webinar-Q-A-August-16-2023.pdfReportTimelineStellavisificationAvailable Now in HDX 2.0ESG-CV ReportingDue: October 30, 2023SSVF Monthly Uploads – June 2023September 1 to 7, 2023YHDP Quarterly Report (Round 4/5 only)Due: October 30, 2023RHY Reporting (Quarterly)Q4a – FY23 For grants ending 09/2023 Upload Period: September 4-15, 2023 Reporting period: 10/1/2022 to 8/31/2023* (11 months)Q4b – FY23 For grants not ending in 09/2023 Upload Period: October 16-27, 2023 Reporting period: 10/1/2022 to 9/30/2023 (12 months)*table from the HMIS Lead Monthly Webinar Slides for AUG 2023","title":"Summary: August HMIS Lead Webinar","url":"https://apricot-articles.socialsolutions.com/en/articles/8390595-summary-august-hmis-lead-webinar"}