{"content":"The information in this article pertains only to customers with AHS. This release will include the 2024 updates for HMIS Data Standards. These changes will automatically be implemented in your instance of Apricot on September 29th, 2023.This list may not cover all changes made. For a complete breakdown of what has changed for FY2024 (non-Apricot specific) as well as collection point details, please visit the following page:HMIS Data StandardsTo locate data elements within the forms, please use the Data Map provided below:HMIS Data MapBelow is a detailed summary of the changes being implemented on 9/29.“Client refused” has been updated to “Client prefers not to answer”“Domestic Violence Victim” has been updated to “Survivor of Domestic Violence”Logic changes lead to expanded question availability in formsCompliance Report updates to match all required changes (APR/CAPER/CE-APR, etc.)Due to new changes rolled out by HUD on 9/26, the PATH report will not be available on its updated format. Please keep an eye out for communications about when the updated report will be available.Gender\"Female\" has been updated to \"Woman (Girl if child)\"\"Male\" has been updated to \"Man (Boy if child)\"\"A gender that is not singularly 'Female' or 'Male' (e.g., non-binary, genderfluid, agender, culturally specific gender)\" has been updated to \"Non-Binary\"Two new options have been added:\"Culturally Specific Identity (e.g., Two-Spirit)\"\"Different Identity\" with a text box to specifyRace and EthnicityThe two fields have been combined into a single demographic\"Hispanic/Latin(a)(o)(x)\" has been updated to \"Hispanic/Latina/e/o\"Two new options have been added:\"Middle Eastern or North African\"\"Additional Race and Ethnicity Detail\" with a text box to specifyV1 Field 11A new response has been added: \"Space Force\"HMIS/CE Participation Status (NEW!)Important Note:A new required form has been created for data to be collected to track a project's HMIS participation status with a Start Date and End Date. The same applies for Coordinated Entry participation status, in addition to tracking the type of CE Project and whether it receives Referrals. This data must be transactional, or collected whenever any changes occur for a project.All organizations must enter a response for both statuses in this form for all projects as part of the FY2024 Data Standards. This means each project will have 2 records of this form: one specifying the HMIS Participation status and a second detailing the CE Participation status.Income and Benefits Assessment4.04 Field 6 \"Veteran's Administration (VA)\" has been updated to \"Veteran's Health Administration (VHA)\"The following fields have been removed:W3 Medical Assistance Field 2Dependent A (Receiving Public HIV/AIDS Medical Assistance) The following fields have been moved from the HMIS Assessment to the Income and Benefits Assessment:4.04 \"Minor text updates\"W3 SectionProgram EnrollmentV4 Field 1 responses have been updated:\"30% or less\"\"31% to 50%\"\"51% to 80%\"\"81% or greater\"V5 Last Permanent Address has been removedHMIS AssessmentThe following fields have been removed:C1 Wellbeing and all other wellbeing questionsU1 Worst Housing SituationW3 Field 2 and Dependent A (Receiving Public HIV/AIDS Medical Assistance)A new field has been added – \"C4 Translation Assistance Needed\"The field includes the following:Yes/No for assistance neededa list of preferred languagesa text box to specify if a different language than those from the list appliesTwo elements received an updated answer list and additional details to collect for a Subsidy Type as part of Appendix A:3.12 Destination3.917 Prior Living Situation4.04 Field 6 \"Veteran's Administration (VA)\" has been updated to \"Veteran's Health Administration (VHA)\"W5 Field 1 has new or updated responses:\"Jail/prison\"\"Deceased\"Ongoing Street Contact for Emergency Shelters, Street Outreach, and Services Projects4.12 \"Current Living Situation\" has an updated answer list and additional details to collect for a Subsidy Type as part of Appendix AProjectThe following fields have been removed:“Emergency Shelter Tracking Method”\"HMIS Participating Project\"Two new project types have been added:“Emergency Shelter – Night-by-Night”“Emergency Shelter – Entry Exit”Two funding sources have been removed:“HUD: CoC – Joint Component RRH/PSH”“HUD: Rural Housing Stability Assistance Program”Three funding sources have been added:“HUD: ESG RUSH”“HUD: Unsheltered/Rural NOFO”“HUD: Rural Special NOFO”A new field has been added for identifying “RRH Subtype”Coordinated Entry Event4.20 Dependent C has been changed to a list of applicable projectsServices ProvidedR14 has an updated response – Response 12 “Post-natal care for client (person who gave birth)”V2 Field 2 has an updated response – Response 7 “Shallow Subsidy”V3 ChangesField 1 text has been updated to “Start Date of Financial Assistance”Field 3 has new or updated responses:Response 10 “Child care”Response 15 “Shallow subsidy – financial assistance”“Landlord incentive”“Tenant incentive”A new field has been added – “End Date of Financial Assistance”RHY FormR18 Field 1 and Field 2 received minor text updates","title":"Release Notes | AHS FY2024 Updates","url":"https://apricot-articles.socialsolutions.com/en/articles/8400392-release-notes-ahs-fy2024-updates"}