{"content":"Note: This guide is for setting up and troubleshooting SFTP (Secure File Transfer Protocol) specifically for Automated Import. For Automated Import Attachments, see our guide here.SFTP is an added feature utilized by Apricot customers to transfer data to Apricot. SFTP utilizes a CSV to upload into the Apricot Import tool.SFTP is implemented with a Professional Services team. If your account is interested in acquiring SFTP, please contact your Account Manager at accountmanagement@socialsolutions.comPrepare your data for upload. To create Tier 1 Records, follow steps 1-9 in this article. To create Tier 2 records, follow this article until you've saved the .csv template.Save the file and move the file into Filezilla/SFTP Software.Wait for the notification that the transfer was successful.Navigate to the Import page in Apricot (Administrator > Record Manager > Import).Find the form you imported and expand the arrow to see if the transfer was successful. If it was successful, you will see a tag next to the import that says \"Automated\".Ensure the SSH Public Key information is correct in Apricot Settings. Ensure the Import CSV has valid data.If you are choosing a Tier 2 form, ensure that you have the correct Record ID or First and Last Name to match the Tier 1 records.Treat the data like a regular import.\"A validation error occurred saving the ssh public key. The key must satisfy the pattern: ^ssh-rsa\\s+[A-Za-z0-9+/]+[=]{0,3}(\\s+.+)?\\s*$\"This error means that the public key entered is not in the correct format. Generally, this indicates that a string was used with more items in it than Apricot expects. The expected format for the public key is:ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAQEAhlE70TS+6FQfxKIgz2SsF4TObRo/8WFLrPHBnGB/yZXgoR4oTHm/NIt4caIQEvN5LNiL61behrpm82bBR6kwevB8Q1MkSny51/NxplXpQb5XYD/WWWJkjE1JocSedWPe3kiqNXThZwKaMvBffswE9a9+VUFhE6IAH8TzYf7/xZ6tAyXQKhBUo8iG9/pBbxY+QHBGxi2BibuzjCwBQB9/7M5woql7vPf7U4+Aym0T0XlXJ5O4tZ2oaXtr/OCtTpNGKRxusQiKSU3v/o6OR1SrrtyYWVi/t7keUX0qPb5I3L9ttCvJjScQ2Jz+W+rB9VGVvOr515z8YkjvMkruwWnDrw== rsa-key-20210303If the key is in the expected format and still not accepted, you may need to generate a new public and private key pair.If you have questions regarding this article, or are experiencing connection errors, IP address errors, or other issues using SFTP, please reach out to our support team at Apricot@bonterratech.com. Please provide the configuration file, data file, and the errors you encounter when uploading.","title":"FAQs | SFTP for Automated Import","url":"https://apricot-articles.socialsolutions.com/en/articles/8426028-faqs-sftp-for-automated-import"}